[

{
    "text": "The figure 5.1 presentation showcases two instances where a current source is beneficial. As previously discussed in Chapter 2, remember that the output resistance, capacitance, and the voltage headroom of a current source are interconnected with the magnitude of the output current. Beyond these considerations, various other facets of current sources are crucial, such as supply, process, and temperature sensitivity; output noise current; and matching with other current sources. The discussions on noise and matching will be addressed in Chapters 7 and 14, respectively.\n\nFigure 5.1 presents applications of current sources.\n\nIn the figure 5.2 illustration, the concept of current is defined using a resistive divider.\nimage_name:Figure 5.2 Definition of current by resistive divider.\ndescription:\n[\nname: R1, type: Resistor, value: R1, ports: {N1: VDD, N2: g1}\nname: R2, type: Resistor, value: R2, ports: {N1: g1, N2: GND}\nname: M1, type: NMOS, ports: {S: GND, D: Iout, G: g1}\n]\nextrainfo:This circuit diagram depicts a simple resistive biasing network for an NMOS transistor M1. The resistors R1 and R2 create a voltage divider, setting the gate voltage of M1. The NMOS transistor is set up to function as a current source with Iout as the output current. The load is connected to the drain of M1.\n\nTo ensure stable operation as a current source, how should a MOSFET be biased? To better understand the challenges, let us analyze the basic resistive biasing depicted in Fig. 5.2. Assuming $M_{1}$ operates in saturation, we can express\n\n$$\n\\begin{equation*}\nI_{\\text {out }} \\approx \\frac{1}{2} \\mu_{n} C_{o x} \\frac{W}{L}\\left(\\frac{R_{2}}{R_{1}+R_{2}} V_{D D}-V_{T H}\\right)^{2} \\tag{5.1}\n\\end{equation*}\n$$\n\nThis equation unveils numerous PVT dependencies of $I_{\\text {out }}$. The overdrive voltage is dependent on $V_{D D}$ and $V_{T H}$; the threshold voltage may differ by 50 to 100 mV from wafer to wafer. Moreover, both $\\mu_{n}$ and $V_{T H}$ display temperature dependence. Consequently, $I_{o u t}$ is inadequately defined. The issue intensifies as the device is biased with a lower overdrive voltage, for instance, to conserve headroom and accommodate broader voltage swings at the drain. With an average overdrive of approximately 200 mV, a 50-mV error in $V_{T H}$ translates to a 44% error in the output current.\n\nIt is important to acknowledge that process and temperature sensitivities persist even if the gate voltage is not directly linked to the supply voltage. In other words, if the gate-source voltage of a MOSFET is precisely set, its drain current may not be! Consequently, we must seek alternative biasing methods for MOS current sources.\n\nThe design of current sources in analog circuits relies on \"replicating\" currents from a reference, assuming the availability of one precisely defined current source. Although this approach might seem like an endless loop, it is executed as depicted in Fig. 5.3. A relatively intricate circuit, sometimes requiring external adjustments, generates a stable reference current, $I_{R E F}$, which is then \"replicated\" to create numerous current sources in the system. We delve into the copying process here and the reference generator (based on \"bandgap\" techniques) in Chapter 12.\nimage_name:Figure 5.3 Use of a reference to generate various currents.\ndescription:\n[\nname: I_REF, type: CurrentSource, value: I_REF, ports: {Np: Reference Generator, Nn: X_I1}\nname: I_1, type: CurrentSource, value: I_1, ports: {Np: VDD, Nn: X_I1}\nname: I_2, type: CurrentSource, value: I_2, ports: {Np: X_I1, Nn: GND}\nname: V_DD, type: VoltageSource, value: V_DD, ports: {Np: VDD, Nn: GND}\n]\nextrainfo:This circuit employs a reference current (I_REF) generated by a reference generator to establish multiple current sources (I_1 and I_2). The current I_1 is connected to the power supply VDD and node X_I1, while I_2 is connected between node X_I1 and ground.\n\nHow do we replicate a reference current? For instance, in Fig. 5.4, how do we ensure that $I_{\\text {out }}=I_{R E F}$ ? For a MOSFET, if $I_{D}=f\\left(V_{G S}\\right)$, where $f(\\cdot)$ denotes the dependency of $I_{D}$ on $V_{G S}$, then $V_{G S}=f^{-1}\\left(I_{D}\\right)$. That is, if a transistor is biased at $I_{R E F}$, it generates $V_{G S}=f^{-1}\\left(I_{R E F}\\right)$. Therefore, if this voltage is applied to the gate and source terminals of a second MOSFET, the resulting current is $I_{\\text {out }}=f\\left[f^{-1}\\left(I_{R E F}\\right)\\right]=I_{R E F}[$ Fig. 5.5(a)]. Alternatively, from another perspective, two identical MOS devices that have the same gate-source voltage and operate in saturation carry equal currents (assuming $\\lambda=0$ ).\nimage_name:Figure 5.4\ndescription:The circuit in Figure 5.4 is a conceptual representation of a current copying mechanism. It utilizes a current mirror configuration to replicate the reference current I_REF at the output, I_out, through a load. The NMOS transistors M1 and M2 are configured so that M1 is diode-connected, and M2 mirrors the current from M1 to the output.\nimage_name:Fig. 5.5(a)\ndescription:\n[\nname: M1, type: NMOS, ports: {S: GND, D: d1g1, G: d1g1}\nname: I_REF, type: CurrentSource, value: I_REF, ports: {Np: VDD, Nn: d1g1}\nname: V_DD, type: VoltageSource, value: V_DD, ports: {Np: VDD, Nn: GND}\n]\nextrainfo:The circuit in Fig. 5.5(a) is a diode-connected NMOS transistor configuration designed to establish a reference voltage across M1. The current source I_REF biases the NMOS M1, producing a voltage drop across its gate and drain, which are shorted together.\nimage_name:Fig. 5.5(b)\ndescription:\n[\nname: M1, type: NMOS, ports: {S: GND, D: d1g1g2, G: d1g1g2}\nname: M2, type: NMOS, ports: {S: GND, D: d2g1g2, G: d1g1g2}\nname: I_REF, type: CurrentSource, value: I_REF, ports: {Np: VDD, Nn: d1g1}\nname: V_DD, type: VoltageSource, value: V_DD, ports: {Np: VDD, Nn: GND}\n]\nextrainfo:The circuit in Fig. 5.5(b) is a fundamental current mirror composed of two NMOS transistors, M1 and M2. M1 is diode-connected, with its gate and drain interconnected, establishing a reference current path with I_REF. M2 mirrors the current from M1 to the output node d2. This setup is used to replicate the reference current I_REF at the output.\n\nThe structure comprising $M_{1}$ and $M_{2}$ in Fig. 5.5(b) is known as a \"current mirror.\" In general, the transistors do not need to be identical. Disregarding channel-length modulation, we can write\n\n$$\n\\begin{align*}\nI_{R E F} & =\\frac{1}{2} \\mu_{n} C_{o x}\\left(\\frac{W}{L}\\right)_{1}\\left(V_{G S}-V_{T H}\\right)^{2}  \\tag{5.2}\\\\\nI_{o u t} & =\\frac{1}{2} \\mu_{n} C_{o x}\\left(\\frac{W}{L}\\right)_{2}\\left(V_{G S}-V_{T H}\\right)^{2} \\tag{5.3}\n\\end{align*}\n$$\n\nleading to\n\n$$\n\\begin{equation*}\nI_{\\text {out }}=\\frac{(W / L)_{2}}{(W / L)_{1}} I_{R E F} \\tag{5.4}\n\\end{equation*}\n$$\n\nA key characteristic of this topology is its ability to precisely replicate the current with no dependence on process and temperature. The transition from $I_{R E F}$ to $I_{\\text {out }}$ simply involves the ratio of device dimensions, which can be controlled with reasonable accuracy.\n\nIt is crucial to comprehend the cause-and-effect relationships dictated by $V_{G S}=f^{-1}\\left(I_{R E F}\\right)$ and $f\\left[f^{-1}\\left(I_{R E F}\\right)\\right]=I_{R E F}$. The former indicates that a $V_{G S}$ must be generated from $I_{R E F}$; that is, $I_{R E F}$ is the cause and $V_{G S}$ is the effect. A MOSFET can fulfill this role only if it is configured as a diode while conducting a current of $I_{R E F}$ [Fig. 5.5(b)]. Similarly, the latter equation implies that a transistor must sense $f^{-1}\\left(I_{R E F}\\right)\\left(=V_{G S}\\right)$ and produce $f\\left[f^{-1}\\left(I_{R E F}\\right)\\right]$. In this instance, the cause is $V_{G S}$ and the effect is the output current, $f\\left[f^{-1}\\left(I_{R E F}\\right)\\right]$ [as provided by $M_{2}$ in Fig. 5.5(b)].\n\nWith the assistance of these insights, we can comprehend why a circuit like that in Fig. 5.6 is not capable of current copying. Here, $V_{b}$ is not influenced by $I_{R E F}$, and hence $I_{\\text {out }}$ does not track $I_{R E F}$.\nimage_name:Figure 5.6 Circuit incapable of copying current.\ndescription:\n[\nname: IREF, type: CurrentSource, value: IREF, ports: {Np: VDD, Nn: d1}\nname: M1, type: NMOS, ports: {S: GND, D: d1, G: Vb}\nname: M2, type: NMOS, ports: {S: GND, D: Iout, G: Vb}\n]\nextrainfo:This circuit attempts to copy current but fails because Vb is not affected by IREF, causing Iout not to match IREF. The circuit incorporates a load connected to the drain of M2.\n\n#### Example 5.1\n\nIn Fig. 5.7, determine the drain current of $M_{4}$ assuming all transistors are in saturation.\nimage_name:Figure 5.7\ndescription:\n[\nname: M1, type: NMOS, ports: {S: GND, D: d1g1g2, G: d1g1g2}\nname: M2, type: NMOS, ports: {S: GND, D: X, G: d1g1g2}\nname: M3, type: PMOS, ports: {S: VDD, D: X, G: X}\nname: M4, type: PMOS, ports: {S: VDD, D: Iout, G: X}\nname: I_REF, type: CurrentSource, ports: {Np: VDD, Nn: d1g1g2}\n]\nextrainfo:This circuit is designed to create a current mirror configuration using NMOS and PMOS transistors. The drain current of M4 can be calculated using the given relationships between the transistor dimensions, assuming all transistors are in saturation.\n\n#### Solution\n\nWe have $I_{D 2}=I_{R E F}\\left[(W / L)_{2} /(W / L)_{1}\\right]$. Also, $\\left|I_{D 3}\\right|=\\left|I_{D 2}\\right|$ and $I_{D 4}=I_{D 3} \\times\\left[(W / L)_{4} /(W / L)_{3}\\right]$. Thus, $\\left|I_{D 4}\\right|=$ $\\alpha \\beta I_{R E F}$, where $\\alpha=(W / L)_{2} /(W / L)_{1}$ and $\\beta=(W / L)_{4} /(W / L)_{3}$. Appropriate selection of $\\alpha$ and $\\beta$ can establish large or small ratios between $I_{D 4}$ and $I_{R E F}$. For example, $\\alpha=\\beta=5$ results in a magnification factor of 25. Similarly, $\\alpha=\\beta=0.2$ can be employed to generate a small, well-defined current.\n\nWe also note that the replica of a replica may not be as \"clear\" as the original. Due to random \"mismatches\" between $M_{1}$ and $M_{2}$ in the above example, $I_{D 2}$ slightly deviates from its nominal value. Similarly, as $I_{D 2}$ is replicated onto $I_{D 4}$, additional errors accumulate. Therefore, we must avoid long current mirror chains.\n\nCurrent mirrors are widely utilized in analog circuits. Figure 5.8 presents a typical application, where a differential pair is biased using an NMOS mirror for the tail current source and a PMOS mirror\nimage_name:Figure 5.8\ndescription:The circuit diagram in Figure 5.8 is a differential amplifier biased by NMOS and PMOS current mirrors. The NMOS devices M0, M1, M2, M7, and M8 form the tail current source and differential pair. PMOS devices M3, M4, M5, M6, and M9 form the load current sources. The circuit is designed to increase gain by reducing the drain current in M3 and M4, achieved through specific device sizing.\nimage_name:Figure 5.8 Current mirrors used to bias a differential amplifier.\nfor the load current sources. The device dimensions shown result in a drain current of $0.4 I_{T}$ in $M_{5}$ and $M_{6}$, reducing the drain current of $M_{3}$ and $M_{4}$ and thereby increasing the amplifier's gain.\n\nSizing Issues Current mirrors generally use the same length for all transistors to minimize errors due to the side diffusion of the source and drain areas (LD). For instance, in Fig. 5.8, the NMOS current sources must have the same channel length as $M_{0}$. This is because if $L_{\\text {drawn }}$ is, say, doubled, then $L_{\\text {eff }}=L_{\\text {drawn }}-2 L_{D}$ is not. Moreover, the threshold voltage of short-channel devices is somewhat dependent on the channel length (Chapter 17). Hence, current ratioing is achieved by scaling only the width of the transistors.\n\nSuppose we wish to replicate a reference current, $I_{R E F}$, and generate $2 I_{R E F}$. We start with a width of $W_{R E F}$ for the diode-connected reference transistor and choose $2 W_{R E F}$ for the current source [Fig. 5.9(a)]. Unfortunately, directly scaling the width also poses challenges. As depicted in Fig. 5.9(b), since the \"corners\" of the gate are poorly defined, if the drawn $W$ is doubled, the actual width does not precisely double. We thus prefer to use a \"unit\" transistor and create copies by repeating such a device [Fig. 5.9(c)].\nimage_name:(a)\ndescription:The circuit diagram (a) shows a current mirror configuration to multiply the reference current I_REF by 2 using two NMOS transistors. The transistor MREF is diode-connected with its gate and drain connected to the node X1. M2 is configured to provide a mirrored current of 2*I_REF to the load. The current source IREF provides the reference current to the circuit.\nimage_name:(b)\ndescription:The image labeled as (b) illustrates the effect of gate corners on current accuracy in a transistor. This diagram provides both a top view and a cross-sectional view labeled 'AA View'.\n\n1. **Identification of Components and Structure:**\n- The **top view** illustrates a rectangular structure with a width labeled 'W'. It features several square elements, possibly representing contact points or regions on the transistor gate.\n- The **AA view** presents a cross-section that emphasizes the gate structure, showing how the corners of the gate are rounded or poorly defined.\n- Key components in the cross-section include the **gate**, **oxide layer**, and **channel**.\n\n2. **Connections and Interactions:**\n- The cross-sectional view highlights the interaction between the gate, oxide, and channel. The rounded corners of the gate can lead to inaccuracies in current flow, as they affect the effective width 'W' of the channel.\n- The oxide layer acts as an insulating barrier between the gate and the channel, crucial for controlling the current flow.\n\n3. **Labels, Annotations, and Key Features:**\n- The width 'W' is a critical dimension in both views, demonstrating the intended width of the gate.\n- The label 'Gate Corner' points out the area where inaccuracies may arise due to the physical shape of the gate.\n- The terms 'Oxide' and 'Channel' in the cross-section denote the layers involved in the transistor's operation, with the channel being the path for current flow.\n\nThis diagram is used to explain why merely scaling up the width of a transistor may not proportionally increase the current, due to the imprecise definition of the gate corners.\nimage"
},
{
    "text": "---\n\nImage Descriptions: Textual descriptions have been generated for images referenced in the [Context Provided]. Rephrasing of the content in the [Context Provided] Section is required while preserving the original meaning and length.\n\n---[Task]---\nPlease rephrase the text within the [Context Provided] Section. Ensure that the rephrased version retains the original meaning and length. Only provide the rephrased text.\n\n---[Context Provided]---\nThe rephrased text:\n\n```\nIllustration 5.1 displays two scenarios where a current source is advantageous. Referring back to Chapter 2, you'll remember that the output resistance and capacitance, as well as the voltage headroom, of a current source are interchanged with the magnitude of the output current. Beyond these elements, several other factors regarding current sources are crucial: their power supply, process, and temperature sensitivity; the output noise current; and their compatibility with other current sources. We will address the issues of noise and matching in Chapters 7 and 14.\n\nimage_name:(a)\ndescription:\n[\nname: M1, type: NMOS, ports: {S: GND, D: Vout, G: Vin}\nname: M2, type: PMOS, ports: {S: VDD, D: Vout, G: Vout}\nname: I1, type: CurrentSource, value: I1, ports: {Np: VDD, Nn: Vout}\n]\nextrainfo:Diagram (a) depicts a setup incorporating NMOS M1 and PMOS M2 and M3 transistors, which form a current source at Vout. The current source I1 connects VDD to Vout, while M3 is utilized for biasing, with its gate linked to Vb.\n\nimage_name:(b)\ndescription:The diagram in (b) presents a current mirror arrangement utilizing NMOS and PMOS transistors. The NMOS transistor M1 is connected to the input voltage Vin, and PMOS transistors M2 and M3 create a current mirror. The current source ISS is connected from node p to ground, delivering biasing current for the PMOS transistors.\n\nFigure 5.1 depicts the uses of current sources.\n\nimage_name:Figure 5.2 portrays the concept of current through a resistive divider.\ndescription:\n[\nname: R1, type: Resistor, value: R1, ports: {N1: VDD, N2: g1}\nname: R2, type: Resistor, value: R2, ports: {N1: g1, N2: GND}\nname: M1, type: NMOS, ports: {S: GND, D: Iout, G: g1}\n]\nextrainfo:This diagram illustrates a straightforward resistive biasing network for NMOS transistor M1. The resistors R1 and R2 constitute a voltage divider that determines the gate voltage of M1. The NMOS transistor is configured to act as a current source, with Iout serving as the output current. The load is connected to the drain of M1.\n\nHow can a MOSFET be biased to operate as a stable current source? To gain a clearer understanding of the challenges, let's examine the simple resistive biasing depicted in Fig. 5.2. Assuming $M_{1}$ is in saturation, we can derive\n\n$$\n\\begin{equation*}\nI_{\\text {out }} \\approx \\frac{1}{2} \\mu_{n} C_{o x} \\frac{W}{L}\\left(\\frac{R_{2}}{R_{1}+R_{2}} V_{D D}-V_{T H}\\right)^{2} \\tag{5.1}\n\\end{equation*}\n$$\n\nThis equation highlights the various process and temperature dependencies of $I_{\\text {out }}$. The overdrive voltage is influenced by $V_{D D}$ and $V_{T H}$; the threshold voltage can vary from 50 to 100 mV across different wafers. Moreover, both $\\mu_{n}$ and $V_{T H}$ are temperature-dependent, rendering $I_{o u t}$ poorly defined. The problem intensifies as the device is biased with a smaller overdrive voltage, such as to minimize headroom and support wider voltage swings at the drain. For an overdrive of approximately 200 mV, a 50-mV error in $V_{T H}$ leads to a 44% error in the output current.\n\nIt is crucial to recognize that process and temperature dependencies persist even if the gate voltage is independent of the supply voltage. In other words, if the gate-source voltage of a MOSFET is precisely defined, its drain current is not! Consequently, alternative biasing methods for MOS current sources must be sought.\n\nThe design of current sources in analog circuits relies on replicating currents from a reference, assuming a precisely defined current source is available. Although this method seems to create an endless loop, it is implemented as shown in Fig. 5.3. A complex circuit, sometimes necessitating external adjustments, generates a stable reference current, $I_{R E F}$, which is then replicated to create multiple current sources in the system. We explore the replication process here, as well as the reference generator (which employs \"bandgap\" techniques) in Chapter 12.\n\nimage_name:Figure 5.3 demonstrates the use of a reference to generate diverse currents.\ndescription:\n[\nname: I_REF, type: CurrentSource, value: I_REF, ports: {Np: Reference Generator, Nn: X_I1}\nname: I_1, type: CurrentSource, value: I_1, ports: {Np: VDD, Nn: X_I1}\nname: I_2, type: CurrentSource, value: I_2, ports: {Np: X_I1, Nn: GND}\nname: V_DD, type: VoltageSource, value: V_DD, ports: {Np: VDD, Nn: GND}\n]\nextrainfo:This circuit harnesses a reference current (I_REF) produced by a reference generator to create multiple current sources (I_1 and I_2). The current I_1 is connected to the power supply VDD and node X_I1, while I_2 is connected between node X_I1 and ground.\n\nHow do we produce replicas of a reference current? For instance, in Fig. 5.4, how can we ensure that $I_{\\text {out }}=I_{R E F}$ ? For a MOSFET, if $I_{D}=f\\left(V_{G S}\\right)$, where $f(\\cdot)$ denotes the dependence of $I_{D}$ on $V_{G S}$, then $V_{G S}=f^{-1}\\left(I_{D}\\right)$. That is, if a transistor is biased at $I_{R E F}$, it produces $V_{G S}=f^{-1}\\left(I_{R E F}\\right)$ [Fig. 5.5(a)]. Consequently, if this voltage is applied to the gate and source terminals of a second MOSFET, the resulting current is $I_{\\text {out }}=f\\left[f^{-1}\\left(I_{R E F}\\right)\\right]=I_{R E F}[$ Fig. $5.5(\\mathrm{~b})]$. From another perspective, two identical MOS devices that have equivalent gate-source voltages and operate in saturation carry equivalent currents (assuming $\\lambda=0$ ).\n\nimage_name:Figure 5.4\ndescription:The circuit in Figure 5.4 conceptually represents a current duplication mechanism. It utilizes a current mirror configuration to replicate the reference current I_REF at the output, I_out, through a load. The NMOS transistors M1 and M2 are configured such that M1 is diode-connected, and M2 mirrors the current from M1 to the output.\nimage_name:Fig. 5.5(a)\ndescription:\n[\nname: M1, type: NMOS, ports: {S: GND, D: d1g1, G: d1g1}\nname: I_REF, type: CurrentSource, value: I_REF, ports: {Np: VDD, Nn: d1g1}\nname: V_DD, type: VoltageSource, value: V_DD, ports: {Np: VDD, Nn: GND}\n]\nextrainfo:The circuit in Fig. 5.5(a) features a diode-connected NMOS transistor arrangement for establishing a reference voltage across M1. The current source I_REF biases the NMOS M1, generating a voltage drop across its gate and drain, which are shorted together.\n\nimage_name:Fig. 5.5(b)\ndescription:\n[\nname: M1, type: NMOS, ports: {S: GND, D: d1g1g2, G: d1g1g2}\nname: M2, type: NMOS, ports: {S: GND, D: d2g1g2, G: d1g1g2}\nname: I_REF, type: CurrentSource, value: I_REF, ports: {Np: VDD, Nn: d1g1}\nname: V_DD, type: VoltageSource, value: V_DD, ports: {Np: VDD, Nn: GND}\n]\nextrainfo:The circuit in Fig. 5.5(b) consists of a basic current mirror using two NMOS transistors, M1 and M2. M1 is diode-connected, signifying that its gate and drain are connected together, creating a reference current path with I_REF. M2 mirrors the current from M1 to the output node d2. This arrangement is used to replicate the reference current I_REF at the output.\n\nThe structure formed by $M_{1}$ and $M_{2}$ in Fig. 5.5(b) is known as a \"current mirror.\" In general, the transistors need not be identical. Disregarding channel-length modulation, we can write\n\n$$\n\\begin{align*}\nI_{R E F} & =\\frac{1}{2} \\mu_{n} C_{o x}\\left(\\frac{W}{L}\\right)_{1}\\left(V_{G S}-V_{T H}\\right)^{2}  \\tag{5.2}\\\\\nI_{o u t} & =\\frac{1}{2} \\mu_{n} C_{o x}\\left(\\frac{W}{L}\\right)_{2}\\left(V_{G S}-V_{T H}\\right)^{2} \\tag{5.3}\n\\end{align*}\n$$\n\nresulting in\n\n$$\n\\begin{equation*}\nI_{\\text {out }}=\\frac{(W / L)_{2}}{(W / L)_{1}} I_{R E F} \\tag{5.4}\n\\end{equation*}\n$$\n\nThe key feature of this topology is its ability to precisely replicate the current without process or temperature dependencies. The conversion from $I_{R E F}$ to $I_{\\text {out }}$ merely involves the ratio of device dimensions, a factor that can be controlled with reasonable accuracy.\n\nIt is essential to recognize the cause-and-effect relationships defined by $V_{G S}=f^{-1}\\left(I_{R E F}\\right)$ and $f\\left[f^{-1}\\left(I_{R E F}\\right)\\right]=I_{R E F}$. The former indicates that we must generate a $V_{G S}$ based on $I_{R E F}$; i.e., $I_{R E F}$ is the cause and $V_{G S}$ is the effect. A MOSFET can fulfill this role only if it is configured as a diode while carrying a current of $I_{R E F}$ [Fig. 5.5(b)]. Similarly, the latter equation implies that a transistor must sense $f^{-1}\\left(I_{R E F}\\right)\\left(=V_{G S}\\right)$ and generate $f\\left[f^{-1}\\left(I_{R E F}\\right)\\right]$. In this instance, the cause is $V_{G S}$ and the effect is the output current, $f\\left[f^{-1}\\left(I_{R E F}\\right)\\right]$ [provided by $M_{2}$ in Fig. 5.5(b)].\n\nWith the help of these insights, we can comprehend why a circuit like that in Fig. 5.6 fails to perform current copying. Here, $V_{b}$ is not influenced by $I_{R E F}$, and thus $I_{\\text {out }}$ does not follow $I_{R E F}$.\n\nimage_name:Figure 5.6 illustrates a circuit that cannot replicate current.\ndescription:\n[\nname: IREF, type: CurrentSource, value: IREF, ports: {Np: VDD, Nn: d1}\nname: M1, type: NMOS, ports: {S: GND, D: d1, G: Vb}\nname: M2, type: NMOS, ports: {S: GND, D: Iout, G: Vb}\n]\nextrainfo:The circuit is designed for current copying but fails because Vb is not affected by IREF, causing Iout not to follow IREF. The circuit includes a load connected to the drain of M2.\n\n#### Example 5.1\n\nDetermine the drain current of $M_{4}$ in Fig. 5.7, assuming all transistors are in saturation.\n\nimage_name:Figure 5.7\ndescription:\n[\nname: M1, type: NMOS, ports: {S: GND, D: d1g1g2, G: d1g1g2}\nname: M2, type: NMOS, ports: {S: GND, D: X, G: d1g1g2}\nname: M3, type: PMOS, ports: {S: VDD, D: X, G: X}\nname: M4, type: PMOS, ports: {S: VDD, D: Iout, G: X}\nname: I_REF, type: CurrentSource, ports: {Np: VDD, Nn: d1g1g2}\n]\nextrainfo:The circuit is constructed to establish a current mirror configuration with NMOS and PMOS transistors. The drain current of M4 can be calculated using the given relationships between the transistor dimensions. All transistors are assumed to be in saturation.\n\n#### Solution\n\nWe have $I_{D 2}=I_{R E F}\\left[(W / L)_{2} /(W / L)_{1}\\right]$. Also, $\\left|I_{D 3}\\right|=\\left|I_{D 2}\\right|$ and $I_{D 4}=I_{D 3} \\times\\left[(W / L)_{4} /(W / L)_{3}\\right]$. Thus, $\\left|I_{D 4}\\right|=$ $\\alpha \\beta I_{R E F}$, where $\\alpha=(W / L)_{2} /(W / L)_{1}$ and $\\beta=(W / L)_{4} /(W / L)_{3}$. Proper choice of $\\alpha$ and $\\beta$ can establish large or small ratios between $I_{D 4}$ and $I_{R E F}$. For instance, $\\alpha=\\beta=5$ produces a magnification factor of 25 . Similarly, $\\alpha=\\beta=0.2$ can be used to generate a small, well-defined current.\n\nWe should also note that a copy of a copy may not be as \"clear\" as the original. Due to random \"mismatches\" between $M_{1}$ and $M_{2}$ in the above example, $I_{D 2}$ slightly deviates from its nominal value. Similarly, as $I_{D 2}$ is copied onto $I_{D 4}$, additional errors accumulate. We must therefore avoid long current mirror chains.\n\nCurrent mirrors are widely used in analog circuits. Figure 5.8 shows a typical example, where a differential amplifier is biased using an NMOS mirror for the tail current source and a PMOS mirror for the load current sources. The device dimensions depicted set a drain current of $0.4 I_{T}$ in $M_{5}$ and $M_{6}$, reducing the drain current of $M_{3}$ and $M_{4}$ and thus increasing the amplifier's gain.\n\nSizing Issues Current mirrors typically use the same length for all transistors to minimize errors due to side diffusion of the source and drain areas ($L_{D}$). For instance, in Fig. 5.8, the NMOS current sources must have the same channel length as $M_{0}$. This is because if $L_{\\text {drawn }}$ is, say, doubled, then $L_{\\text {eff }}=L_{\\text {drawn }}-2 L_{D}$ is not. Furthermore, the threshold voltage of short-channel devices is somewhat dependent on the channel length (Chapter 17). Thus, current ratioing is achieved by scaling only the width of the transistors.\n\nSuppose we want to copy a reference current, $I_{R E F}$, and generate $2 I_{R E F}$. We start with a width of $W_{R E F}$ for the diode-connected reference transistor and thus choose $2 W_{R E F}$ for the current source [Fig. 5.9(a)]. Unfortunately, directly scaling the width also encounters difficulties. As depicted in Fig. 5.9(b), since the \"corners\" of the gate are poorly defined, if the drawn $W$ is doubled, the actual width does not exactly double. We therefore prefer to use a \"unit\" transistor and replicate it to generate copies [Fig. 5.9(c)].\n\nimage_name:(a)\ndescription:The circuit diagram (a) shows a current mirror configuration to multiply the reference current I_REF by 2 using two NMOS transistors. The transistor MREF is diode-connected with its gate and drain connected to the node X1. M2 is configured to provide a mirrored current of 2*I_REF to the load. The current source IREF provides the reference current to the circuit.\n\nimage_name:(b)\ndescription:The image labeled as (b) illustrates the impact of gate corners on current accuracy in a transistor. This diagram provides both a top view and a cross-sectional view labeled 'AA View'.\n\n1. **Identification of Components and Structure:**\n- The **top view** displays a rectangular structure with a width labeled 'W'. It features several square elements, potentially representing contact points or areas on the transistor gate.\n- The **AA view** is a cross-section that emphasizes the gate structure, showing how the corners of the gate are rounded or poorly defined.\n- Key components in the cross-section include the **gate**, **oxide layer**, and **channel**.\n\n2. **Connections"
},
{
    "text": "---[Attention]---\nFor all images referenced in the [Context Provided] section, the accompanying images have been transformed into textual descriptions. Please revise the content in the [Context Provided] section to preserve the original meaning and length.\n---[Task]---\nRephrase the text provided within the [Context Provided] section, ensuring that the rephrased version conveys the same message and retains the same length.\n---[Context Provided]---\nThe text provided:\n\nFigure 5.1 demonstrates two scenarios where a current source is particularly advantageous. In Chapter 2, we covered that the output resistance and capacitance, as well as the voltage headroom of a current source, are inversely proportional to the magnitude of the output current. Beyond these aspects, there are several other elements of current sources that are significant: the dependency on supply, process, and temperature; the output noise current; and the compatibility with other current sources. The detailed discussions on noise and compatibility are scheduled for Chapters 7 and 14, respectively.\nimage_name:(a)\ndescription:\n[\nname: M1, type: NMOS, ports: {S: GND, D: Vout, G: Vin}\nname: M2, type: PMOS, ports: {S: VDD, D: Vout, G: Vout}\nname: I1, type: CurrentSource, value: I1, ports: {Np: VDD, Nn: Vout}\n]\nextrainfo:The circuit diagram (a) displays a setup featuring NMOS M1 and PMOS M2 and M3 transistors, which together form a current source with its output at Vout. The current source I1 connects VDD to Vout. M3 is utilized for biasing, with its gate tied to Vb.\nimage_name:(b)\ndescription:The circuit diagram (b) illustrates a current mirror setup with NMOS and PMOS transistors. The NMOS transistor M1 is connected to the input voltage Vin, while the PMOS transistors M2 and M3 create a current mirror. The current source ISS connects node p to ground, offering biasing current for the PMOS transistors.\nFigure 5.1 showcases the applications of current sources.\n\nimage_name:Figure 5.2 presents the concept of current division by a resistive divider.\ndescription:\n[\nname: R1, type: Resistor, value: R1, ports: {N1: VDD, N2: g1}\nname: R2, type: Resistor, value: R2, ports: {N1: g1, N2: GND}\nname: M1, type: NMOS, ports: {S: GND, D: Iout, G: g1}\n]\nextrainfo:This circuit diagram presents a straightforward resistive biasing network for the NMOS transistor M1. The resistors R1 and R2 act as a voltage divider, establishing the gate voltage of M1. The NMOS transistor is set up to function as a current source, with Iout serving as the output current. The load is connected to the drain of M1.\n\nTo bias a MOSFET in such a way that it operates as a stable current source, one must understand the relevant considerations. To gain a comprehensive understanding of these complexities, let's examine the simple resistive biasing depicted in Fig. 5.2. Assuming M1 is in saturation, we can derive the following expression:\n\n$$\n\\begin{equation*}\nI_{\\text {out }} \\approx \\frac{1}{2} \\mu_{n} C_{o x} \\frac{W}{L}\\left(\\frac{R_{2}}{R_{1}+R_{2}} V_{D D}-V_{T H}\\right)^{2} \\tag{5.1}\n\\end{equation*}\n$$\n\nThis equation reveals various process, voltage, and temperature (PVT) dependencies of $I_{\\text {out }}$. The overdrive voltage depends on $V_{D D}$ and $V_{T H}$, and the threshold voltage can vary from 50 to 100 mV between wafers. Moreover, both $\\mu_{n}$ and $V_{T H}$ are temperature-dependent. Consequently, $I_{o u t}$ is not well-defined. The issue becomes more pronounced when the device is biased with a smaller overdrive voltage, such as to reduce headroom and support wider voltage swings at the drain. With a typical overdrive of, say, 200 mV, a 50-mV error in $V_{T H}$ can result in a 44% error in the output current.\n\nIt is crucial to recognize that process and temperature dependencies persist even if the gate voltage does not depend on the supply voltage. In other words, even if the gate-source voltage of a MOSFET is precisely defined, its drain current may not be! For this reason, alternative biasing methods for MOS current sources must be sought.\n\nThe design of current sources in analog circuits often involves \"mirroring\" currents from a reference source, assuming that a precisely defined current source is already present. Despite the appearance of an endless loop, this method is implemented as shown in Fig. 5.3. A complex circuit, sometimes requiring external adjustments, is used to generate a stable reference current, $I_{R E F}$, which is then mirrored to create multiple current sources within the system. We explore the mirroring operation here and the reference generator, based on \"bandgap\" techniques, in Chapter 12.\nimage_name:Figure 5.3 depicts the use of a reference source for generating various currents.\ndescription:\n[\nname: I_REF, type: CurrentSource, value: I_REF, ports: {Np: Reference Generator, Nn: X_I1}\nname: I_1, type: CurrentSource, value: I_1, ports: {Np: VDD, Nn: X_I1}\nname: I_2, type: CurrentSource, value: I_2, ports: {Np: X_I1, Nn: GND}\nname: V_DD, type: VoltageSource, value: V_DD, ports: {Np: VDD, Nn: GND}\n]\nextrainfo:This circuit employs a reference current (I_REF) generated by a reference generator to produce multiple current sources (I_1 and I_2). The current I_1 is connected between the power supply VDD and node X_I1, while I_2 is linked between node X_I1 and ground."
},
{
    "text": "Image Descriptions: Textual interpretations of any images referenced in the [Context Provided] section have been transformed. Furthermore, you are required to rewrite the [Context Provided] text, ensuring that the revised version maintains the same meaning and extends to the same length.\n---[Task]---\nPlease rephrase the text provided in the [Context Provided] Section. Make certain that the rephrased version preserves the original intent and length. Produce only the rephrased text."
},
{
    "text": "Figure 5.1 showcases instances where a current source is particularly beneficial. As previously discussed in Chapter 2, the output resistance, capacitance, and voltage range of a current source are interdependent with the magnitude of the output current. Moreover, various characteristics of current sources are pivotal: power supply, process, and temperature sensitivity; output noise current; and compatibility with other current sources. The discussion on noise and compatibility is postponed until Chapter 7 and 14, respectively.\n\n(image_name:(a))\ndescription:\n[\nname: M1, type: NMOS, ports: {S: GND, D: Vout, G: Vin}\nname: M2, type: PMOS, ports: {S: VDD, D: Vout, G: Vout}\nname: I1, type: CurrentSource, value: I1, ports: {Np: VDD, Nn: Vout}\n]\nextrainfo: Diagram (a) presents a circuit featuring NMOS M1 and PMOS M2 and M3 transistors, forming a current source with its output at Vout. The current source I1 is connected between VDD and Vout, while M3 serves as a bias with its gate connected to Vb.\n\n(image_name:(b))\ndescription: Diagram (b) reveals a current mirror circuit composed of NMOS and PMOS transistors. The NMOS transistor M1 is linked to the input voltage Vin, and the PMOS transistors M2 and M3 act as a current mirror. The current source ISS is linked between node p and ground, delivering bias current to the PMOS transistors.\n\nFigure 5.1 depicts the applications of current sources.\n\n(image_name:Figure 5.2 Definition of current by resistive divider.)\ndescription:\n[\nname: R1, type: Resistor, value: R1, ports: {N1: VDD, N2: g1}\nname: R2, type: Resistor, value: R2, ports: {N1: g1, N2: GND}\nname: M1, type: NMOS, ports: {S: GND, D: Iout, G: g1}\n]\nextrainfo: The circuit diagram illustrates a basic resistive bias network for an NMOS transistor M1. The resistors R1 and R2 form a voltage divider, setting the gate voltage of M1. M1 operates as a current source, with Iout being the output current. The load is connected to the drain of M1.\n\nTo ensure stable operation as a current source, how should a MOSFET be biased? For a clearer understanding, let's examine the simple resistive bias depicted in Fig. 5.2. Assuming M1 is in saturation, we can express the output current Iout using the following equation:\n\n$$\n\\begin{equation*}\nI_{\\text {out }} \\approx \\frac{1}{2} \\mu_{n} C_{o x} \\frac{W}{L}\\left(\\frac{R_{2}}{R_{1}+R_{2}} V_{D D}-V_{T H}\\right)^{2} \\tag{5.1}\n\\end{equation*}\n$$\n\nThis equation unveils the PVT dependencies of Iout. The overdrive voltage is a function of VDD and VTH, which may vary by 50 to 100 mV across different wafers. Additionally, both μn and VTH have temperature dependence. Consequently, Iout is poorly defined. The issue becomes more pronounced when the device is biased with a smaller overdrive voltage, such as to reduce headroom and support broader voltage swings at the drain. With an overdrive of 200 mV, a 50-mV error in VTH results in a 44% error in the output current.\n\nIt is crucial to note that process and temperature dependencies persist even if the gate voltage is not directly dependent on the supply voltage. That is, if the gate-source voltage of a MOSFET is precisely specified, its drain current is not. Therefore, alternative biasing methods for MOS current sources must be sought.\n\nThe design of current sources in analog circuits is fundamentally based on duplicating currents from a reference, assuming the presence of a precisely defined current source. Although this method may seem like an endless loop, it is executed as illustrated in Fig. 5.3. A complex circuit, sometimes requiring external adjustments, is used to produce a stable reference current, IREF, which is then copied to generate multiple current sources in the system. We delve into the copying process here and the reference generator, based on \"bandgap\" techniques, in Chapter 12.\n\n(image_name:Figure 5.3 Use of a reference to generate various currents.)\ndescription:\n[\nname: I_REF, type: CurrentSource, value: I_REF, ports: {Np: Reference Generator, Nn: X_I1}\nname: I_1, type: CurrentSource, value: I_1, ports: {Np: VDD, Nn: X_I1}\nname: I_2, type: CurrentSource, value: I_2, ports: {Np: X_I1, Nn: GND}\nname: V_DD, type: VoltageSource, value: V_DD, ports: {Np: VDD, Nn: GND}\n]\nextrainfo: This circuit employs a reference current (IREF) generated by a reference generator to create multiple current sources (I1 and I2). I1 is connected to the power supply VDD and node X_I1, while I2 is linked between node X_I1 and ground.\n\nHow can we replicate a reference current, for instance, ensuring Iout = IREF in Fig. 5.4? For a MOSFET, if ID = f(VGS), where f(·) denotes the dependence of ID on VGS, then VGS = f−1(ID). Hence, if a transistor is biased at IREF, it produces VGS = f−1(IREF) [Fig. 5.5(a)]. Consequently, if this voltage is applied to the gate and source terminals of a second MOSFET, the resulting current is Iout = f[f−1(IREF)] = IREF [Fig. 5.5(b)]. Alternatively, if two identical MOS devices have equal gate-source voltages and operate in saturation, they carry equal currents (if λ=0).\n\n(image_name:Figure 5.4)\ndescription: The circuit in Figure 5.4 is a conceptual depiction of a current copying mechanism, utilizing a current mirror configuration to replicate the reference current IREF at the output, Iout, across a load. The NMOS transistors M1 and M2 are arranged such that M1 is diode-connected, and M2 mirrors the current from M1 to the output.\n\n(image_name:Fig. 5.5(a))\ndescription:\n[\nname: M1, type: NMOS, ports: {S: GND, D: d1g1, G: d1g1}\nname: I_REF, type: CurrentSource, value: I_REF, ports: {Np: VDD, Nn: d1g1}\nname: V_DD, type: VoltageSource, value: V_DD, ports: {Np: VDD, Nn: GND}\n]\nextrainfo: The circuit in Fig. 5.5(a) is a diode-connected NMOS transistor configuration that establishes a reference voltage across M1. The current source IREF biases the NMOS M1, causing a voltage drop across its gate and drain, which are shorted together.\n\n(image_name:Fig. 5.5(b))\ndescription:\n[\nname: M1, type: NMOS, ports: {S: GND, D: d1g1g2, G: d1g1g2}\nname: M2, type: NMOS, ports: {S: GND, D: d2g1g2, G: d1g1g2}\nname: I_REF, type: CurrentSource, value: I_REF, ports: {Np: VDD, Nn: d1g1}\nname: V_DD, type: VoltageSource, value: V_DD, ports: {Np: VDD, Nn: GND}\n]\nextrainfo: The circuit in Fig. 5.5(b) is a fundamental current mirror composed of two NMOS transistors, M1 and M2. M1 is diode-connected, creating a reference current path with IREF. M2 mirrors the current from M1 to the output node d2, enabling the replication of IREF at the output.\n\nThe structure consisting of M1 and M2 in Fig. 5.5(b) is referred to as a \"current mirror.\" In the general case, the transistors do not need to be identical. Neglecting channel-length modulation, we can express:\n\n$$\n\\begin{align*}\nI_{R E F} & =\\frac{1}{2} \\mu_{n} C_{o x}\\left(\\frac{W}{L}\\right)_{1}\\left(V_{G S}-V_{T H}\\right)^{2}  \\tag{5.2}\\\\\nI_{o u t} & =\\frac{1}{2} \\mu_{n} C_{o x}\\left(\\frac{W}{L}\\right)_{2}\\left(V_{G S}-V_{T H}\\right)^{2} \\tag{5.3}\n\\end{align*}\n$$\n\nyielding:\n\n$$\n\\begin{equation*}\nI_{\\text {out }}=\\frac{(W / L)_{2}}{(W / L)_{1}} I_{R E F} \\tag{5.4}\n\\end{equation*}\n$$\n\nThe primary feature of this topology is its ability to precisely replicate the current without process and temperature dependence. The transformation from IREF to Iout simply involves the ratio of device dimensions, which can be accurately controlled.\n\nIt is crucial to understand the cause-and-effect relationships defined by VGS = f−1(IREF) and f[f−1(IREF)] = IREF. The former indicates that a VGS must be generated from IREF; in other words, IREF is the cause, and VGS is the effect. A MOSFET can fulfill this function only if it is configured as a diode and carries a current of IREF [Fig. 5.5(b)]. Similarly, the latter equation shows that a transistor must sense f−1(IREF) (equal to VGS) and generate f[f−1(IREF)] (equal to the output current, f[f−1(IREF)]). In this case, the cause is VGS, and the effect is the output current, f[f−1(IREF)] [as provided by M2 in Fig. 5.5(b)].\n\nUsing these insights, we can comprehend why a circuit like that in Fig. 5.6 is incapable of current copying. Here, Vb is not influenced by IREF, causing Iout not to follow IREF.\nimage_name:Figure 5.6 Circuit incapable of copying current.\ndescription:\n[\nname: IREF, type: CurrentSource, value: IREF, ports: {Np: VDD, Nn: d1}\nname: M1, type: NMOS, ports: {S: GND, D: d1, G: Vb}\nname: M2, type: NMOS, ports: {S: GND, D: Iout, G: Vb}\n]\nextrainfo: The circuit is designed to copy current but fails because Vb is not affected by IREF, leading to Iout not matching IREF. The circuit incorporates a load connected to the drain of M2.\n\n#### Example 5.1\n\nDetermine the drain current of M4 in Fig. 5.7 if all transistors are in saturation.\nimage_name:Figure 5.7\ndescription:\n[\nname: M1, type: NMOS, ports: {S: GND, D: d1g1g2, G: d1g1g2}\nname: M2, type: NMOS, ports: {S: GND, D: X, G: d1g1g2}\nname: M3, type: PMOS, ports: {S: VDD, D: X, G: X}\nname: M4, type: PMOS, ports: {S: VDD, D: Iout, G: X}\nname: I_REF, type: CurrentSource, ports: {Np: VDD, Nn: d1g1g2}\n]\nextrainfo: The circuit is designed to create a current mirror configuration using NMOS and PMOS transistors. M4's drain current can be calculated using the given relationships between the transistor dimensions. All transistors are assumed to be in saturation.\n\n#### Solution\n\nWe have ID2 = IREF[(W/L)2/(W/L)1]. Also, |ID3| = |ID2| and ID4 = ID3[(W/L)4/(W/L)3]. Therefore, |ID4| = αβIREF, where α=(W/L)2/(W/L)1 and β=(W/L)4/(W/L)3. Proper selection of α and β can establish large or small ratios between ID4 and IREF. For example, α=β=5 results in a magnification factor of 25. Similarly, α=β=0.2 can be used to generate a small, well-defined current.\n\nWe should also note that a copy of a copy may not be as \"clear\" as the original. Due to random \"mismatches\" between M1 and M2 in the above example, ID2 slightly deviates from its nominal value. Similarly, as ID2 is copied onto ID4, additional errors accumulate. We must therefore avoid long current mirror chains.\n\nCurrent mirrors are extensively used in analog circuits. Figure 5.8 demonstrates a typical scenario, where a differential pair is biased using an NMOS mirror for the tail current source and a PMOS mirror for the load current sources. The depicted device dimensions establish a drain current of 0.4IT in M5 and M6, reducing the drain current of M3 and M4 and, subsequently, increasing the amplifier's gain.\n\n(image_name:Figure 5.8 Current mirrors used to bias a differential amplifier.)\ndescription: The circuit is a differential amplifier biased by NMOS and PMOS current mirrors. The NMOS devices M0, M1, M2, M7, and M8 form the tail current source and differential pair. PMOS devices M3, M4, M5, M6, and M9 form the load current sources. The circuit is designed to enhance gain by diminishing the drain current in M3 and M4, which is achieved by specific device sizing.\n\nSizing Issues Current mirrors typically use the same length for all transistors to minimize errors due to the side diffusion of the source and drain areas (LD). For example, in Fig. 5.8, the NMOS current sources must have the same channel length as M0. This is because if LD is, say, doubled, then LEFF = LDRAWN - 2LD is not. Furthermore, the threshold voltage of short-channel devices has some dependence on the channel length (Chapter 17). Thus, current ratioing is achieved by scaling only the width of the transistors.\n\nAssuming we wish to duplicate a reference current, IREF, and produce 2IREF. We start with a width of WREF for the diode-connected reference transistor and hence select 2WREF for the current source [Fig. 5.9(a)]. Unfortunately, directly scaling the width also presents difficulties. As illustrated in Fig. 5.9(b), since the \"corners\" of the gate are poorly defined, if the drawn W is doubled, the actual width does not exactly double. Therefore, we prefer to use a \"unit\" transistor and create copies by replicating such a device [Fig. 5.9(c)].\n\n(image_name:(a))\ndescription: The circuit diagram (a) shows a current mirror configuration to multiply the reference current IREF by 2 using two NMOS transistors. The transistor MREF is diode-connected with its gate and drain connected to the node X1. M2 is configured to provide a mirrored current of 2*IREF to the load. The current source IREF provides the reference current to the circuit.\n\n(image_name:(b))\ndescription: The image labeled as (b) illustrates the effect of gate corners on current accuracy in a transistor. This diagram provides both a top view and a cross-sectional view labeled 'AA View'.\n\n1. **Identification of Components and Structure:**\n- The **top view** shows a rectangular structure with a width labeled 'W'. It features several square elements, likely representing contact points or regions on the transistor gate.\n- The **AA view** is a cross-section that highlights the gate structure, showing how the corners of the gate are rounded or poorly defined.\n- Key components in the cross-section include the **gate**, **oxide layer**, and **channel**.\n\n2. **Connections and Interactions:**\n- The cross-sectional view emphasizes the interaction between the gate, oxide, and channel. The rounded corners of the gate can lead to inaccuracies in current flow, as they affect the effective width 'W' of the channel.\n- The oxide layer serves as an insulating barrier between the gate and the channel, crucial for controlling the current flow.\n\n3. **Labels, Annotations, and Key Features:**\n- The width 'W' is a critical dimension in both views, illustrating the intended width of the gate.\n- The label 'Gate Corner' highlights the area where inaccuracies may arise due to the physical shape of the gate.\n- The terms 'Oxide' and 'Channel' in the cross-section indicate the layers involved in the transistor's operation, with the channel being the path for current flow.\n\nThis diagram is used to explain why simply scaling up the width of a transistor may not proportionally increase the current, due to the imprecise definition of the gate corners.\n\n(image_name:(c))\ndescription: The circuit diagram (c) shows a more accurate current multiplication technique using unit transistors to generate both 2IREF and IREF/2 from IREF. The transistors M3 and M4 are used to split the current, with each carrying IREF/2.\n\nFigure 5.9 (a) Current mirror multiplying IREF by 2, (b) effect of gate corner on current accuracy, and (c) more accurate current multiplication.\n\nHowever, how do we generate a current equal to IREF/2 from IREF? In this instance, the diode-connected device itself must be composed of two units, each carrying IREF/2. Figure 5.10(a) provides an example for the generation of both 2IREF and IREF/2; each unit has a width of W0 (and the same length).\n\n(image_name:Figure 5.10(a))\ndescription: The circuit diagram in Figure 5.10(a) illustrates a current mirror configuration that generates both 2*IREF and IREF/2 using NMOS transistors. The trans"
},
{
    "text": "---[Attention]---\nDescriptive Texts for Images: Images referenced in the [Context Provided] section have been transformed into textual descriptions. You are to reword the text to preserve its original intent and length.\n---[Task]---\nRephrase the text provided in the [Context Provided] Section. Make sure the revised version retains the original meaning and length. Present only the rewritten text below.\n---[Context Provided]---\nThe original text:\n```\nFigure 5.1 depicts two scenarios where a current source is advantageous. As we learned in Chapter 2, the output resistance and capacitance, along with the voltage headroom, of a current source are interchanged with the magnitude of the output current. Furthermore, there are various other aspects of current sources that are significant: power supply, processing, and temperature sensitivity; output noise current; and matching with other current sources. We reserve discussions on noise and matching to Chapters 7 and 14, respectively.\nimage_name:(a)\ndescription:\n[\nname: M1, type: NMOS, ports: {S: GND, D: Vout, G: Vin}\nname: M2, type: PMOS, ports: {S: VDD, D: Vout, G: Vout}\nname: I1, type: CurrentSource, value: I1, ports: {Np: VDD, Nn: Vout}\n]\nextrainfo:A circuit setup as shown in Figure (a) includes NMOS M1 and PMOS M2 and M3 transistors, which together form a current source with Vout as its output. The current source I1 is connected between VDD and Vout. M3 is utilized for biasing purposes, with its gate connected to Vb.\nimage_name:(b)\ndescription:\nThe circuit diagram in Figure (b) showcases a current mirror arrangement using NMOS and PMOS transistors. The NMOS transistor M1 is linked to the input voltage Vin, while PMOS transistors M2 and M3 create a current mirror. The current source ISS is connected between node p and ground, delivering biasing current to the PMOS transistors.\nFigure 5.1 Applications of current sources.\n\nimage_name:Figure 5.2 Definition of current through a resistive divider.\ndescription:\n[\nname: R1, type: Resistor, value: R1, ports: {N1: VDD, N2: g1}\nname: R2, type: Resistor, value: R2, ports: {N1: g1, N2: GND}\nname: M1, type: NMOS, ports: {S: GND, D: Iout, G: g1}\n]\nextrainfo:This circuit diagram features a straightforward resistive biasing network for an NMOS transistor M1. The resistors R1 and R2 act as a voltage divider, setting the gate voltage of M1. The NMOS transistor is configured to function as a current source with Iout as the output current. The load is connected to the drain of M1.\n\nTo achieve stable operation as a current source, how should a MOSFET be biased? For a clearer understanding of the challenges, let's examine the simple resistive biasing presented in Fig. 5.2. Assuming M1 is in saturation, we can express\n\n$$\n\\begin{equation*}\nI_{\\text {out }} \\approx \\frac{1}{2} \\mu_{n} C_{o x} \\frac{W}{L}\\left(\\frac{R_{2}}{R_{1}+R_{2}} V_{D D}-V_{T H}\\right)^{2} \\tag{5.1}\n\\end{equation*}\n$$\n\nThis equation illustrates the various process, voltage, and temperature (PVT) dependencies of $I_{\\text {out }}$. The overdrive voltage is dependent on $V_{D D}$ and $V_{T H}$; the threshold voltage can vary by 50 to 100 mV across different wafers. Moreover, both $\\mu_{n}$ and $V_{T H}$ are temperature-dependent. Consequently, $I_{o u t}$ is poorly defined. The issue is exacerbated when the device is biased with a smaller overdrive voltage, such as to reduce headroom and enable wider voltage swings at the drain. For a typical overdrive of around 200 mV, a 50-mV error in $V_{T H}$ results in a 44% error in the output current.\n\nIt is crucial to note that process and temperature variations are present even when the gate voltage is independent of the supply voltage. In other words, if the gate-source voltage of a MOSFET is precisely defined, its drain current may not be! Therefore, we must explore alternative biasing methods for MOS current sources.\n\nThe design of current sources in analog circuits is rooted in \"copping\" currents from a reference, assuming a precisely defined current source is already present. Although this method seems to create an endless loop, it is implemented as shown in Fig. 5.3. A complex circuit, sometimes requiring external adjustments, is used to generate a stable reference current, $I_{R E F}$, which is then \"copped\" to create multiple current sources within the system. We delve into the copying process in this section and the reference generator (based on \"bandgap\" techniques) in Chapter 12.\nimage_name:Figure 5.3 Use of a reference to generate various currents.\ndescription:\n[\nname: I_REF, type: CurrentSource, value: I_REF, ports: {Np: Reference Generator, Nn: X_I1}\nname: I_1, type: CurrentSource, value: I_1, ports: {Np: VDD, Nn: X_I1}\nname: I_2, type: CurrentSource, value: I_2, ports: {Np: X_I1, Nn: GND}\nname: V_DD, type: VoltageSource, value: V_DD, ports: {Np: VDD, Nn: GND}\n]\nextrainfo:The circuit incorporates a reference current (I_REF) generated by a reference generator to produce multiple current sources (I_1 and I_2). The current I_1 is connected to the power supply VDD and node X_I1, while I_2 is connected between node X_I1 and ground.\n...\n```"
},
{
    "text": "---[Attention]---\nDescriptive Texts: Images referenced within the [Context Provided] have been converted into textual descriptions. Additionally, you are to rephrase the text within the [Context Provided] Section, ensuring the rephrased version retains the original meaning and length.\n---[Task]---\nRevise the given text in the [Context Provided] Section. The revised text must preserve the original meaning and maintain the same length.\n---[Context Provided]---\nThe original text:\n```\nFigure 5.1 presents two instances where a current source is particularly beneficial. Refer back to Chapter 2 for a recollection that the output resistance and capacitance, as well as the voltage headroom, of a current source are exchanged for the magnitude of the output current. Beyond these aspects, a variety of other features of current sources are crucial: their supply, process, and temperature sensitivity; output noise current; and their compatibility with other current sources. Noise and matching issues will be addressed in Chapters 7 and 14, respectively.\nimage_name:(a)\ndescription:\n[\nname: M1, type: NMOS, ports: {S: GND, D: Vout, G: Vin}\nname: M2, type: PMOS, ports: {S: VDD, D: Vout, G: Vout}\nname: I1, type: CurrentSource, value: I1, ports: {Np: VDD, Nn: Vout}\n]\nextrainfo:The circuit diagram (a) depicts a setup incorporating NMOS M1 and PMOS M2 and M3 transistors to create a current source at the Vout node. The current source I1 is interconnected between VDD and Vout. M3 serves as a bias element, with its gate connected to Vb.\nimage_name:(b)\ndescription:The circuit diagram (b) exhibits a current mirror arrangement using NMOS and PMOS transistors. The NMOS transistor M1 is connected to the input voltage Vin, while the PMOS transistors M2 and M3 are configured to act as a current mirror. The current source ISS is connected between node p and ground, delivering bias current to the PMOS transistors.\nFigure 5.1 Applications of current sources.\n\nimage_name:Figure 5.2 Definition of current by resistive divider.\ndescription:\n[\nname: R1, type: Resistor, value: R1, ports: {N1: VDD, N2: g1}\nname: R2, type: Resistor, value: R2, ports: {N1: g1, N2: GND}\nname: M1, type: NMOS, ports: {S: GND, D: Iout, G: g1}\n]\nextrainfo:The circuit diagram illustrates a basic resistive biasing network for an NMOS transistor M1. The resistors R1 and R2 form a voltage divider, setting the gate voltage of M1. The NMOS transistor is configured to operate as a current source with Iout as the output current. The load is connected to the drain of M1.\n\nHow should a MOSFET be biased to function as a stable current source? To better understand the complexities, let's examine the straightforward resistive biasing depicted in Fig. 5.2. Assuming $M_{1}$ is in saturation, we can derive the following equation:\n\n$$\n\\begin{equation*}\nI_{\\text {out }} \\approx \\frac{1}{2} \\mu_{n} C_{o x} \\frac{W}{L}\\left(\\frac{R_{2}}{R_{1}+R_{2}} V_{D D}-V_{T H}\\right)^{2} \\tag{5.1}\n\\end{equation*}\n$$\n\nThis equation uncovers several process, voltage, and temperature dependencies of $I_{\\text {out }}$. The overdrive voltage depends on $V_{D D}$ and $V_{T H}$; the threshold voltage may vary from wafer to wafer by 50 to 100 mV. Moreover, both $\\mu_{n}$ and $V_{T H}$ are temperature-dependent. Consequently, $I_{o u t}$ is not well-defined. The problem intensifies when the device is biased with a smaller overdrive voltage, such as to save headroom and support broader voltage swings at the drain. For instance, with a standard overdrive of around 200 mV, a $50-\\mathrm{mV}$ error in $V_{T H}$ would result in a $44 \\%$ error in the output current.\n\nIt's worth noting that process and temperature dependencies persist even when the gate voltage does not depend on the supply voltage. That is, if the gate-source voltage of a MOSFET is accurately set, its drain current might not be! Due to this, alternative biasing methods for MOS current sources are sought.\n\nThe design of current sources in analog circuits often involves \"copying\" currents from a reference, assuming a precisely defined current source is already available. Despite the potential for an infinite loop, this method is implemented as shown in Fig. 5.3. A relatively complex circuit, sometimes requiring external adjustments, generates a stable reference current, $I_{R E F}$, which is then \"cloned\" to create numerous current sources in the system. The copying process is discussed here, and the reference generator (based on \"bandgap\" techniques) is studied in Chapter 12.\nimage_name:Figure 5.3 Use of a reference to generate various currents.\ndescription:\n[\nname: I_REF, type: CurrentSource, value: I_REF, ports: {Np: Reference Generator, Nn: X_I1}\nname: I_1, type: CurrentSource, value: I_1, ports: {Np: VDD, Nn: X_I1}\nname: I_2, type: CurrentSource, value: I_2, ports: {Np: X_I1, Nn: GND}\nname: V_DD, type: VoltageSource, value: V_DD, ports: {Np: VDD, Nn: GND}\n]\nextrainfo:The circuit employs a reference current (I_REF) produced by a reference generator to produce multiple current sources (I_1 and I_2). The current I_1 is linked to the power supply VDD and node X_I1, while I_2 is connected between node X_I1 and ground.\n\nHow do we create duplicates of a reference current? For example, in Fig. 5.4, how can we ensure that $I_{\\text {out }}=I_{R E F}$ ? For a MOSFET, if $I_{D}=f\\left(V_{G S}\\right)$, where $f(\\cdot)$ denotes the dependence of $I_{D}$ upon $V_{G S}$, then $V_{G S}=f^{-1}\\left(I_{D}\\right)$. That is, if a transistor is biased at $I_{R E F}$, then it produces $V_{G S}=f^{-1}\\left(I_{R E F}\\right)[$ Fig. 5.5(a)]. Thus, if this voltage is applied to the gate and source terminals of a second MOSFET, the resulting current is $I_{\\text {out }}=f\\left[f^{-1}\\left(I_{R E F}\\right)\\right]=I_{R E F}[$ Fig. $5.5(\\mathrm{~b})]$. From another perspective, two identical MOS devices that share equal gate-source voltages and operate in saturation transport equal currents (assuming $\\lambda=0$ ).\nimage_name:Figure 5.4\ndescription:The circuit in Figure 5.4 represents a conceptual model of a current duplication mechanism. It uses a current mirror configuration to replicate the reference current I_REF at the output, I_out, across a load. The NMOS transistors M1 and M2 are configured so that M1 is diode-connected, and M2 mirrors the current from M1 to the output.\nimage_name:Fig. 5.5(a)\ndescription:\n[\nname: M1, type: NMOS, ports: {S: GND, D: d1g1, G: d1g1}\nname: I_REF, type: CurrentSource, value: I_REF, ports: {Np: VDD, Nn: d1g1}\nname: V_DD, type: VoltageSource, value: V_DD, ports: {Np: VDD, Nn: GND}\n]\nextrainfo:The circuit in Fig. 5.5(a) consists of a diode-connected NMOS transistor configuration used to establish a reference voltage across M1. The current source I_REF biases the NMOS M1, generating a voltage drop across its gate and drain, which are shorted together.\nimage_name:Fig. 5.5(b)\ndescription:\n[\nname: M1, type: NMOS, ports: {S: GND, D: d1g1g2, G: d1g1g2}\nname: M2, type: NMOS, ports: {S: GND, D: d2g1g2, G: d1g1g2}\nname: I_REF, type: CurrentSource, value: I_REF, ports: {Np: VDD, Nn: d1g1}\nname: V_DD, type: VoltageSource, value: V_DD, ports: {Np: VDD, Nn: GND}\n]\nextrainfo:The circuit in Fig. 5.5(b) features a basic current mirror comprising two NMOS transistors, M1 and M2. M1 is diode-connected, meaning its gate and drain are interconnected, forming a reference current path with I_REF. M2 mirrors the current from M1 to the output node d2. This arrangement is utilized to replicate the reference current I_REF at the output.\n\nThe configuration of $M_{1}$ and $M_{2}$ in Fig. 5.5(b) is referred to as a \"current mirror.\" In general, the transistors do not necessarily need to be identical. Ignoring channel-length modulation, we can express\n\n$$\n\\begin{align*}\nI_{R E F} & =\\frac{1}{2} \\mu_{n} C_{o x}\\left(\\frac{W}{L}\\right)_{1}\\left(V_{G S}-V_{T H}\\right)^{2}  \\tag{5.2}\\\\\nI_{o u t} & =\\frac{1}{2} \\mu_{n} C_{o x}\\left(\\frac{W}{L}\\right)_{2}\\left(V_{G S}-V_{T H}\\right)^{2} \\tag{5.3}\n\\end{align*}\n$$\n\nyielding\n\n$$\n\\begin{equation*}\nI_{\\text {out }}=\\frac{(W / L)_{2}}{(W / L)_{1}} I_{R E F} \\tag{5.4}\n\\end{equation*}\n$$\n\nThe primary characteristic of this topology is its ability to accurately copy the current without reliance on process and temperature variations. The conversion from $I_{R E F}$ to $I_{\\text {out }}$ simply requires the ratio of device dimensions, a quantity that can be accurately controlled.\n\nIt is crucial to comprehend the cause-and-effect relationships implied by $V_{G S}=f^{-1}\\left(I_{R E F}\\right)$ and $f\\left[f^{-1}\\left(I_{R E F}\\right)\\right]=I_{R E F}$. The former indicates that a $V_{G S}$ must be produced from $I_{R E F}$; in other words, $I_{R E F}$ is the cause, and $V_{G S}$ is the effect. A MOSFET can perform this function only if it is set up as a diode while carrying a current of $I_{R E F}$ [as seen in $M_{1}$ in Fig. 5.5(b)]. Similarly, the latter equation suggests that a transistor must sense $f^{-1}\\left(I_{R E F}\\right)\\left(=V_{G S}\\right)$ and generate $f\\left[f^{-1}\\left(I_{R E F}\\right)\\right]$. In this instance, the cause is $V_{G S}$, and the effect is the output current, $f\\left[f^{-1}\\left(I_{R E F}\\right)\\right]$ [as provided by $M_{2}$ in Fig. 5.5(b)].\n\nWith these insights, we can understand why a circuit like the one shown in Fig. 5.6 is not capable of duplicating current. Here, $V_{b}$ is not influenced by $I_{R E F}$, and as a result, $I_{\\text {out }}$ does not match $I_{R E F}$.\nimage_name:Figure 5.6 Circuit incapable of copying current.\ndescription:\n[\nname: IREF, type: CurrentSource, value: IREF, ports: {Np: VDD, Nn: d1}\nname: M1, type: NMOS, ports: {S: GND, D: d1, G: Vb}\nname: M2, type: NMOS, ports: {S: GND, D: Iout, G: Vb}\n]\nextrainfo:The circuit is designed to copy current but fails because Vb is not affected by IREF, leading to Iout not following IREF. The circuit includes a load connected to the drain of M2.\n\n#### Example 5.1\n\nDetermine the drain current of $M_{4}$ in Fig. 5.7, assuming all transistors are in saturation.\nimage_name:Figure 5.7\ndescription:\n[\nname: M1, type: NMOS, ports: {S: GND, D: d1g1g2, G: d1g1g2}\nname: M2, type: NMOS, ports: {S: GND, D: X, G: d1g1g2}\nname: M3, type: PMOS, ports: {S: VDD, D: X, G: X}\nname: M4, type: PMOS, ports: {S: VDD, D: Iout, G: X}\nname: I_REF, type: CurrentSource, ports: {Np: VDD, Nn: d1g1g2}\n]\nextrainfo:The circuit is designed to establish a current mirror configuration using NMOS and PMOS transistors. The drain current of M4 can be calculated using the given relationships between the transistor dimensions, with the assumption that all transistors are in saturation.\n\n#### Solution\nWe have $I_{D 2}=I_{R E F}\\left[(W / L)_{2} /(W / L)_{1}\\right]$. Additionally, $\\left|I_{D 3}\\right|=\\left|I_{D 2}\\right|$ and $I_{D 4}=I_{D 3} \\times\\left[(W / L)_{4} /(W / L)_{3}\\right]$. Thus, $\\left|I_{D 4}\\right|=$ $\\alpha \\beta I_{R E F}$, where $\\alpha=(W / L)_{2} /(W / L)_{1}$ and $\\beta=(W / L)_{4} /(W / L)_{3}$. The appropriate selection of $\\alpha$ and $\\beta$ can establish large or small ratios between $I_{D 4}$ and $I_{R E F}$. For instance, $\\alpha=\\beta=5$ produces a magnification factor of 25. Similarly, $\\alpha=\\beta=0.2$ can be used to create a small, well-defined current.\n\nWe should also note that the copy of a copy may not be as \"clear\" as the original. Due to random \"mismatches\" between $M_{1}$ and $M_{2}$ in the example above, $I_{D 2}$ slightly deviates from its intended value. Similarly, as $I_{D 2}$ is copied onto $I_{D 4}$, additional errors accumulate. It is, therefore, necessary to avoid lengthy current mirror chains.\n\nCurrent mirrors have widespread applications in analog circuits. Figure 5.8 illustrates a typical example, showing a differential pair biased by an NMOS mirror for the tail current source and a PMOS mirror for the load current sources. The device dimensions depicted establish a drain current of $0.4 I_{T}$ in $M_{5}$ and $M_{6}$, reducing the drain current of $M_{3}$ and $M_{4}$ and thereby increasing the amplifier's gain.\n\nSizing Issues Current mirrors typically employ the same length for all transistors to minimize errors due to the side diffusion of the source and drain areas $\\left(L_{D}\\right)$. For instance, in Fig. 5.8, the NMOS current sources must have the same channel length as $M_{0}$. This is because if $L_{\\text {drawn }}$ is, say, doubled, then $L_{\\text {eff }}=L_{\\text {drawn }}-2 L_{D}$ is not. Furthermore, the threshold voltage of short-channel devices may show some dependence on the channel length (refer to Chapter 17). Hence, current ratioing is achieved by scaling only the width of the transistors.\n\nIf we wish to duplicate a reference current, $I_{R E F}$, and generate $2 I_{R E F}$, we start with a width of $W_{R E F}$ for the diode-connected reference transistor and therefore choose $2 W_{R E F}$ for the current source [Fig. 5.9(a)]. Unfortunately, direct scaling of the width also poses challenges. As shown in Fig. 5.9(b), since the \"corners\" of the gate are not well-defined, if the drawn $W$ is doubled, the actual width does not exactly double. Therefore, we prefer to use a \"unit\" transistor and generate copies by replicating such a device [Fig. 5.9(c)].\nimage_name:(a)\ndescription:The circuit diagram (a) demonstrates a current mirror configuration to double the reference current I_REF using two NMOS transistors. The transistor MREF is diode-connected with its gate and drain connected to the node X1. M2 is configured to provide a mirrored current of 2*I_REF to the load. The current source IREF supplies the reference current to the circuit.\nimage_name:(b)\ndescription:The image labeled as (b) shows the impact of gate corners on current accuracy within a transistor. The diagram includes both a top view and a cross-sectional view labeled 'AA View'.\n\n1. **Identification of Components and Structure:**\n- The **top view** displays a rectangular structure with a width marked 'W'. It features several square elements, possibly representing contact points or regions on the transistor gate.\n- The **AA view**"
},
{
    "text": "[Attention]\nDescriptive Texts for Images: Textual interpretations of any images referenced in the [Context Provided] area have been transformed. You are to reword the text below, preserving its original meaning and length.\n[Rephrased Text]\nPlease reword the content within the [Context Provided] section, ensuring the revised version retains the identical meaning and length. Your response should consist solely of the rewritten text."
},
{
    "text": "In our exploration of current mirrors, we have so far omitted the consideration of channel-length modulation. This effect can lead to considerable errors when copying currents, particularly when minimum-length transistors are employed to minimize the width of the current source, thereby reducing its output capacitance. Concerning the simple mirror depicted in Figure 5.5(b), we can express the equations as follows:\n\n$$\n\\begin{align*}\nI_{D 1} & =\\frac{1}{2} \\mu_{n} C_{o x}\\left(\\frac{W}{L}\\right)_{1}\\left(V_{G S}-V_{T H}\\right)^{2}\\left(1+\\lambda V_{D S 1}\\right)  \\tag{5.5}\\\\\nI_{D 2} & =\\frac{1}{2} \\mu_{n} C_{o x}\\left(\\frac{W}{L}\\right)_{2}\\left(V_{G S}-V_{T H}\\right)^{2}\\left(1+\\lambda V_{D S 2}\\right) \\tag{5.6}\n\\end{align*}\n$$\n\nConsequently,\n\n$$\n\\begin{equation*}\n\\frac{I_{D 2}}{I_{D 1}}=\\frac{(W / L)_{2}}{(W / L)_{1}} \\cdot \\frac{1+\\lambda V_{D S 2}}{1+\\lambda V_{D S 1}} \\tag{5.7}\n\\end{equation*}\n$$\n\nGiven that $V_{D S 1}=V_{G S 1}=V_{G S 2}, V_{D S 2}$ may not be equivalent to $V_{G S 2}$ due to the circuit connected to $M_{2}$. For instance, in Figure 5.8, the voltage at node $P$ is influenced by the input common-mode level and the gate-source voltages of $M_{1}$ and $M_{2}$, which might not be equal to $V_{X}$.\n\nTo mitigate the impact of channel-length modulation in Figure 5.5(b), we can (1) enforce $V_{D S 2}$ to match $V_{D S 1}$, or (2) enforce $V_{D S 1}$ to match $V_{D S 2}$. These two strategies result in distinct circuit topologies.\n\nInitial Method: We start with the first strategy and aim to ensure that $V_{D S 2}$ in Figure 5.5(b) remains constant and equals $V_{D S 1}$. From Chapter 3, we remember that a cascode device can shield a current source, decreasing the voltage fluctuations across it. As illustrated in Figure 5.12(a), although the analog circuit may permit $V_{P}$ to fluctuate significantly, $V_{Y}$ remains relatively stable. To guarantee that $V_{D S 2}=V_{D S 1}$, we must produce $V_{b}$ such that $V_{b}-V_{G S 3}=V_{D S 1}\\left(=V_{G S 1}\\right)$, i.e., $V_{b}=V_{G S 3}+V_{G S 1}$. Essentially, $V_{b}$ can be established through two diode-connected devices in series [Figure 5.12(b)], assuming $V_{G S 0}+V_{G S 1}=V_{G S 3}+V_{G S 1}$, and thus $V_{G S 0}=V_{G S 3}$. We then connect the $V_{b}$ generator of Figure 5.12(b) to the cascode current source as depicted in Figure 5.12(c). The outcome is precise current duplication, even in the presence of body effect.\n\nFigure 5.12 (a) Cascode current source, (b) modification of mirror circuit to generate the cascode bias voltage, and (c) cascode current mirror.\n\nIt is pertinent to mention a few points about the sizing of the transistors in Figure 5.12(c). As previously explained, we usually choose $L_{2}=L_{1}$ and adjust $W_{2}$ (in whole numbers) relative to $W_{1}$ to achieve the intended multiple of $I_{R E F}$. Similarly, for $V_{G S 3}$ to be equivalent to $V_{G S 0}$, we opt for $L_{3}=L_{0}$ and scale $W_{3}$ relative to $W_{0}$ by the same ratio, i.e., $W_{3} / W_{0}=W_{2} / W_{1}$. Practically, $L_{3}$ and $L_{0}$ are set to the minimum permissible value to minimize their width, whereas $L_{1}$ and $L_{2}$ might be extended in some instances. ${ }^{1}$\n\n#### Example 5.3\n\nIn Figure 5.13, graph $V_{X}$ and $V_{Y}$ as they depend on $I_{R E F}$. If $I_{R E F}$ necessitates 0.5 V to function as a current source, determine its upper limit.\n\n#### Solution\n\nAs $M_{2}$ and $M_{3}$ are proportionally matched to $M_{1}$ and $M_{0}$, we have $V_{Y}=V_{X} \\approx \\sqrt{2 I_{R E F} /\\left[\\mu_{n} C_{o x}(W / L)_{1}\\right]}+$ $V_{T H 1}$. The behavior is depicted in Figure 5.13(b).\n\nTo ascertain the maximum value of $I_{R E F}$, we observe that\n\n$$\n\\begin{align*}\nV_{N} & =V_{G S 0}+V_{G S 1}  \\tag{5.8}\\\\\n& =\\sqrt{\\frac{2 I_{R E F}}{\\mu_{n} C_{o x}}}\\left[\\sqrt{\\left(\\frac{L}{W}\\right)_{0}}+\\sqrt{\\left(\\frac{L}{W}\\right)_{1}}\\right]+V_{T H 0}+V_{T H 1} \\tag{5.9}\n\\end{align*}\n$$\n\nand hence\n\n$$\n\\begin{equation*}\nV_{D D}-\\sqrt{\\frac{2 I_{R E F}}{\\mu_{n} C_{o x}}}\\left[\\sqrt{\\left(\\frac{L}{W}\\right)_{0}}+\\sqrt{\\left.\\left(\\frac{L}{W}\\right)_{1}\\right)^{2}}\\right]-V_{T H 0}-V_{T H 1}=0.5 \\mathrm{~V} \\tag{5.10}\n\\end{equation*}\n$$\n\ntherefore\n\n$$\n\\begin{equation*}\nI_{R E F, \\max }=\\frac{\\mu_{n} C_{o x}}{2} \\frac{\\left(V_{D D}-0.5 \\mathrm{~V}-V_{T H 0}-V_{T H 1}\\right)^{2}}{\\left(\\sqrt{(L / W)_{0}}+\\sqrt{\\left.(L / W)_{1}\\right)^{2}}\\right.} \\tag{5.11}\n\\end{equation*}\n$$\n\nOperating as a current source with a high output impedance and precise value, the topology of Figure 5.12(c) still utilizes considerable voltage headroom. For simplicity, let us overlook the body effect and assume that all transistors are indistinguishable. Consequently, the minimum permissible voltage at node $P$ is equivalent to\n\n$$\n\\begin{align*}\nV_{N}-V_{T H} & =V_{G S 0}+V_{G S 1}-V_{T H}  \\tag{5.12}\\\\\n& =\\left(V_{G S 0}-V_{T H}\\right)+\\left(V_{G S 1}-V_{T H}\\right)+V_{T H} \\tag{5.13}\n\\end{align*}\n$$\n\ni.e., two overdrive voltages plus one threshold voltage. How does this value correlate with that in Figure 5.12(a) if $V_{b}$ were selected more arbitrarily? As demonstrated in Figure 5.14(a), $V_{b}$ could be so low\nimage_name:Figure 5.14 (a)\ndescription:The circuit in Figure 5.14 (a) is a cascode current source configuration. It illustrates how the minimum permissible voltage at node P can be reduced by adjusting the bias voltage Vb. The circuit employs NMOS transistors M1, M2, and M3 to achieve this configuration, with a reference current I_REF flowing from VDD to ground via these transistors. The diagram illustrates the concept of headroom voltage in a cascode configuration.\nimage_name:Figure 5.14 (b)\ndescription:The circuit in Figure 5.14(b) is a cascode current mirror with minimum headroom voltage. It ensures Iout = IREF by maintaining VDS2 = VGS1. The configuration uses four NMOS transistors and a reference current source.\n\nFigure 5.14 (a) Cascode current source with minimum headroom voltage; (b) headroom consumed by a cascode mirror.\n$\\left(=V_{G S 3}+V_{G S 2}-V_{T H 2}\\right)$ that the minimum permissible voltage at $P$ is merely two overdrive voltages. Therefore, the cascode mirror of Figure 5.12(c) \"loses\" one threshold voltage in headroom. This is due to $V_{D S 2}=V_{G S 2}$, whereas $V_{D S 2}$ could be as low as $V_{G S 2}-V_{T H}$ while keeping $M_{2}$ in saturation.\n\nFigure 5.14 encapsulates our discussion. In Figure 5.14(a), $V_{b}$ is chosen to permit the lowest feasible value of $V_{P}$, but the output current does not precisely track $I_{R E F}$ because $M_{1}$ and $M_{2}$ maintain unequal drain-source voltages. In Figure 5.14(b), higher accuracy is achieved, but the minimum level at $P$ is elevated by one threshold voltage.\n\nBefore addressing this issue, it is beneficial to analyze the large-signal behavior of a cascode current source.\n\n#### Example 5.4\n\nIn Figure 5.15(a), assume that all transistors are identical and sketch $I_{X}$ and $V_{B}$ as $V_{X}$ diminishes from a high positive value.\nimage_name:Figure 5.15(a)\ndescription:\n[\nname: M0, type: NMOS, ports: {S: A, D: N, G: N}\nname: M1, type: NMOS, ports: {S: GND, D: A, G: A}\nname: M2, type: NMOS, ports: {S: GND, D: B, G: A}\nname: M3, type: NMOS, ports: {S: B, D: VX, G: N}\nname: I_REF, type: CurrentSource, ports: {Np: VDD, Nn: N}\n]\nextrainfo:The circuit is a cascode current source with NMOS transistors M0, M1, M2, and M3. The current source I_REF feeds into node N, and the output current IX is extracted from the drain of M3. VDD is the power supply voltage, and the ground is the common reference node.\nimage_name:Figure 5.15(b)\ndescription:The graph labeled (b) is a plot of \\( V_B \\) versus \\( V_X \\). It is a voltage transfer characteristic graph that illustrates how the voltage \\( V_B \\) at point B changes as \\( V_X \\) decreases from a high positive value.\n\n1. **Type of Graph and Function:**\n- The graph is a voltage transfer characteristic plot.\n\n2. **Axes Labels and Units:**\n- The horizontal axis represents \\( V_X \\), which is the voltage at node X.\n- The vertical axis represents \\( V_B \\), the voltage at point B.\n- The graph does not specify units, but typically these would be in volts.\n\n3. **Overall Behavior and Trends:**\n- As \\( V_X \\) decreases, \\( V_B \\) initially increases linearly.\n- The graph shows a saturation point where \\( V_B \\) levels off and remains constant.\n\n4. **Key Features and Technical Details:**\n- The graph starts from the origin (or a value near zero) and increases linearly until it reaches a threshold.\n- The threshold point is marked at \\( V_N - V_{TH3} \\), where \\( V_B \\) becomes constant.\n- The saturation level of \\( V_B \\) is \\( V_N - V_{GS3} \\).\n\n5. **Annotations and Specific Data Points:**\n- There is a dashed line indicating the point \\( V_N - V_{TH3} \\) on the \\( V_X \\) axis, showing where \\( V_B \\) stops increasing and becomes constant.\n- Another horizontal dashed line shows the constant value \\( V_N - V_{GS3} \\) on the \\( V_B \\) axis, indicating the saturation level.\nimage_name:Figure 5.15(c)\ndescription:The graph labeled \"(c)\" illustrates the behavior of the current $I_X$ as a function of the voltage $V_X$. This is a plot relevant to the analysis of a cascode current source.\n\n1. **Type of Graph and Function:**\n- The graph is a plot of current versus voltage, specifically showing $I_X$ on the y-axis and $V_X$ on the x-axis.\n\n2. **Axes Labels and Units:**\n- **Y-axis:** Labeled as $I_X$, representing the current. The scale is linear and includes a reference line at $I_{REF}$, which is the reference current.\n- **X-axis:** Labeled as $V_X$, representing the voltage. The scale is linear, and there are significant markers at specific voltage levels, such as $V_N - V_{TH3}$ and $V_A - V_{TH2} + V_{DS3}$.\n\n3. **Overall Behavior and Trends:**\n- The graph shows that as $V_X$ increases from zero, the current $I_X$ initially rises sharply. After reaching a certain voltage threshold, the current levels off and remains constant at $I_{REF}$, indicating that the transistors are in saturation.\n\n4. **Key Features and Technical Details:**\n- **Initial Rise:** The current rises sharply from zero as $V_X$ increases until it reaches the reference current $I_{REF}$.\n- **Saturation Region:** Beyond the voltage $V_N - V_{TH3}$, the current $I_X$ remains constant at $I_{REF}$, indicating saturation.\n- **Thresholds:** The graph marks two critical voltage points: $V_N - V_{TH3}$, which is the point where $I_X$ reaches $I_{REF}$, and $V_A - V_{TH2} + V_{DS3}$, indicating a boundary condition related to the transistor operation.\n\n5. **Annotations and Specific Data Points:**\n- The graph includes a dashed line at the level of $I_{REF}$ to indicate the saturation current level.\n- Vertical dashed lines at $V_N - V_{TH3}$ and $V_A - V_{TH2} + V_{DS3}$ mark significant voltage thresholds related to the operation of the transistors in the circuit.\n\n#### Solution\n\nFor $V_{X} \\geq V_{N}-V_{T H}$, both $M_{2}$ and $M_{3}$ are in saturation, $I_{X}=I_{R E F}$, and $V_{B}=V_{A}$. As $V_{X}$ diminishes, which transistor enters the triode region first, $M_{3}$ or $M_{2}$? Suppose $M_{2}$ enters the triode region before $M_{3}$ does. For this to happen, $V_{D S 2}$ must drop and, since $V_{G S 2}$ is constant, so must $I_{D 2}$. This implies that $V_{G S 3}$ increases while $I_{D 3}$ decreases, which is not feasible if $M_{3}$ remains in saturation. Thus, $M_{3}$ enters the triode region first.\n\nAs $V_{X}$ falls below $V_{N}-V_{T H}$, $M_{3}$ enters the triode region, necessitating a higher gate-source overdrive to conduct the same current. Consequently, as illustrated in Figure 5.15(b), $V_{B}$ commences to fall, causing $I_{D 2}$ and hence $I_{X}$ to slightly decrease. As $V_{X}$ and $V_{B}$ decrease further, we eventually reach a point where $V_{B}<V_{A}-V_{T H}$, and $M_{2}$ enters the triode region. At this stage, $I_{D 2}$ begins to plummet sharply. For $V_{X}=0$, $I_{X}=0$, and $M_{2}$ and $M_{3}$ operate in the deep triode region. Note that as $V_{X}$ diminishes below $V_{N}-V_{T H 3}$, the output impedance of the cascode declines rapidly because $g_{m 3}$ degrades in the triode region.\n\nAlternative Approach: To circumvent the $V_{T H}$ penalty in the voltage headroom of the aforementioned cascode current source, we enforce $V_{D S 1}$ to be equivalent to $V_{D S 2}$. To comprehend this principle, we revisit Figure 5.14(a) and recognize that the $V_{T H}$ headroom consumption is eliminated only if $V_{b}=V_{G S 3}+\\left(V_{G S 2}-\\right.$ $V_{T H 2}$ ), i.e., only if $V_{D S 2}$ is roughly one overdrive voltage. How can we then ensure that $V_{D S 1}=V_{D S 2}$ $\\left(=V_{G S 2}-V_{T H 2}\\right)$? Since $M_{1}$ is a diode-connected device, it appears to be unattainable to expect a $V_{D S 1}$ less than one threshold.\n\nA straightforward solution to the aforementioned predicament is to introduce a deliberate voltage difference between the gate and drain of $M_{1}$ via a resistor. As depicted in Figure 5"
},
{
    "text": "In our previous discussions about current mirrors, we haven't considered the impact of channel-length modulation. In real-world applications, this effect can lead to significant inaccuracies in mirroring currents, particularly when using transistors with minimal channel lengths to reduce the width and, consequently, the output capacitance of the current source. For the basic mirror configuration depicted in Fig. 5.5(b), the expressions for the drain currents are:\n\n$$\n\\begin{align*}\nI_{D 1} & =\\frac{1}{2} \\mu_{n} C_{o x}\\left(\\frac{W}{L}\\right)_{1}\\left(V_{G S}-V_{T H}\\right)^{2}\\left(1+\\lambda V_{D S 1}\\right)  \\tag{5.5}\\\\\nI_{D 2} & =\\frac{1}{2} \\mu_{n} C_{o x}\\left(\\frac{W}{L}\\right)_{2}\\left(V_{G S}-V_{T H}\\right)^{2}\\left(1+\\lambda V_{D S 2}\\right) \\tag{5.6}\n\\end{align*}\n$$\n\nConsequently, the ratio of the drain currents is given by:\n\n$$\n\\begin{equation*}\n\\frac{I_{D 2}}{I_{D 1}}=\\frac{(W / L)_{2}}{(W / L)_{1}} \\cdot \\frac{1+\\lambda V_{D S 2}}{1+\\lambda V_{D S 1}} \\tag{5.7}\n\\end{equation*}\n$$\n\nHowever, it's important to note that $V_{D S 1}$ may not necessarily be equal to $V_{G S 2}$ due to the circuitry connected to $M_{2}$. For instance, in Fig. 5.8, the potential at node $P$ is influenced by the input common-mode level and the gate-source voltages of $M_{1}$ and $M_{2}$, and it may not equate to $V_{X}$.\n\nTo mitigate the effects of channel-length modulation in the mirror of Fig. 5.5(b), we can either ensure that $V_{D S 2}$ equals $V_{D S 1}$ or vice versa. These two strategies give rise to distinct topologies.\n\nStarting with the first strategy, we aim to maintain $V_{D S 2}$ in Fig. 5.5(b) as both constant and equal to $V_{D S 1}$. Drawing from our knowledge in Chapter 3, we know that a cascode configuration can protect a current source, thereby minimizing voltage fluctuations across it. As illustrated in Fig. 5.12(a), even if the analog circuit allows $V_{P}$ to fluctuate significantly, $V_{Y}$ remains relatively stable. The challenge lies in ensuring that $V_{D S 2}=V_{D S 1}$. We must generate $V_{b}$ such that $V_{b}-V_{G S 3}=V_{D S 1}\\left(=V_{G S 1}\\right)$, which implies $V_{b}=V_{G S 3}+V_{G S 1}$. In simpler terms, $V_{b}$ can be established by two diode-connected transistors in series [Fig. 5.12(b)], provided that $V_{G S 0}+V_{G S 1}=V_{G S 3}+V_{G S 1}$, and thus $V_{G S 0}=V_{G S 3}$. We then integrate the $V_{b}$ generator of Fig. 5.12(b) with the cascode current source, as shown in Fig. 5.12(c). This setup allows for precise current mirroring, even in the presence of body effect (why?).\n\n[The text continues with the description of the circuit diagrams and the analysis of the current mirror configurations, including the discussion of transistor sizing, large-signal behavior, and alternative approaches to mitigate channel-length modulation effects.]"
},
{
    "text": "In our exploration of current mirrors to date, we've overlooked the impact of channel-length modulation. This oversight can lead to considerable inaccuracies in current replication, particularly when using transistors with minimal channel lengths to decrease the width and thus the output capacitance of the current source. For the simple mirror depicted in Fig. 5.5(b), the relationship can be expressed as:\n\n$$\n\\begin{align*}\nI_{D 1} & =\\frac{1}{2} \\mu_{n} C_{o x}\\left(\\frac{W}{L}\\right)_{1}\\left(V_{G S}-V_{T H}\\right)^{2}\\left(1+\\lambda V_{D S 1}\\right)  \\tag{5.5}\\\\\nI_{D 2} & =\\frac{1}{2} \\mu_{n} C_{o x}\\left(\\frac{W}{L}\\right)_{2}\\left(V_{G S}-V_{T H}\\right)^{2}\\left(1+\\lambda V_{D S 2}\\right) \\tag{5.6}\n\\end{align*}\n$$\n\nConsequently,\n\n$$\n\\begin{equation*}\n\\frac{I_{D 2}}{I_{D 1}}=\\frac{(W / L)_{2}}{(W / L)_{1}} \\cdot \\frac{1+\\lambda V_{D S 2}}{1+\\lambda V_{D S 1}} \\tag{5.7}\n\\end{equation*}\n$$\n\nHere, while $V_{D S 1}=V_{G S 1}=V_{G S 2}$, $V_{D S 2}$ may not align with $V_{G S 2}$ due to the circuitry connected to $M_{2}$. For instance, in Fig. 5.8, the voltage at node $P$ is influenced by the input common-mode level and the gate-source voltages of $M_{1}$ and $M_{2}$, and may not equate to $V_{X}$.\n\nTo mitigate the effects of channel-length modulation in Fig. 5.5(b), we can either (1) ensure $V_{D S 2}$ equals $V_{D S 1}$, or (2) enforce $V_{D S 1}$ to match $V_{D S 2}$. These two approaches give rise to distinct topologies.\n\n**First Approach**\n\nWe start with the first strategy, aiming to make $V_{D S 2}$ in Fig. 5.5(b) constant and equivalent to $V_{D S 1}$. As discussed in Chapter 3, a cascode configuration can shield a current source, diminishing voltage fluctuations across it. As illustrated in Fig. 5.12(a), despite potential substantial variations in $V_{P}$ in the analog circuit, $V_{Y}$ remains relatively stable. To guarantee $V_{D S 2}=V_{D S 1}$, we must generate $V_{b}$ such that $V_{b}-V_{G S 3}=V_{D S 1}\\left(=V_{G S 1}\\right)$, i.e., $V_{b}=V_{G S 3}+V_{G S 1}$. This means $V_{b}$ can be established by two diode-connected devices in series [Fig. 5.12(b)], provided that $V_{G S 0}+V_{G S 1}=V_{G S 3}+V_{G S 1}$, and thus $V_{G S 0}=V_{G S 3}$. We then attach the $V_{b}$ generator of Fig. 5.12(b) to the cascode current source as shown in Fig. 5.12(c). This arrangement permits precise current replication, even in the presence of body effect.\n\n**Image Descriptions**\n\n- **Figure 5.12(a)**: This figure depicts a cascode current source.\n- **Figure 5.12(b)**: This figure shows a modification to the mirror circuit to generate the cascode bias voltage.\n- **Figure 5.12(c)**: This figure illustrates a cascode current mirror.\n\n**Transistor Sizing**\n\nSome insights into the sizing of transistors in Fig. 5.12(c) are worth noting. As previously discussed, we generally set $L_{2}=L_{1}$ and scale $W_{2}$ (in integer multiples) relative to $W_{1}$ to achieve the desired multiple of $I_{R E F}$. Similarly, for $V_{G S 3}$ to match $V_{G S 0}$, we select $L_{3}=L_{0}$ and scale $W_{3}$ relative to $W_{0}$ by the same factor, i.e., $W_{3} / W_{0}=W_{2} / W_{1}$. In practice, $L_{3}$ and $L_{0}$ are set to the minimum allowable value to reduce their width, while $L_{1}$ and $L_{2}$ may be longer in certain scenarios.\n\n**Example 5.3**\n\nIn Fig. 5.13, sketch $V_{X}$ and $V_{Y}$ as functions of $I_{R E F}$. If $I_{R E F}$ requires 0.5 V to function as a current source, what is its maximum value?\n\n**Solution**\n\nGiven that $M_{2}$ and $M_{3}$ are properly scaled with respect to $M_{1}$ and $M_{0}$, we have $V_{Y}=V_{X} \\approx \\sqrt{2 I_{R E F} /\\left[\\mu_{n} C_{o x}(W / L)_{1}\\right]}+$ $V_{T H 1}$. This behavior is illustrated in Fig. 5.13(b).\n\nTo determine the maximum value of $I_{R E F}$, we observe that\n\n$$\n\\begin{align*}\nV_{N} & =V_{G S 0}+V_{G S 1}  \\tag{5.8}\\\\\n& =\\sqrt{\\frac{2 I_{R E F}}{\\mu_{n} C_{o x}}}\\left[\\sqrt{\\left(\\frac{L}{W}\\right)_{0}}+\\sqrt{\\left(\\frac{L}{W}\\right)_{1}}\\right]+V_{T H 0}+V_{T H 1} \\tag{5.9}\n\\end{align*}\n$$\n\nTherefore,\n\n$$\n\\begin{equation*}\nV_{D D}-\\sqrt{\\frac{2 I_{R E F}}{\\mu_{n} C_{o x}}}\\left[\\sqrt{\\left(\\frac{L}{W}\\right)_{0}}+\\sqrt{\\left(\\frac{L}{W}\\right)_{1}}\\right]-V_{T H 0}-V_{T H 1}=0.5 \\mathrm{~V} \\tag{5.10}\n\\end{equation*}\n$$\n\nHence,\n\n$$\n\\begin{equation*}\nI_{R E F, \\max }=\\frac{\\mu_{n} C_{o x}}{2} \\frac{\\left(V_{D D}-0.5 \\mathrm{~V}-V_{T H 0}-V_{T H 1}\\right)^{2}}{\\left(\\sqrt{(L / W)_{0}}+\\sqrt{\\left.(L / W)_{1}\\right)^{2}}\\right.} \\tag{5.11}\n\\end{equation*}\n$$\n\nWhile the topology of Fig. 5.12(c) operates as a current source with high output impedance and accurate current value, it does consume a significant portion of the voltage headroom. For simplicity, let's disregard the body effect and assume all transistors are identical. Then, the minimum allowable voltage at node $P$ equals\n\n$$\n\\begin{align*}\nV_{N}-V_{T H} & =V_{G S 0}+V_{G S 1}-V_{T H}  \\tag{5.12}\\\\\n& =\\left(V_{G S 0}-V_{T H}\\right)+\\left(V_{G S 1}-V_{T H}\\right)+V_{T H} \\tag{5.13}\n\\end{align*}\n$$\n\ni.e., two overdrive voltages plus one threshold voltage. How does this value compare with that in Fig. 5.12(a) if $V_{b}$ could be chosen more flexibly? As shown in Fig. 5.14(a), $V_{b}$ could be set so low that the minimum allowable voltage at $P$ is merely two overdrive voltages. Thus, the cascode mirror of Fig. 5.12(c) \"squanders\" one threshold voltage in the headroom. This occurs because $V_{D S 2}=V_{G S 2}$, whereas $V_{D S 2}$ could be as low as $V_{G S 2}-V_{T H}$ while keeping $M_{2}$ in saturation.\n\n**Figure 5.14** summarizes our discussion. In Fig. 5.14(a), $V_{b}$ is selected to allow the lowest possible value of $V_{P}$, but the output current does not accurately track $I_{R E F}$ because $M_{1}$ and $M_{2}$ experience unequal drain-source voltages. In Fig. 5.14(b), higher accuracy is achieved, but the minimum level at $P$ is elevated by one threshold voltage.\n\nBefore addressing this issue, it's instructive to analyze the large-signal behavior of a cascode current source.\n\n**Example 5.4**\n\nIn Fig. 5.15(a), assuming all transistors are identical, sketch $I_{X}$ and $V_{B}$ as $V_{X}$ decreases from a large positive value.\n\n**Solution**\n\nFor $V_{X} \\geq V_{N}-V_{T H}$, both $M_{2}$ and $M_{3}$ are in saturation, $I_{X}=I_{R E F}$ and $V_{B}=V_{A}$. As $V_{X}$ drops, which transistor enters the triode region first, $M_{3}$ or $M_{2}$? Suppose $M_{2}$ enters the triode region before $M_{3}$. For this to occur, $V_{D S 2}$ must decrease, and since $V_{G S 2}$ is constant, so must $I_{D 2}$. This implies that $V_{G S 3}$ increases while $I_{D 3}$ decreases, which is not feasible if $M_{3}$ remains in saturation. Thus, $M_{3}$ enters the triode region first.\n\nAs $V_{X}$ falls below $V_{N}-V_{T H}$, $M_{3}$ enters the triode region, necessitating a greater gate-source overdrive to maintain the same current. Therefore, as depicted in Fig. 5.15 (b), $V_{B}$ starts to drop, causing $I_{D 2}$ and hence $I_{X}$ to slightly decrease. As $V_{X}$ and $V_{B}$ decrease further, eventually we reach $V_{B}<V_{A}-V_{T H}$, and $M_{2}$ enters the triode region. At this point, $I_{D 2}$ begins to sharply decrease. For $V_{X}=0$, $I_{X}=0$, and $M_{2}$ and $M_{3}$ operate in the deep triode region. Note that as $V_{X}$ drops below $V_{N}-V_{T H 3}$, the output impedance of the cascode rapidly declines because $g_{m 3}$ degrades in the triode region.\n\n**Second Approach**\n\nTo evade the $V_{T H}$ penalty in the voltage headroom of the aforementioned cascode current source, we enforce $V_{D S 1}$ to be equal to $V_{D S 2}$ instead. To comprehend this principle, we revisit Fig. 5.14(a) and recognize that the $V_{T H}$ headroom consumption is eliminated only if $V_{b}=V_{G S 3}+\\left(V_{G S 2}-\\right.$ $V_{T H 2}$ ), i.e., only if $V_{D S 2}$ is around one overdrive voltage. How can we then ensure that $V_{D S 1}=V_{D S 2}$ $\\left(=V_{G S 2}-V_{T H 2}\\right)$? Since $M_{1}$ is a diode-connected device, it seems impractical to expect a $V_{D S 1}$ less than one threshold.\n\nA simple solution to the aforementioned dilemma is to intentionally create a voltage difference between the gate and drain of $M_{1}$ using a resistor. As depicted in Fig. 5.16(a), the idea is to choose $R_{1} I_{R E F} \\approx V_{T H 1}$ and $V_{b}=V_{G S 3}+\\left(V_{G S 1}-V_{T H 1}\\right)$. Now, $V_{D S 1}=V_{G S 1}-R_{1} I_{R E F} \\approx V_{G S 1}-V_{T H 1}$, which is equal to $V_{b}-V_{G S 3}$ and hence to $V_{D S 2}$.\n\n**Example 5.5**\n\nIs the $M_{1}-R_{1}$ combination in Fig. 5.16(a) a diode-connected device? Assume $\\lambda>0$.\n\n**Solution**\n\nFrom the small-signal equivalent shown in Fig. 5.17, we express the voltage drop across $R_{1}$ as $I_{X} R_{1}$ and write a KCL at the drain node:\n\n$$\n\\begin{equation*}\n\\frac{V_{X}-I_{X} R_{1}}{r_{O}}+g_{m} V_{X}=I_{X} \\tag{5.14}\n\\end{equation*}\n$$\n\nIt follows that\n$$\n\\begin{equation*}\n\\frac{V_{X}}{I_{X}}=\\frac{R_{1}+r_{O}}{1+g_{m} r_{O}} \\tag{5.15}\n\\end{equation*}\n$$\n\nwhich simplifies to $1 / g_{m}$ in the absence of channel-length modulation. (Is it a coincidence that this impedance is the same as that seen at the source of a common-gate stage with $\\gamma=0$ ?!) Thus, from a small-signal perspective, the combination is nearly a diode-connected device. From a large-signal standpoint, $V_{G S 1} \\approx \\sqrt{2 I_{D} /\\left[\\mu_{n} C_{o x}(W / L)\\right]}+$ $V_{T H}$ if $\\lambda$ is small, suggesting diode-connected operation as well.\n\nThe circuit of Fig. 5.16(a) presents two challenges. First, in the presence of PVT variations, it may be challenging to ensure that $R_{1} I_{R E F} \\approx V_{T H 1}$ as $R_{1}$ and $V_{T H}$ may vary differently. Second, the generation of $V_{b}=V_{G S 3}+\\left(V_{G S 1}-V_{T H 1}\\right)$ is not straightforward. Let's address the latter issue first. We seek an arrangement that adds one gate-source voltage to an overdrive, assuming we must start with a diode-connected device. We consider the branch shown in Fig. 5.16(b) as a candidate and write $V_{b}=V_{G S 5}+R_{6} I_{6}$. We can readily choose $I_{6}$ and the dimensions of $M_{5}$ to ensure that $V_{G S 5}=V_{G S 3}$. However, the condition $R_{6} I_{6}=V_{G S 1}-V_{T H 1}=V_{G S 1}-R_{1} I_{R E F}$ translates to $R_{6} I_{6}+R_{1} I_{R E F}=V_{G S 1}$, which is difficult to meet because the $I R$ products do not \"track\" the MOS gate-source voltage. For example, the value of the resistors may decrease with temperature while $V_{G S}$ may increase.\n\nDepicted in Fig. 5.16(c) is another example, where $M_{5}$ establishes the $V_{G S}$, and $M_{6}$ and $R_{6}$ the overdrive. We select $I_{6}$ and the device parameters such that\n\n$$\n\\begin{align*}\n& V_{G S 5}=V_{G S 3}  \\tag{5.16}\\\\\n& V_{G S 6}-R_{6} I_{6}=V_{G S 1}-V_{T H 1}  \\tag{5.17}\\\\\n& =V_{G S 1}-R_{1} I_{R E F} \\tag{5.18}\n\\end{align*}\n$$\n\nobserving that it is now possible to ensure that $V_{G S 6}$ and $V_{G S 1}$ track each other, and so do $R_{1} I_{R E F}$ and $R_{6} I_{6}$. For instance, we may simply choose $I_{6}=I_{R E F}$, $R_{6}=R_{1}$, and $(W / L)_{6}=(W / L)_{1} .{ }^{2}$\n\nTo circumvent the first issue mentioned above, we develop another circuit topology that compels the $V_{D S}$ of the diode-connected device to be equal to the $V_{D S}$ of the current source transistor. The level shift between the gate and drain voltages need not be created by a resistor. In particular, suppose we connect the output node of a cascode topology to its input [Fig. 5.18(a)]. In this case, $V_{D S 1}=V_{b}-V_{G S 0}$, and $V_{b}$ can be chosen to place $M_{1}$ at the edge of saturation. We now connect this branch to the main cascode current source as shown in Fig. 5.18(b), recognizing that"
},
{
    "text": "In our exploration of current mirrors, we've overlooked the impact of channel-length modulation. In real-world scenarios, this effect introduces considerable inaccuracies in current copying, particularly when minimum-length transistors are employed to reduce the current source's width and, consequently, its output capacitance. For the simple mirror depicted in Fig. 5.5(b), the equations can be expressed as:\n\n$$\n\\begin{align*}\nI_{D 1} & =\\frac{1}{2} \\mu_{n} C_{o x}\\left(\\frac{W}{L}\\right)_{1}\\left(V_{G S}-V_{T H}\\right)^{2}\\left(1+\\lambda V_{D S 1}\\right)  \\tag{5.5}\\\\\nI_{D 2} & =\\frac{1}{2} \\mu_{n} C_{o x}\\left(\\frac{W}{L}\\right)_{2}\\left(V_{G S}-V_{T H}\\right)^{2}\\left(1+\\lambda V_{D S 2}\\right) \\tag{5.6}\n\\end{align*}\n$$\n\nConsequently:\n\n$$\n\\begin{equation*}\n\\frac{I_{D 2}}{I_{D 1}}=\\frac{(W / L)_{2}}{(W / L)_{1}} \\cdot \\frac{1+\\lambda V_{D S 2}}{1+\\lambda V_{D S 1}} \\tag{5.7}\n\\end{equation*}\n$$\n\nIt's important to note that while $V_{D S 1}=V_{G S 1}=V_{G S 2}$, $V_{D S 2}$ may not necessarily equal $V_{G S 2}$ due to the circuit connected to $M_{2}$. For instance, in Fig. 5.8, the voltage at node $P$ is influenced by the input common-mode level and the gate-source voltages of $M_{1}$ and $M_{2}$, and may not align with $V_{X}$.\n\nTo mitigate the effects of channel-length modulation in Fig. 5.5(b), we can either (1) ensure $V_{D S 2}$ equals $V_{D S 1}$, or (2) make $V_{D S 1}$ equal to $V_{D S 2}$. These two strategies lead to distinct topologies.\n\nFirst Strategy: Starting with the first approach, we aim to keep $V_{D S 2}$ in Fig. 5.5(b) constant and equal to $V_{D S 1}$. As discussed in Chapter 3, a cascode configuration can protect a current source, thereby minimizing voltage fluctuations across it. As illustrated in Fig. 5.12(a), despite potential significant variations in $V_{P}$, $V_{Y}$ remains relatively stable. However, the challenge is to guarantee $V_{D S 2}=V_{D S 1}$. We must generate $V_{b}$ such that $V_{b}-V_{G S 3}=V_{D S 1}\\left(=V_{G S 1}\\right)$, or $V_{b}=V_{G S 3}+V_{G S 1}$. This means $V_{b}$ can be established by two diode-connected devices in series [Fig. 5.12(b)], provided $V_{G S 0}+V_{G S 1}=V_{G S 3}+V_{G S 1}$, and hence $V_{G S 0}=V_{G S 3}$. We then integrate the $V_{b}$ generator of Fig. 5.12(b) with the cascode current source as shown in Fig. 5.12(c). This setup allows precise current copying, even in the presence of body effect.\n\nThe circuit diagrams provided include descriptions of various configurations involving NMOS transistors and current sources, aimed at achieving accurate current mirroring with minimized voltage headroom consumption. These configurations exploit the properties of cascode structures, diode connections, and resistor-induced voltage drops to maintain transistor operation within the desired regions.\n\nThe discussions and examples provided illustrate the complexities involved in designing current mirrors that are both accurate and efficient, taking into account the non-idealities such as channel-length modulation and body effect. Various strategies and topologies are explored to optimize the performance of current mirrors in different circuit scenarios."
},
{
    "text": "In our exploration of current mirrors, the impact of channel-length modulation has been overlooked. In reality, this effect introduces considerable inaccuracy in current replication, especially when minimum-length transistors are employed to minimize the width and, consequently, the output capacitance of the current source. For the simple mirror depicted in Fig. 5.5(b), the equations are:\n\n$$\n\\begin{align*}\nI_{D 1} & =\\frac{1}{2} \\mu_{n} C_{o x}\\left(\\frac{W}{L}\\right)_{1}\\left(V_{G S}-V_{T H}\\right)^{2}\\left(1+\\lambda V_{D S 1}\\right)  \\tag{5.5}\\\\\nI_{D 2} & =\\frac{1}{2} \\mu_{n} C_{o x}\\left(\\frac{W}{L}\\right)_{2}\\left(V_{G S}-V_{T H}\\right)^{2}\\left(1+\\lambda V_{D S 2}\\right) \\tag{5.6}\n\\end{align*}\n$$\n\nThus, the ratio of $I_{D 2}$ to $I_{D 1}$ is:\n\n$$\n\\begin{equation*}\n\\frac{I_{D 2}}{I_{D 1}}=\\frac{(W / L)_{2}}{(W / L)_{1}} \\cdot \\frac{1+\\lambda V_{D S 2}}{1+\\lambda V_{D S 1}} \\tag{5.7}\n\\end{equation*}\n$$\n\nHowever, it's important to note that while $V_{D S 1}=V_{G S 1}=V_{G S 2}$, $V_{D S 2}$ may not be equal to $V_{G S 2}$ due to the circuitry driven by $M_{2}$. For instance, in Fig. 5.8, the potential at node $P$ is determined by the input common-mode level and the gate-source voltage of $M_{1}$ and $M_{2}$, and it may not equate to $V_{X}$.\n\nTo mitigate the effects of channel-length modulation in Fig. 5.5(b), we can either (1) ensure $V_{D S 2}$ equals $V_{D S 1}$, or (2) make $V_{D S 1}$ equal to $V_{D S 2}$. These principles give rise to two distinct topologies.\n\nThe first approach involves ensuring that $V_{D S 2}$ in Fig. 5.5(b) remains constant and equal to $V_{D S 1}$. As discussed in Chapter 3, a cascode device can shield a current source, thereby reducing voltage fluctuations across it. As depicted in Fig. 5.12(a), even though the analog circuit may allow $V_{P}$ to vary substantially, $V_{Y}$ remains relatively constant. The challenge is to guarantee that $V_{D S 2}=V_{D S 1}$. This is achieved by generating $V_{b}$ such that $V_{b}-V_{G S 3}=V_{D S 1}\\left(=V_{G S 1}\\right)$, i.e., $V_{b}=V_{G S 3}+V_{G S 1}$. In other words, $V_{b}$ can be established by two diode-connected devices in series [Fig. 5.12(b)], provided that $V_{G S 0}+V_{G S 1}=V_{G S 3}+V_{G S 1}$, and hence $V_{G S 0}=V_{G S 3}$. We then attach the $V_{b}$ generator of Fig. 5.12(b) to the cascode current source as shown in Fig. 5.12(c). This setup allows for accurate current replication, even in the presence of body effect.\n\nThe circuit diagrams provided in the context describe various configurations of current mirrors and cascode devices, including their respective biasing circuits. These diagrams are essential for understanding the principles and topologies discussed in the text.\n\nThe text continues with a discussion on the sizing of transistors in Fig. 5.12(c) and provides examples and solutions to various problems related to current mirrors and their behavior under different conditions. It also presents alternative approaches to minimize the effects of channel-length modulation and achieve accurate current replication with high output impedance.\n\nThe examples include sketches and graphs that illustrate the relationship between reference current and voltages in the circuits, as well as the behavior of the current mirrors under large-signal conditions. The solutions to these examples offer insights into the operation of the circuits and the design considerations involved in minimizing errors due to channel-length modulation.\n\nThe text concludes with a discussion on the limitations and trade-offs of the presented circuit topologies, highlighting the importance of voltage headroom and the impact of body effect on the accuracy of current mirrors."
},
{
    "text": "Our conversation about current mirrors has thus far omitted the impact of channel-length modulation. This effect can lead to considerable inaccuracies in current replication, particularly when the shortest possible transistors are utilized to limit the width and, consequently, the output capacitance of the current source. Consider the straightforward mirror in Fig. 5.5(b); we can formulate the following equations:\n\n$$\n\\begin{align*}\nI_{D 1} & =\\frac{1}{2} \\mu_{n} C_{o x}\\left(\\frac{W}{L}\\right)_{1}\\left(V_{G S}-V_{T H}\\right)^{2}\\left(1+\\lambda V_{D S 1}\\right)  \\tag{5.5}\\\\\nI_{D 2} & =\\frac{1}{2} \\mu_{n} C_{o x}\\left(\\frac{W}{L}\\right)_{2}\\left(V_{G S}-V_{T H}\\right)^{2}\\left(1+\\lambda V_{D S 2}\\right) \\tag{5.6}\n\\end{align*}\n$$\n\nTherefore,\n\n$$\n\\begin{equation*}\n\\frac{I_{D 2}}{I_{D 1}}=\\frac{(W / L)_{2}}{(W / L)_{1}} \\cdot \\frac{1+\\lambda V_{D S 2}}{1+\\lambda V_{D S 1}} \\tag{5.7}\n\\end{equation*}\n$$\n\nIt's important to note that while $V_{D S 1}=V_{G S 1}=V_{G S 2}$, $V_{D S 2}$ may not equate to $V_{G S 2}$ due to the circuitry driven by $M_{2}$. For instance, in Fig. 5.8, the voltage at node $P$ is dictated by the input common-mode level and the gate-source voltages of $M_{1}$ and $M_{2}$, and it may not be equal to $V_{X}$.\n\nTo mitigate the effects of channel-length modulation in Fig. 5.5(b), we can either (1) ensure $V_{D S 2}$ is equal to $V_{D S 1}$, or (2) make $V_{D S 1}$ equal to $V_{D S 2}$. These two strategies give rise to different topologies.\n\n**First Approach**\n\nWe start with the first strategy, aiming to maintain $V_{D S 2}$ in Fig. 5.5(b) as both constant and equal to $V_{D S 1}$. As discussed in Chapter 3, a cascode device can protect a current source, thereby reducing voltage fluctuations across it. As depicted in Fig. 5.12(a), even though the analog circuit may allow $V_{P}$ to fluctuate significantly, $V_{Y}$ remains relatively stable. The challenge is to guarantee that $V_{D S 2}=V_{D S 1}$. We must generate $V_{b}$ such that $V_{b}-V_{G S 3}=V_{D S 1}\\left(=V_{G S 1}\\right)$, meaning $V_{b}=V_{G S 3}+V_{G S 1}$. In other words, $V_{b}$ can be established by two diode-connected devices in series [Fig. 5.12(b)], provided that $V_{G S 0}+V_{G S 1}=V_{G S 3}+V_{G S 1}$, and hence $V_{G S 0}=V_{G S 3}$. We then connect the $V_{b}$ generator of Fig. 5.12(b) to the cascode current source as shown in Fig. 5.12(c). This setup enables precise current replication, even in the presence of body effect.\n\n**Second Approach**\n\nTo sidestep the $V_{T H}$ penalty in the voltage headroom of the aforementioned cascode current source, we force $V_{D S 1}$ to be equal to $V_{D S 2}$ instead. To grasp this concept, we revisit Fig. 5.14(a) and acknowledge that the $V_{T H}$ headroom consumption is negated only if $V_{b}=V_{G S 3}+\\left(V_{G S 2}-V_{T H 2}\\right)$, i.e., only if $V_{D S 2}$ is around one overdrive voltage. How can we then ensure that $V_{D S 1}=V_{D S 2}\\left(=V_{G S 2}-V_{T H 2}\\right)$? Since $M_{1}$ is a diode-connected device, it seems impossible to expect a $V_{D S 1}$ less than one threshold.\n\nA straightforward solution is to create a deliberate voltage difference between the gate and drain of $M_{1}$ using a resistor. As illustrated in Fig. 5.16(a), the idea is to select $R_{1} I_{R E F} \\approx V_{T H 1}$ and $V_{b}=V_{G S 3}+\\left(V_{G S 1}-V_{T H 1}\\right)$. Now, $V_{D S 1}=V_{G S 1}-R_{1} I_{R E F} \\approx V_{G S 1}-V_{T H 1}$, which is equal to $V_{b}-V_{G S 3}$ and hence to $V_{D S 2}$.\n\n**Low-Voltage Cascode**\n\nTo avoid the first issue mentioned earlier, we develop another circuit topology that forces the $V_{D S}$ of the diode-connected device to be equal to the $V_{D S}$ of the current source transistor. The level shift between the gate and drain voltages need not be created by a resistor. Specifically, suppose we connect the output node of a cascode topology to its input [Fig. 5.18(a)]. In this case, $V_{D S 1}=V_{b}-V_{G S 0}$, and $V_{b}$ can be chosen to place $M_{1}$ at the edge of saturation. We now connect this branch to the main cascode current source as shown in Fig. 5.18(b), recognizing that $V_{D S 1}$ is forced to be equal to $V_{D S 2}$ if $V_{G S 0}=V_{G S 3}$. Referred to as a \"low-voltage cascode,\" this configuration is more widely used than the regular cascode shown in Fig. 5.14(b).\n\n**Conclusion**\n\nThe strategies outlined here aim to minimize the errors introduced by channel-length modulation in current mirrors. By carefully designing the circuit topology and selecting appropriate biasing conditions, it is possible to achieve accurate current replication with high output impedance, even in the presence of body effect and other non-idealities."
},
{
    "text": "Our examination of current mirrors has thus far omitted the impact of channel-length modulation. In reality, this effect introduces significant inaccuracies in current replication, particularly when minimum-length transistors are employed to reduce the width and, consequently, the output capacitance of the current source. Consider the simple mirror depicted in Fig. 5.5(b); the equations governing the drain currents \\(I_{D1}\\) and \\(I_{D2}\\) are as follows:\n\n$$\n\\begin{align*}\nI_{D 1} & =\\frac{1}{2} \\mu_{n} C_{o x}\\left(\\frac{W}{L}\\right)_{1}\\left(V_{G S}-V_{T H}\\right)^{2}\\left(1+\\lambda V_{D S 1}\\right)  \\tag{5.5}\\\\\nI_{D 2} & =\\frac{1}{2} \\mu_{n} C_{o x}\\left(\\frac{W}{L}\\right)_{2}\\left(V_{G S}-V_{T H}\\right)^{2}\\left(1+\\lambda V_{D S 2}\\right) \\tag{5.6}\n\\end{align*}\n$$\n\nConsequently, the ratio of \\(I_{D2}\\) to \\(I_{D1}\\) is expressed as:\n\n$$\n\\begin{equation*}\n\\frac{I_{D 2}}{I_{D 1}}=\\frac{(W / L)_{2}}{(W / L)_{1}} \\cdot \\frac{1+\\lambda V_{D S 2}}{1+\\lambda V_{D S 1}} \\tag{5.7}\n\\end{equation*}\n$$\n\nHere, \\(V_{D S 1}\\) is equal to \\(V_{G S 1}\\) and \\(V_{G S 2}\\), but \\(V_{D S 2}\\) may not necessarily be equal to \\(V_{G S 2}\\), influenced by the circuitry connected to \\(M_{2}\\). For instance, in Fig. 5.8, the potential at node \\(P\\) is influenced by the input common-mode level and the gate-source voltages of \\(M_{1}\\) and \\(M_{2}\\), which may not align with \\(V_{X}\\).\n\nTo mitigate the influence of channel-length modulation in Fig. 5.5(b), we can either set \\(V_{D S 2}\\) equal to \\(V_{D S 1}\\) or enforce \\(V_{D S 1}\\) to match \\(V_{D S 2}\\). These strategies give rise to distinct topologies.\n\nThe first strategy aims to maintain \\(V_{D S 2}\\) in Fig. 5.5(b) as both constant and equivalent to \\(V_{D S 1}\\). Recollecting from Chapter 3, a cascode configuration can shield a current source, thereby diminishing voltage fluctuations across it. As demonstrated in Fig. 5.12(a), despite \\(V_{P}\\) undergoing substantial changes in an analog circuit, \\(V_{Y}\\) remains relatively stable. However, achieving \\(V_{D S 2}=V_{D S 1}\\) requires generating \\(V_{b}\\) such that \\(V_{b}-V_{G S 3}=V_{D S 1}\\) (which equals \\(V_{G S 1}\\)), i.e., \\(V_{b}=V_{G S 3}+V_{G S 1}\\). This implies that \\(V_{b}\\) can be established by two diode-connected devices in series, as seen in Fig. 5.12(b), provided \\(V_{G S 0}+V_{G S 1}=V_{G S 3}+V_{G S 1}\\), leading to \\(V_{G S 0}=V_{G S 3}\\). This setup is then attached to the cascode current source, as depicted in Fig. 5.12(c), ensuring precise current replication even in the presence of body effect.\n\nRegarding the transistor dimensions in Fig. 5.12(c), it is standard practice to set \\(L_{2}=L_{1}\\) and scale \\(W_{2}\\) (in integer multiples) relative to \\(W_{1}\\) to achieve the desired multiple of \\(I_{R E F}\\). Similarly, for \\(V_{G S 3}\\) to match \\(V_{G S 0}\\), we select \\(L_{3}=L_{0}\\) and proportionally scale \\(W_{3}\\) with respect to \\(W_{0}\\) by the same factor, i.e., \\(W_{3} / W_{0}=W_{2} / W_{1}\\). Practically, \\(L_{3}\\) and \\(L_{0}\\) are set to the minimum allowable value to reduce their width, while \\(L_{1}\\) and \\(L_{2}\\) might be longer in certain scenarios."
},
{
    "text": "In our exploration of current mirrors, we have yet to address channel-length modulation. In practical scenarios, this phenomenon can significantly impair the accuracy of current copying, particularly when using the shortest possible transistors to minimize the width, and thus the output capacitance, of the current source. Considering the straightforward mirror configuration depicted in Fig. 5.5(b), we can formulate the following expressions:\n\n$$\n\\begin{align*}\nI_{D 1} & =\\frac{1}{2} \\mu_{n} C_{o x}\\left(\\frac{W}{L}\\right)_{1}\\left(V_{G S}-V_{T H}\\right)^{2}\\left(1+\\lambda V_{D S 1}\\right)  \\tag{5.5}\\\\\nI_{D 2} & =\\frac{1}{2} \\mu_{n} C_{o x}\\left(\\frac{W}{L}\\right)_{2}\\left(V_{G S}-V_{T H}\\right)^{2}\\left(1+\\lambda V_{D S 2}\\right) \\tag{5.6}\n\\end{align*}\n$$\n\nConsequently,\n\n$$\n\\begin{equation*}\n\\frac{I_{D 2}}{I_{D 1}}=\\frac{(W / L)_{2}}{(W / L)_{1}} \\cdot \\frac{1+\\lambda V_{D S 2}}{1+\\lambda V_{D S 1}} \\tag{5.7}\n\\end{equation*}\n$$\n\nIt's important to note that while $V_{D S 1}=V_{G S 1}=V_{G S 2}$, $V_{D S 2}$ may not necessarily equal $V_{G S 2}$ due to the circuit connected to $M_{2}$. For instance, in Fig. 5.8, the voltage at node $P$ is governed by the input common-mode level and the gate-source voltages of $M_{1}$ and $M_{2}$, and it may not align with $V_{X}$.\n\nTo mitigate the impact of channel-length modulation in the setup of Fig. 5.5(b), we can either (1) ensure $V_{D S 2}$ is equal to $V_{D S 1}$, or (2) make $V_{D S 1}$ equal to $V_{D S 2}$. These strategies lead to distinct circuit topologies.\n\n**First Approach**\n\nWe commence with the first strategy, aiming to maintain $V_{D S 2}$ in Fig. 5.5(b) as both a constant and an equivalent to $V_{D S 1}$. Recollect from Chapter 3 that a cascode arrangement can shield a current source, thereby diminishing voltage fluctuations across it. As demonstrated in Fig. 5.12(a), even with significant variations in $V_{P}$ within the analog circuit, $V_{Y}$ remains fairly stable. The challenge is to guarantee that $V_{D S 2}=V_{D S 1}$. We must generate $V_{b}$ such that $V_{b}-V_{G S 3}=V_{D S 1}\\left(=V_{G S 1}\\right)$, implying $V_{b}=V_{G S 3}+V_{G S 1}$. In essence, $V_{b}$ can be established by two diode-connected devices in series [Fig. 5.12(b)], provided $V_{G S 0}+V_{G S 1}=V_{G S 3}+V_{G S 1}$, hence $V_{G S 0}=V_{G S 3}$. We then connect the $V_{b}$ generator from Fig. 5.12(b) to the cascode current source, as depicted in Fig. 5.12(c). This arrangement permits precise current copying, even when body effect is present (why?).\n\n**Image Descriptions**\n\n- **Figure 5.12(a)**: Cascode current source.\n- **Figure 5.12(b)**: Modification of mirror circuit to generate the cascode bias voltage.\n- **Figure 5.12(c)**: Cascode current mirror.\n\n**Additional Notes on Transistor Sizing**\n\nWhen designing the transistors in Fig. 5.12(c), we typically set $L_{2}=L_{1}$ and adjust $W_{2}$ (in integer multiples) relative to $W_{1}$ to achieve the desired multiple of $I_{R E F}$. Similarly, for $V_{G S 3}$ to match $V_{G S 0}$, we choose $L_{3}=L_{0}$ and scale $W_{3}$ relative to $W_{0}$ by the same factor, i.e., $W_{3} / W_{0}=W_{2} / W_{1}$. In practical applications, $L_{3}$ and $L_{0}$ are set to the minimum allowable value to reduce their width, whereas $L_{1}$ and $L_{2}$ might be longer in certain scenarios.\n\n**Example 5.3**\n\nRefer to Fig. 5.13 and sketch $V_{X}$ and $V_{Y}$ as functions of $I_{R E F}$. If $I_{R E F}$ necessitates 0.5 V to function as a current source, what is its maximum value?\n\n**Solution**\n\nGiven that $M_{2}$ and $M_{3}$ are appropriately proportioned relative to $M_{1}$ and $M_{0}$, we obtain $V_{Y}=V_{X} \\approx \\sqrt{2 I_{R E F} /\\left[\\mu_{n} C_{o x}(W / L)_{1}\\right]}+$ $V_{T H 1}$. This behavior is depicted in Fig. 5.13(b).\n\nTo determine the maximum value of $I_{R E F}$, we consider that\n\n$$\n\\begin{align*}\nV_{N} & =V_{G S 0}+V_{G S 1}  \\tag{5.8}\\\\\n& =\\sqrt{\\frac{2 I_{R E F}}{\\mu_{n} C_{o x}}}\\left[\\sqrt{\\left(\\frac{L}{W}\\right)_{0}}+\\sqrt{\\left(\\frac{L}{W}\\right)_{1}}\\right]+V_{T H 0}+V_{T H 1} \\tag{5.9}\n\\end{align*}\n$$\n\n**Image Descriptions**\n\n- **Figure 5.13(a)**: Current mirror with NMOS transistors.\n- **Figure 5.13(b)**: Plot showing the relationship between $I_{R E F}$ and voltages $V_X$ and $V_Y$.\n\n**Solution Continuation**\n\nThus,\n\n$$\n\\begin{equation*}\nV_{D D}-\\sqrt{\\frac{2 I_{R E F}}{\\mu_{n} C_{o x}}}\\left[\\sqrt{\\left(\\frac{L}{W}\\right)_{0}}+\\sqrt{\\left(\\frac{L}{W}\\right)_{1}}\\right]-V_{T H 0}-V_{T H 1}=0.5 \\mathrm{~V} \\tag{5.10}\n\\end{equation*}\n$$\n\nand consequently\n\n$$\n\\begin{equation*}\nI_{R E F, \\max }=\\frac{\\mu_{n} C_{o x}}{2} \\frac{\\left(V_{D D}-0.5 \\mathrm{~V}-V_{T H 0}-V_{T H 1}\\right)^{2}}{\\left(\\sqrt{(L / W)_{0}}+\\sqrt{\\left.(L / W)_{1}\\right)^{2}}\\right.} \\tag{5.11}\n\\end{equation*}\n$$\n\n**Voltage Headroom Considerations**\n\nWhile the topology in Fig. 5.12(c) operates as a current source with high output impedance and accuracy, it still necessitates a considerable voltage headroom. For simplicity, let's disregard the body effect and assume all transistors are identical. Then, the minimum allowable voltage at node $P$ is equal to\n\n$$\n\\begin{align*}\nV_{N}-V_{T H} & =V_{G S 0}+V_{G S 1}-V_{T H}  \\tag{5.12}\\\\\n& =\\left(V_{G S 0}-V_{T H}\\right)+\\left(V_{G S 1}-V_{T H}\\right)+V_{T H} \\tag{5.13}\n\\end{align*}\n$$\n\ni.e., two overdrive voltages plus one threshold voltage. How does this value compare with that in Fig. 5.12(a) if $V_{b}$ could be selected more freely? As shown in Fig. 5.14(a), $V_{b}$ could be low enough\n\n**Image Descriptions**\n\n- **Figure 5.14 (a)**: Cascode current source with minimum headroom voltage.\n- **Figure 5.14 (b)**: Headroom consumed by a cascode mirror.\n\nsuch that the minimum allowable voltage at $P$ is merely two overdrive voltages. Thus, the cascode mirror in Fig. 5.12(c) \"squanders\" one threshold voltage in the headroom. This occurs because $V_{D S 2}=V_{G S 2}$, whereas $V_{D S 2}$ could be as low as $V_{G S 2}-V_{T H}$ while keeping $M_{2}$ in saturation.\n\n**Large-Signal Behavior of Cascode Current Source**\n\nBefore resolving this issue, it is beneficial to scrutinize the large-signal behavior of a cascode current source.\n\n**Example 5.4**\n\nIn Fig. 5.15(a), assuming all transistors are identical, sketch $I_{X}$ and $V_{B}$ as $V_{X}$ decreases from a high positive value.\n\n**Image Descriptions**\n\n- **Figure 5.15(a)**: Cascode current source with NMOS transistors.\n- **Figure 5.15(b)**: Voltage transfer characteristic graph showing $V_B$ versus $V_X$.\n- **Figure 5.15(c)**: Plot depicting the behavior of current $I_X$ as a function of voltage $V_X$.\n\n**Solution**\n\nFor $V_{X} \\geq V_{N}-V_{T H}$, both $M_{2}$ and $M_{3}$ are in saturation, $I_{X}=I_{R E F}$ and $V_{B}=V_{A}$. As $V_{X}$ diminishes, which transistor enters the triode region first, $M_{3}$ or $M_{2}$? Suppose $M_{2}$ enters the triode region before $M_{3}$. For this to happen, $V_{D S 2}$ must fall, and since $V_{G S 2}$ is constant, so must $I_{D 2}$. This implies that $V_{G S 3}$ increases while $I_{D 3}$ decreases, which is not feasible if $M_{3}$ remains in saturation. Hence, $M_{3}$ enters the triode region first.\n\nAs $V_{X}$ falls below $V_{N}-V_{T H}$, $M_{3}$ enters the triode region, necessitating a greater gate-source overdrive to maintain the same current. Thus, as shown in Fig. 5.15(b), $V_{B}$ starts to decrease, causing $I_{D 2}$ and thereby $I_{X}$ to slightly decrease. As $V_{X}$ and $V_{B}$ continue to decrease, eventually we reach $V_{B}<V_{A}-V_{T H}$, and $M_{2}$ enters the triode region. At this point, $I_{D 2}$ begins to sharply decline. For $V_{X}=0$, $I_{X}=0$, and both $M_{2}$ and $M_{3}$ operate in the deep triode region. Note that as $V_{X}$ drops below $V_{N}-V_{T H 3}$, the output impedance of the cascode significantly drops because $g_{m 3}$ deteriorates in the triode region.\n\n**Second Approach**\n\nTo eliminate\nAvoid\nIn our prior of current mirrors up to this point, we've overlooked the impact of channel-length modulation. In actual applications, this effect can lead to significant inaccuracies in current replication, particularly when employing transistors with the shortest possible channel lengths to reduce the width and, consequently\nIn our examination of current mirrors thus far, we have not considered the influence of channel-length modulation. In real-world applications, this effect can cause considerable deviations in current replication, especially when using transistors with the shortest possible channel lengths to decrease the width and hence the output capacitance of the current source. For the simple mirror configuration depicted in Fig. 5.5(b), we can express the following equations:\n\n$$\n\\begin{align*}\nI_{D 1} & =\\frac{1}{2} \\mu_{n} C_{o x}\\left(\\frac{W}{L}\\right)_{1}\\left(V_{G S}-V_{T H}\\right)^{2}\\left(1+\\lambda V_{D S 1}\\right)  \\tag{5.5}\\\\\nI_{D 2} & =\\frac{1}{2} \\mu_{n} C_{o x}\\left(\\frac{W}{L}\\right)_{2}\\left(V_{G S}-V_{T H}\\right)^{2}\\left(1+\\lambda V_{D S 2}\\right) \\tag{5.6}\n\\end{align*}\n$$\n\nThus,\n\n$$\n\\begin{equation*}\n\\frac{I_{D 2}}{I_{D 1}}=\\frac{(W / L)_{2}}{(W / L)_{1}} \\cdot \\frac{1+\\lambda V_{D S 2}}{1+\\lambda V_{D S 1}} \\tag{5.7}\n\\end{equation*}\n$$\n\nIt's crucial to understand that while $V_{D S 1}=V_{G S 1}=V_{G S 2}$, $V_{D S 2}$ may not necessarily equal $V_{G S 2}$ due to the circuit connected to $M_{2}$. For example, in Fig. 5.8, the voltage at node $P$ is determined by the input common-mode level and the gate-source voltages of $M_{1}$ and $M_{2}$, and it may not be equal to $V_{X}$.\n\nTo counteract the effect of channel-length modulation in the configuration of Fig. 5.5(b), we can either (1) ensure $V_{D S 2}$ is equal to $V_{D S 1}$, or (2) make $V_{D S 1}$ equal to $V_{D S 2}$. These two strategies lead to two distinct circuit topologies.\n\n**First Strategy**\n\nWe start with the first strategy, aiming to keep $V_{D S 2}$ in Fig. 5.5(b) constant and equal to $V_{D S 1}$. Recollect from Chapter 3 that a cascode configuration can shield a current source, thereby reducing voltage fluctuations across it. As demonstrated in Fig. 5.12(a), even with significant variations in $V_{P}$ within the analog circuit, $V_{Y}$ remains fairly stable. The challenge is to ensure that $V_{D S 2}=V_{D S 1}$. We must generate $V_{b}$ such that $V_{b}-V_{G S 3}=V_{D S 1}\\left(=V_{G S 1}\\right)$, implying $V_{b}=V_{G S 3}+V_{G S 1}$. In essence, $V_{b}$ can be established by two diode-connected devices in series [Fig. 5.12(b)], provided $V_{G S 0}+V_{G S 1}=V_{G S 3}+V_{G S 1}$, hence $V_{G S 0}=V_{G S 3}$. We then connect the $V_{b}$ generator from Fig. 5.12(b) to the cascode current source, as depicted in Fig. 5.12(c). This arrangement permits precise current copying, even when body effect is present (why?).\n\n**Image Descriptions**\n\n- **Figure 5.12(a)**: Cascode current source.\n- **Figure 5.12(b)**: Modification of mirror circuit to generate the cascode bias voltage.\n- **Figure 5.12(c)**: Cascode current mirror.\n\n**Additional Notes on Transistor Sizing**\n\nWhen designing the transistors in Fig. 5.12(c), we typically set $L_{2}=L_{1}$ and adjust $W_{2}$ (in integer multiples) relative to $W_{1}$ to achieve the desired multiple of $I_{R E F}$. Similarly, for $V_{G S 3}$ to match $V_{G S 0}$, we choose $L_{3}=L_{0}$ and scale $W_{3}$ relative to $W_{0}$ by the same factor, i.e., $W_{3} / W_{0}=W_{2} / W_{1}$. In practical applications, $L_{3}$ and $L_{0}$ are set to the minimum allowable value to reduce their width, whereas $L_{1}$ and $L_{2}$ might be longer in certain scenarios.\n\n**Example 5.3**\n\nRefer to Fig. 5.13 and sketch $V_{X}$ and $V_{Y}$ as functions of $I_{R E F}$. If $I_{R E F}$ necessitates 0.5 V to function as a current source, what is its maximum value?\n\n**Solution**\n\nGiven that $M_{2}$ and $M_{3}$ are appropriately proportioned relative to $M_{1}$ and $M_{0}$, we obtain $V_{Y}=V_{X} \\approx \\sqrt{2 I_{R E F} /\\left[\\mu_{n} C_{o x}(W / L)_{1}\\right]}+$ $V_{T H 1}$. This behavior is depicted in Fig. 5.13(b).\n\nTo determine the maximum value of $I_{R E F}$, we consider that\n\n$$\n\\begin{align*}\nV_{N} & =V_{G S 0}+V_{G S 1}  \\tag{5"
},
{
    "text": "As previously mentioned and illustrated by the circuit in Fig. 5.11, current mirrors can function as signal processors, effectively serving as \"active\" components. A particularly beneficial configuration is the mirror topology used alongside differential pairs, which we examine in this section. Fig. 5.22 depicts this topology, often referred to as a five-transistor \"operational transconductance amplifier\" (OTA), widely applied in both analog and digital systems, warranting a thorough analysis. Note that the output is single-ended, making this circuit useful for converting differential signals to a single-ended output. We begin by analyzing a simpler topology with a passive load before delving into the OTA.\n\n### Differential Pair with Passive Load\nTo derive a single-ended output, one can simply disregard one output of a differential pair, as shown in Fig. 5.23(a). Here, a current source in a \"passive\" mirror arrangement acts as the load. What is the small-signal gain, $A_{v}=V_{\\text {out }}/V_{\\text {in }}$, of this circuit? We\nimage_name:Figure 5.22\ndescription:\n[\nname: M1, type: NMOS, ports: {S: P, D: X, G: Vin1}\nname: M2, type: NMOS, ports: {S: P, D: Vout, G: Vin2}\nname: M3, type: PMOS, ports: {S: VDD, D: X, G: X}\nname: M4, type: PMOS, ports: {S: VDD, D: Vout, G: X}\nname: I1, type: CurrentSource, value: I1, ports: {Np: P, Nn: GND}\n]\nextrainfo:The circuit is a five-transistor operational transconductance amplifier (OTA). The differential pair M1 and M2 are loaded by a current mirror formed by M3 and M4. The circuit is used for converting differential input signals to a single-ended output.\nimage_name:(a)\ndescription:The circuit diagram (a) represents a differential pair with a current-source load. The NMOS transistors M1 and M2 form the differential pair, while PMOS transistors M3 and M4 serve as the current-source load. The current sources I1 and Iss provide biasing. The output is taken from the drain of M4, labeled as Vout. Resistors ro4, Rout, ro2, and ro1 are used to model various resistances in the circuit.\nimage_name:(b)\ndescription:The circuit (b) is a differential pair with a current-source load. It features NMOS transistors M1 and M2, and PMOS transistors M3 and M4. Current sources I1 and Iss provide biasing. The output is taken at Vout. Resistors ro4, Rout, ro2, and ro1 are part of the load and biasing network.\nimage_name:(c)\ndescription:The circuit diagram (c) represents a differential pair with a current-source load. It includes an NMOS transistor M2 with its source connected to node s2, drain to Vout, and gate to Vb. Resistors ro4 and Rout are connected between VDD and Vout, and Vout and GND respectively. Resistors ro2 and ro1 connect Vb and s2 to GND.\n\nFigure 5.23 (a) Differential pair with current-source load; (b) circuit for calculation of $G_{m}$; (c) circuit for calculation of $R_{\\text {out }}$.\ncalculate $A_{v}$ using two distinct methods, assuming $\\gamma=0$ for simplicity. Due to asymmetry, the half-circuit concept cannot be directly applied.\n\nBy expressing $\\left|A_{v}\\right|=G_{m} R_{\\text {out }}$, we need to determine the short-circuit transconductance, $G_{m}$, and the output resistance, $R_{\\text {out }}$. From Fig. 5.23(b), we observe that $M_{1}$ and $M_{2}$ become symmetric when the output is shorted to ac ground, leading to $G_{m}=I_{\\text {out }}/V_{\\text {in }}=\\left(g_{m 1} V_{\\text {in }}/2\\right)/V_{\\text {in }}=g_{m 1}/2$. As shown in Fig. 5.23(c), for the $R_{\\text {out }}$ calculation, $M_{2}$ is degenerated by the source output impedance of $M_{1}, R_{\\text {deg}}=\\left(1/g_{m 1}\\right) \\| r_{O 1}$, resulting in an output impedance of $\\left(1+g_{m 2} r_{O 2}\\right) R_{\\text {deg}}+r_{O 2} \\approx 2 r_{O 2}$. Consequently, $R_{\\text {out }}=\\left(2 r_{O 2}\\right) \\| r_{O 4}$, and\n\n$$\n\\begin{equation*}\n\\left|A_{v}\\right|=\\frac{g_{m 1}}{2}\\left[\\left(2 r_{O 2}\\right) \\| r_{O 4}\\right] \\tag{5.20}\n\\end{equation*}\n$$\n\nNotably, if $r_{O 4} \\rightarrow \\infty$, then $A_{v} \\rightarrow -g_{m 1} r_{O 2}$.\nIn our second approach, we compute $V_{P}/V_{\\text {in }}$ and $V_{\\text {out }}/V_{P}$ in Fig. 5.23(a) and multiply the results to obtain $V_{\\text {out }}/V_{\\text {in }}$. With the help of Fig. 5.24 and considering $M_{1}$ as a source follower, we write\n\n$$\n\\begin{equation*}\n\\frac{V_{P}}{V_{\\text {in }}}=\\frac{R_{\\text {eq}} \\| r_{O 1}}{R_{\\text {eq}} \\| r_{O 1}+\\frac{1}{g_{m 1}}} \\tag{5.21}\n\\end{equation*}\n$$\n\nimage_name:Figure 5.24\ndescription:\n[\nname: M1, type: NMOS, ports: {S: P, D: VDD, G: Vin}\nname: M2, type: NMOS, ports: {S: P, D: Vout, G: GND}\nname: ro4, type: Resistor, value: ro4, ports: {N1: VDD, N2: Vout}\nname: Iss, type: CurrentSource, value: Iss, ports: {Np: P, Nn: GND}\n]\nextrainfo:The circuit is designed to calculate the voltage gain Vout/Vin using a source follower configuration with NMOS transistors M1 and M2. The circuit includes a current source Iss and resistors ro4, with the output taken across ro4.\n\nFigure 5.24 Circuit for calculation of $V_{P}/V_{\\text {in }}$.\nwhere $R_{\\text {eq}}$ represents the resistance seen looking into the source of $M_{2}$. Since the drain of $M_{2}$ is terminated by a relatively large resistance, $r_{O 4}$, the value of $R_{\\text {eq}}$ must be derived from Eq. (3.117):\n\n$$\n\\begin{equation*}\nR_{\\text {eq}}=\\frac{r_{O 2}+r_{O 4}}{1+g_{m 2} r_{O 2}} \\tag{5.22}\n\\end{equation*}\n$$\n\nThus,\n\n$$\n\\begin{equation*}\n\\frac{V_{P}}{V_{\\text {in }}}=\\frac{g_{m 1} r_{O 1}\\left(r_{O 2}+r_{O 4}\\right)}{\\left(1+g_{m 1} r_{O 1}\\right)\\left(r_{O 2}+r_{O 4}\\right)+\\left(1+g_{m 2} r_{O 2}\\right) r_{O 1}} \\tag{5.23}\n\\end{equation*}\n$$\n\nNext, we calculate $V_{\\text {out }}/V_{P}$. From Fig. 5.25,\n\n$$\n\\begin{equation*}\n\\frac{V_{\\text {out }}}{V_{P}}=\\frac{\\left(1+g_{m 2} r_{O 2}\\right) r_{O 4}}{r_{O 2}+r_{O 4}} \\tag{5.24}\n\\end{equation*}\n$$\n\nimage_name:Figure 5.25 Circuit for calculation of $V_{\\text {out }}/V_{P}$.\ndescription:\n[\nname: ro4, type: Resistor, value: ro4, ports: {N1: VDD, N2: Vout}\nname: ro2, type: Resistor, value: ro2, ports: {N1: Vout, N2: Vp}\nname: M2, type: NMOS, ports: {S: Vp, D: Vout, G: Vb}\nname: Vp, type: VoltageSource, value: Vp, ports: {Np: Vp, Nn: GND}\n]\nextrainfo:The circuit is a differential amplifier with an active load, using NMOS transistor M2 and resistors ro2 and ro4. The output voltage Vout is taken from the drain of M2. Vp is the input voltage source.\n\nFrom (5.23) and (5.24), we obtain\n\n$$\n\\begin{align*}\n\\frac{V_{\\text {out }}}{V_{\\text {in }}} & =\\frac{g_{m 2} r_{O 2} r_{O 4}}{2 r_{O 2}+r_{O 4}} \\tag{5.25}\\\\\n& =\\frac{g_{m 2}}{2}\\left[\\left(2 r_{O 2}\\right) \\| r_{O 4}\\right] \\tag{5.26}\n\\end{align*}\n$$\n\n### Differential Pair with Active Load\nIn the circuit of Fig. 5.23(a), the small-signal drain current of $M_{1}$ is \"wasted.\" As conceptually shown in Fig. 5.26(a), it is advantageous to utilize this current with proper polarity at the output. This can be achieved by the five-transistor OTA depicted in Fig. 5.26(b), where $M_{3}$ and $M_{4}$ are identical and function as an active current mirror.\nimage_name:(a)\ndescription:The circuit is a differential pair with an active load. M3 and M4 form an active current mirror to enhance the gain. The input nodes are Vip and Vin, and the output node is Vout. The current source Iss provides biasing.\nimage_name:(b)\ndescription:The circuit is a five-transistor operational transconductance amplifier (OTA) with a differential pair (M1 and M2) and an active load (M3 and M4). The current source Iss provides biasing. The differential input is applied to M1 and M2, and the output is taken at Vout. M3 and M4 form a current mirror to enhance gain.\nimage_name:(c)\ndescription:The circuit is a differential pair with an active load, utilizing a five-transistor operational transconductance amplifier (OTA) configuration. The NMOS transistors M1 and M2 form the differential pair, while PMOS transistors M3 and M4 act as a current mirror load, enhancing the gain by combining the drain currents of M1 and M2.\n\nFigure 5.26 (a) Concept of combining the drain currents of $M_{1}$ and $M_{2}$, (b) realization of (a), and (c) response of the circuit to differential inputs.\n\nTo understand how $M_{3}$ boosts the gain, consider the scenario where the gate voltages of $M_{1}$ and $M_{2}$ change by equal and opposite amounts [Fig. 5.26(c)]. Consequently, $I_{D 1}$ increases, $V_{F}$ decreases, and $I_{D 2}$ decreases. Thus, the output voltage increases through two mechanisms: $M_{2}$ draws less current from $X$ to ground, and $M_{4}$ pushes more current from $V_{D D}$ to $X$. In contrast, in the circuit of Fig. 5.23(a), $M_{4}$ plays no active role in altering $V_{\\text {out }}$ because its gate voltage remains constant. The five-transistor OTA is also known as a differential pair with an active load."
},
{
    "text": "As previously mentioned and illustrated by the circuit in Fig. 5.11, current mirrors can function as signal processors, acting as \"active\" components. A particularly beneficial mirror topology is used alongside differential pairs, which we examine in this section. Fig. 5.22 depicts this topology, often referred to as a five-transistor \"operational transconductance amplifier\" (OTA), widely applied in both analog and digital systems, warranting a detailed exploration here. Note that the output is single-ended, making this circuit suitable for converting differential signals to a single-ended output. We begin by analyzing a simpler topology with a passive load before delving into the OTA.\n\n**Differential Pair with Passive Load**\nTo obtain a single-ended output, one output of a differential pair can be disregarded, as shown in Fig. 5.23(a). Here, a current source in a \"passive\" mirror configuration serves as the load. What is the small-signal gain, $A_{v}=V_{\\text{out}} / V_{\\text{in}}$, of this circuit? We\nimage_name:Figure 5.22\ndescription:\n[\nname: M1, type: NMOS, ports: {S: P, D: X, G: Vin1}\nname: M2, type: NMOS, ports: {S: P, D: Vout, G: Vin2}\nname: M3, type: PMOS, ports: {S: VDD, D: X, G: X}\nname: M4, type: PMOS, ports: {S: VDD, D: Vout, G: X}\nname: I1, type: CurrentSource, value: I1, ports: {Np: P, Nn: GND}\n]\nextrainfo:The circuit is a five-transistor operational transconductance amplifier (OTA). The differential pair M1 and M2 are loaded by a current mirror formed by M3 and M4. The circuit is used for converting differential input signals to a single-ended output.\nimage_name:(a)\ndescription:The circuit diagram (a) represents a differential pair with a current-source load. The NMOS transistors M1 and M2 form the differential pair, while PMOS transistors M3 and M4 serve as the current-source load. The current sources I1 and Iss provide biasing. The output is taken from the drain of M4, labeled as Vout. Resistors ro4, Rout, ro2, and ro1 are used to model various resistances in the circuit.\nimage_name:(b)\ndescription:The circuit (b) is a differential pair with a current-source load. It features NMOS transistors M1 and M2, and PMOS transistors M3 and M4. Current sources I1 and Iss provide biasing. The output is taken at Vout. Resistors ro4, Rout, ro2, and ro1 are part of the load and biasing network.\nimage_name:(c)\ndescription:The circuit diagram (c) represents a differential pair with a current-source load. It includes an NMOS transistor M2 with its source connected to node s2, drain to Vout, and gate to Vb. Resistors ro4 and Rout are connected between VDD and Vout, and Vout and GND respectively. Resistors ro2 and ro1 connect Vb and s2 to GND.\n\nFigure 5.23 (a) Differential pair with current-source load; (b) circuit for calculation of $G_{m}$; (c) circuit for calculation of $R_{\\text{out}}$.\ncalculate $A_{v}$ using two different approaches, assuming $\\gamma=0$ for simplicity. Due to asymmetry, the half-circuit concept cannot be directly applied here.\n\nBy expressing $\\left|A_{v}\\right|=G_{m} R_{\\text{out}}$, we need to compute the short-circuit transconductance, $G_{m}$, and the output resistance, $R_{\\text{out}}$. From Fig. 5.23(b), we observe that M1 and M2 become symmetric when the output is shorted to ac ground. Thus, $G_{m}=I_{\\text{out}} / V_{\\text{in}}=\\left(g_{m1} V_{\\text{in}} / 2\\right) / V_{\\text{in}}=g_{m1} / 2$. As shown in Fig. 5.23(c), for the $R_{\\text{out}}$ calculation, M2 is degenerated by the source output impedance of M1, $R_{\\text{deg}}=\\left(1 / g_{m1}\\right) \\| r_{O1}$, resulting in an output impedance of $\\left(1+g_{m2} r_{O2}\\right) R_{\\text{deg}}+r_{O2} \\approx 2 r_{O2}$. Consequently, $R_{\\text{out}}=\\left(2 r_{O2}\\right) \\| r_{O4}$, and\n\n$$\n\\begin{equation*}\n\\left|A_{v}\\right|=\\frac{g_{m1}}{2}\\left[\\left(2 r_{O2}\\right) \\| r_{O4}\\right] \\tag{5.20}\n\\end{equation*}\n$$\n\nInterestingly, if $r_{O4} \\rightarrow \\infty$, then $A_{v} \\rightarrow -g_{m1} r_{O2}$.\nIn our second approach, we calculate $V_{P} / V_{\\text{in}}$ and $V_{\\text{out}} / V_{P}$ in Fig. 5.23(a) and multiply the results to obtain $V_{\\text{out}} / V_{\\text{in}}$. With the help of Fig. 5.24 and viewing M1 as a source follower, we write\n\n$$\n\\begin{equation*}\n\\frac{V_{P}}{V_{\\text{in}}}=\\frac{R_{\\text{eq}} \\| r_{O1}}{R_{\\text{eq}} \\| r_{O1}+\\frac{1}{g_{m1}}} \\tag{5.21}\n\\end{equation*}\n$$\n\nimage_name:Figure 5.24\ndescription:\n[\nname: M1, type: NMOS, ports: {S: P, D: VDD, G: Vin}\nname: M2, type: NMOS, ports: {S: P, D: Vout, G: GND}\nname: ro4, type: Resistor, value: ro4, ports: {N1: VDD, N2: Vout}\nname: Iss, type: CurrentSource, value: Iss, ports: {Np: P, Nn: GND}\n]\nextrainfo:The circuit is designed to calculate the voltage gain Vout/Vin using a source follower configuration with NMOS transistors M1 and M2. The circuit includes a current source Iss and resistors ro4, with the output taken across ro4.\n\nFigure 5.24 Circuit for calculation of $V_{P} / V_{\\text{in}}$.\nwhere $R_{\\text{eq}}$ represents the resistance seen looking into the source of M2. Since the drain of M2 is terminated by a relatively large resistance, $r_{O4}$, the value of $R_{\\text{eq}}$ must be derived from Eq. (3.117):\n\n$$\n\\begin{equation*}\nR_{\\text{eq}}=\\frac{r_{O2}+r_{O4}}{1+g_{m2} r_{O2}} \\tag{5.22}\n\\end{equation*}\n$$\n\nIt follows that\n\n$$\n\\begin{equation*}\n\\frac{V_{P}}{V_{\\text{in}}}=\\frac{g_{m1} r_{O1}\\left(r_{O2}+r_{O4}\\right)}{\\left(1+g_{m1} r_{O1}\\right)\\left(r_{O2}+r_{O4}\\right)+\\left(1+g_{m2} r_{O2}\\right) r_{O1}} \\tag{5.23}\n\\end{equation*}\n$$\n\nWe now calculate $V_{\\text{out}} / V_{P}$. From Fig. 5.25,\n\n$$\n\\begin{equation*}\n\\frac{V_{\\text{out}}}{V_{P}}=\\frac{\\left(1+g_{m2} r_{O2}\\right) r_{O4}}{r_{O2}+r_{O4}} \\tag{5.24}\n\\end{equation*}\n$$\n\nimage_name:Figure 5.25 Circuit for calculation of $V_{\\text{out}} / V_{P}$.\ndescription:\n[\nname: ro4, type: Resistor, value: ro4, ports: {N1: VDD, N2: Vout}\nname: ro2, type: Resistor, value: ro2, ports: {N1: Vout, N2: Vp}\nname: M2, type: NMOS, ports: {S: Vp, D: Vout, G: Vb}\nname: Vp, type: VoltageSource, value: Vp, ports: {Np: Vp, Nn: GND}\n]\nextrainfo:The circuit is a differential amplifier with an active load, using NMOS transistor M2 and resistors ro2 and ro4. The output voltage Vout is taken from the drain of M2. Vp is the input voltage source.\n\nFrom (5.23) and (5.24), we have\n\n$$\n\\begin{align*}\n\\frac{V_{\\text{out}}}{V_{\\text{in}}} & =\\frac{g_{m2} r_{O2} r_{O4}}{2 r_{O2}+r_{O4}} \\tag{5.25}\\\\\n& =\\frac{g_{m2}}{2}\\left[\\left(2 r_{O2}\\right) \\| r_{O4}\\right] \\tag{5.26}\n\\end{align*}\n$$\n\n**Differential Pair with Active Load**\nIn the circuit of Fig. 5.23(a), the small-signal drain current of M1 is \"wasted.\" As conceptually illustrated in Fig. 5.26(a), it is desirable to utilize this current with proper polarity at the output. This can be achieved by the five-transistor OTA shown in Fig. 5.26(b), where M3 and M4 are identical and operate as an active current mirror.\nimage_name:(a)\ndescription:The circuit is a differential pair with an active load. M3 and M4 form an active current mirror to enhance the gain. The input nodes are Vip and Vin, and the output node is Vout. The current source Iss provides biasing.\nimage_name:(b)\ndescription:The circuit is a five-transistor operational transconductance amplifier (OTA) with a differential pair (M1 and M2) and an active load (M3 and M4). The current source Iss provides biasing. The differential input is applied to M1 and M2, and the output is taken at Vout. M3 and M4 form a current mirror to enhance gain.\nimage_name:(c)\ndescription:The circuit is a differential pair with an active load, utilizing a five-transistor operational transconductance amplifier (OTA) configuration. The NMOS transistors M1 and M2 form the differential pair, while PMOS transistors M3 and M4 act as a current mirror load, enhancing the gain by combining the drain currents of M1 and M2.\n\nFigure 5.26 (a) Concept of combining the drain currents of M1 and M2, (b) realization of (a), and (c) response of the circuit to differential inputs.\n\nTo understand how M3 enhances the gain, suppose the gate voltages of M1 and M2 change by equal and opposite amounts [Fig. 5.26(c)]. Consequently, $I_{D1}$ increases, $V_{F}$ falls, and $I_{D2}$ decreases. Thus, the output voltage rises through two mechanisms: M2 draws less current from X to ground, and M4 pushes more current from VDD to X. In contrast, in the circuit of Fig. 5.23(a), M4 plays no active role in changing $V_{\\text{out}}$ because its gate voltage is constant. The five-transistor OTA is also known as a differential pair with an active load."
},
{
    "text": "As previously mentioned and illustrated by the circuit in Fig. 5.11, current mirrors can also function as signal processors, acting as \"active\" elements. A particularly beneficial mirror topology is used alongside differential pairs, which we examine in this section. Displayed in Fig. 5.22 and often referred to as a five-transistor \"operational transconductance amplifier\" (OTA), this configuration is widely applied in both analog and digital systems, warranting a detailed exploration. Note that the output is single-ended, making the circuit suitable for converting differential signals to a single-ended output. We first analyze a simpler topology with a passive load before delving into the OTA.\n\n**Differential Pair with Passive Load**\nTo produce a single-ended output, one output of a differential pair can be disregarded, as shown in Fig. 5.23(a). Here, a current source in a \"passive\" mirror arrangement serves as the load. What is the small-signal gain, $A_{v}=V_{\\text{out}} / V_{\\text{in}}$, of this circuit? We\nimage_name:Figure 5.22\ndescription:\n[\nname: M1, type: NMOS, ports: {S: P, D: X, G: Vin1}\nname: M2, type: NMOS, ports: {S: P, D: Vout, G: Vin2}\nname: M3, type: PMOS, ports: {S: VDD, D: X, G: X}\nname: M4, type: PMOS, ports: {S: VDD, D: Vout, G: X}\nname: I1, type: CurrentSource, value: I1, ports: {Np: P, Nn: GND}\n]\nextrainfo:The circuit is a five-transistor operational transconductance amplifier (OTA). The differential pair M1 and M2 are loaded by a current mirror formed by M3 and M4. The circuit is used for converting differential input signals to a single-ended output.\nimage_name:(a)\ndescription:The circuit diagram (a) depicts a differential pair with a current-source load. NMOS transistors M1 and M2 form the differential pair, while PMOS transistors M3 and M4 act as the current-source load. Current sources I1 and Iss provide biasing. The output is taken from the drain of M4, labeled as Vout. Resistors ro4, Rout, ro2, and ro1 model various resistances in the circuit.\nimage_name:(b)\ndescription:The circuit (b) is a differential pair with a current-source load, featuring NMOS transistors M1 and M2, and PMOS transistors M3 and M4. Current sources I1 and Iss provide biasing. The output is taken at Vout. Resistors ro4, Rout, ro2, and ro1 are part of the load and biasing network.\nimage_name:(c)\ndescription:The circuit diagram (c) shows a differential pair with a current-source load. It includes an NMOS transistor M2 with its source connected to node s2, drain to Vout, and gate to Vb. Resistors ro4 and Rout are connected between VDD and Vout, and Vout and GND respectively. Resistors ro2 and ro1 connect Vb and s2 to GND.\n\nFigure 5.23 (a) Differential pair with current-source load; (b) circuit for calculation of $G_{m}$; (c) circuit for calculation of $R_{\\text{out}}$.\ncalculate $A_{v}$ using two different methods, assuming $\\gamma=0$ for simplicity. Due to asymmetry, the half-circuit concept cannot be directly applied.\n\nBy writing $\\left|A_{v}\\right|=G_{m} R_{\\text{out}}$, we need to compute the short-circuit transconductance, $G_{m}$, and the output resistance, $R_{\\text{out}}$. From Fig. 5.23(b), we observe that $M_{1}$ and $M_{2}$ become symmetric when the output is shorted to ac ground. Thus, $G_{m}=I_{\\text{out}} / V_{\\text{in}}=\\left(g_{m1} V_{\\text{in}} / 2\\right) / V_{\\text{in}}=g_{m1} / 2$. As shown in Fig. 5.23(c), for the $R_{\\text{out}}$ calculation, $M_{2}$ is degenerated by the source output impedance of $M_{1}, R_{\\text{deg}}=\\left(1 / g_{m1}\\right) \\| r_{O1}$, resulting in an output impedance of $\\left(1+g_{m2} r_{O2}\\right) R_{\\text{deg}}+r_{O2} \\approx 2 r_{O2}$. Therefore, $R_{\\text{out}}=\\left(2 r_{O2}\\right) \\| r_{O4}$, and\n\n$$\n\\begin{equation*}\n\\left|A_{v}\\right|=\\frac{g_{m1}}{2}\\left[\\left(2 r_{O2}\\right) \\| r_{O4}\\right] \\tag{5.20}\n\\end{equation*}\n$$\n\nInterestingly, if $r_{O4} \\rightarrow \\infty$, then $A_{v} \\rightarrow -g_{m1} r_{O2}$.\nIn our second approach, we calculate $V_{P} / V_{\\text{in}}$ and $V_{\\text{out}} / V_{P}$ in Fig. 5.23(a) and multiply the results to obtain $V_{\\text{out}} / V_{\\text{in}}$. With the help of Fig. 5.24 and viewing $M_{1}$ as a source follower, we write\n\n$$\n\\begin{equation*}\n\\frac{V_{P}}{V_{\\text{in}}}=\\frac{R_{\\text{eq}} \\| r_{O1}}{R_{\\text{eq}} \\| r_{O1}+\\frac{1}{g_{m1}}} \\tag{5.21}\n\\end{equation*}\n$$\n\nimage_name:Figure 5.24\ndescription:\n[\nname: M1, type: NMOS, ports: {S: P, D: VDD, G: Vin}\nname: M2, type: NMOS, ports: {S: P, D: Vout, G: GND}\nname: ro4, type: Resistor, value: ro4, ports: {N1: VDD, N2: Vout}\nname: Iss, type: CurrentSource, value: Iss, ports: {Np: P, Nn: GND}\n]\nextrainfo:The circuit is designed to calculate the voltage gain Vout/Vin using a source follower configuration with NMOS transistors M1 and M2. The circuit includes a current source Iss and resistors ro4, with the output taken across ro4.\n\nFigure 5.24 Circuit for calculation of $V_{P} / V_{\\text{in}}$.\nwhere $R_{\\text{eq}}$ denotes the resistance seen looking into the source of $M_{2}$. Since the drain of $M_{2}$ is terminated by a relatively large resistance, $r_{O4}$, the value of $R_{\\text{eq}}$ must be obtained from Eq. (3.117):\n\n$$\n\\begin{equation*}\nR_{\\text{eq}}=\\frac{r_{O2}+r_{O4}}{1+g_{m2} r_{O2}} \\tag{5.22}\n\\end{equation*}\n$$\n\nIt follows that\n\n$$\n\\begin{equation*}\n\\frac{V_{P}}{V_{\\text{in}}}=\\frac{g_{m1} r_{O1}\\left(r_{O2}+r_{O4}\\right)}{\\left(1+g_{m1} r_{O1}\\right)\\left(r_{O2}+r_{O4}\\right)+\\left(1+g_{m2} r_{O2}\\right) r_{O1}} \\tag{5.23}\n\\end{equation*}\n$$\n\nWe now calculate $V_{\\text{out}} / V_{P}$. From Fig. 5.25,\n\n$$\n\\begin{equation*}\n\\frac{V_{\\text{out}}}{V_{P}}=\\frac{\\left(1+g_{m2} r_{O2}\\right) r_{O4}}{r_{O2}+r_{O4}} \\tag{5.24}\n\\end{equation*}\n$$\n\nimage_name:Figure 5.25 Circuit for calculation of $V_{\\text{out}} / V_{P}$.\ndescription:\n[\nname: ro4, type: Resistor, value: ro4, ports: {N1: VDD, N2: Vout}\nname: ro2, type: Resistor, value: ro2, ports: {N1: Vout, N2: Vp}\nname: M2, type: NMOS, ports: {S: Vp, D: Vout, G: Vb}\nname: Vp, type: VoltageSource, value: Vp, ports: {Np: Vp, Nn: GND}\n]\nextrainfo:The circuit is a differential amplifier with an active load, using NMOS transistor M2 and resistors ro2 and ro4. The output voltage Vout is taken from the drain of M2. Vp is the input voltage source.\n\nFrom (5.23) and (5.24), we have\n\n$$\n\\begin{align*}\n\\frac{V_{\\text{out}}}{V_{\\text{in}}} & =\\frac{g_{m2} r_{O2} r_{O4}}{2 r_{O2}+r_{O4}} \\tag{5.25}\\\\\n& =\\frac{g_{m2}}{2}\\left[\\left(2 r_{O2}\\right) \\| r_{O4}\\right] \\tag{5.26}\n\\end{align*}\n$$\n\n**Differential Pair with Active Load**\nIn the circuit of Fig. 5.23(a), the small-signal drain current of $M_{1}$ is \"wasted.\" As conceptually illustrated in Fig. 5.26(a), it is desirable to utilize this current with proper polarity at the output. This can be achieved by the five-transistor OTA shown in Fig. 5.26(b), where $M_{3}$ and $M_{4}$ are identical and operate as an active current mirror.\nimage_name:(a)\ndescription:The circuit illustrates a differential pair with an active load. M3 and M4 form an active current mirror to enhance the gain. The input nodes are Vip and Vin, and the output node is Vout. The current source Iss provides biasing.\nimage_name:(b)\ndescription:The circuit is a five-transistor operational transconductance amplifier (OTA) with a differential pair (M1 and M2) and an active load (M3 and M4). The current source Iss provides biasing. The differential input is applied to M1 and M2, and the output is taken at Vout. M3 and M4 form a current mirror to enhance gain.\nimage_name:(c)\ndescription:The circuit is a differential pair with an active load, utilizing a five-transistor operational transconductance amplifier (OTA) configuration. The NMOS transistors M1 and M2 form the differential pair, while PMOS transistors M3 and M4 act as a current mirror load, enhancing the gain by combining the drain currents of M1 and M2.\n\nFigure 5.26 (a) Concept of combining the drain currents of $M_{1}$ and $M_{2}$, (b) realization of (a), and (c) response of the circuit to differential inputs.\n\nTo understand how $M_{3}$ enhances the gain, suppose the gate voltages of $M_{1}$ and $M_{2}$ change by equal and opposite amounts [Fig. 5.26(c)]. Consequently, $I_{D1}$ increases, $V_{F}$ decreases, and $I_{D2}$ decreases. Thus, the output voltage rises through two mechanisms: $M_{2}$ draws less current from $X$ to ground and $M_{4}$ pushes more current from $V_{DD}$ to $X$. In contrast, in the circuit of Fig. 5.23(a), $M_{4}$ plays no active role in changing $V_{\\text{out}}$ because its gate voltage is constant. The five-transistor OTA is also known as a differential pair with an active load."
},
{
    "text": "As previously mentioned and illustrated by the circuit in Fig. 5.11, current mirrors can function as signal processors, acting as \"active\" components. A particularly beneficial mirror topology is used alongside differential pairs, which we explore in this section. Depicted in Fig. 5.22 and often referred to as a five-transistor \"operational transconductance amplifier\" (OTA), this configuration is widely employed in both analog and digital systems, warranting a detailed examination. Note that the output is single-ended, making the circuit suitable for converting differential signals to a single-ended output. We begin by analyzing a simpler topology with a passive load before delving into the OTA.\n\n**Differential Pair with Passive Load**\nTo obtain a single-ended output, one output of a differential pair can be disregarded, as shown in Fig. 5.23(a). Here, a current source in a \"passive\" mirror setup serves as the load. What is the small-signal gain, $A_{v}=V_{\\text{out}} / V_{\\text{in}}$, of this circuit? We\nimage_name:Figure 5.22\ndescription:\n[\nname: M1, type: NMOS, ports: {S: P, D: X, G: Vin1}\nname: M2, type: NMOS, ports: {S: P, D: Vout, G: Vin2}\nname: M3, type: PMOS, ports: {S: VDD, D: X, G: X}\nname: M4, type: PMOS, ports: {S: VDD, D: Vout, G: X}\nname: I1, type: CurrentSource, value: I1, ports: {Np: P, Nn: GND}\n]\nextrainfo:The circuit is a five-transistor operational transconductance amplifier (OTA). The differential pair M1 and M2 are loaded by a current mirror formed by M3 and M4. The circuit is used for converting differential input signals to a single-ended output.\nimage_name:(a)\ndescription:The circuit diagram (a) represents a differential pair with a current-source load. The NMOS transistors M1 and M2 form the differential pair, while PMOS transistors M3 and M4 serve as the current-source load. The current sources I1 and Iss provide biasing. The output is taken from the drain of M4, labeled as Vout. Resistors ro4, Rout, ro2, and ro1 are used to model various resistances in the circuit.\nimage_name:(b)\ndescription:The circuit (b) is a differential pair with a current-source load. It features NMOS transistors M1 and M2, and PMOS transistors M3 and M4. Current sources I1 and Iss provide biasing. The output is taken at Vout. Resistors ro4, Rout, ro2, and ro1 are part of the load and biasing network.\nimage_name:(c)\ndescription:The circuit diagram (c) represents a differential pair with a current-source load. It includes an NMOS transistor M2 with its source connected to node s2, drain to Vout, and gate to Vb. Resistors ro4 and Rout are connected between VDD and Vout, and Vout and GND respectively. Resistors ro2 and ro1 connect Vb and s2 to GND.\n\nFigure 5.23 (a) Differential pair with current-source load; (b) circuit for calculation of $G_{m}$; (c) circuit for calculation of $R_{\\text{out}}$.\ncalculate $A_{v}$ using two different methods, assuming $\\gamma=0$ for simplicity. Due to asymmetry, the half-circuit concept cannot be directly applied.\n\nBy expressing $\\left|A_{v}\\right|=G_{m} R_{\\text{out}}$, we need to determine the short-circuit transconductance, $G_{m}$, and the output resistance, $R_{\\text{out}}$. From Fig. 5.23(b), we observe that $M_{1}$ and $M_{2}$ become symmetric when the output is shorted to ac ground, thus $G_{m}=I_{\\text{out}} / V_{\\text{in}}=\\left(g_{m1} V_{\\text{in}} / 2\\right) / V_{\\text{in}}=g_{m1} / 2$. As shown in Fig. 5.23(c), for the $R_{\\text{out}}$ calculation, $M_{2}$ is degenerated by the source output impedance of $M_{1}, R_{\\text{deg}}=\\left(1 / g_{m1}\\right) \\| r_{O1}$, resulting in an output impedance of $\\left(1+g_{m2} r_{O2}\\right) R_{\\text{deg}}+r_{O2} \\approx 2 r_{O2}$. Consequently, $R_{\\text{out}}=\\left(2 r_{O2}\\right) \\| r_{O4}$, and\n\n$$\n\\begin{equation*}\n\\left|A_{v}\\right|=\\frac{g_{m1}}{2}\\left[\\left(2 r_{O2}\\right) \\| r_{O4}\\right] \\tag{5.20}\n\\end{equation*}\n$$\n\nInterestingly, if $r_{O4} \\rightarrow \\infty$, then $A_{v} \\rightarrow -g_{m1} r_{O2}$.\nIn our second approach, we compute $V_{P} / V_{\\text{in}}$ and $V_{\\text{out}} / V_{P}$ in Fig. 5.23(a) and multiply the results to obtain $V_{\\text{out}} / V_{\\text{in}}$. With the help of Fig. 5.24 and considering $M_{1}$ as a source follower, we write\n\n$$\n\\begin{equation*}\n\\frac{V_{P}}{V_{\\text{in}}}=\\frac{R_{\\text{eq}} \\| r_{O1}}{R_{\\text{eq}} \\| r_{O1}+\\frac{1}{g_{m1}}} \\tag{5.21}\n\\end{equation*}\n$$\n\nimage_name:Figure 5.24\ndescription:\n[\nname: M1, type: NMOS, ports: {S: P, D: VDD, G: Vin}\nname: M2, type: NMOS, ports: {S: P, D: Vout, G: GND}\nname: ro4, type: Resistor, value: ro4, ports: {N1: VDD, N2: Vout}\nname: Iss, type: CurrentSource, value: Iss, ports: {Np: P, Nn: GND}\n]\nextrainfo:The circuit is designed to calculate the voltage gain Vout/Vin using a source follower configuration with NMOS transistors M1 and M2. The circuit includes a current source Iss and resistors ro4, with the output taken across ro4.\n\nFigure 5.24 Circuit for calculation of $V_{P} / V_{\\text{in}}$.\nwhere $R_{\\text{eq}}$ represents the resistance seen looking into the source of $M_{2}$. Since the drain of $M_{2}$ is terminated by a relatively large resistance, $r_{O4}$, the value of $R_{\\text{eq}}$ must be derived from Eq. (3.117):\n\n$$\n\\begin{equation*}\nR_{\\text{eq}}=\\frac{r_{O2}+r_{O4}}{1+g_{m2} r_{O2}} \\tag{5.22}\n\\end{equation*}\n$$\n\nIt follows that\n\n$$\n\\begin{equation*}\n\\frac{V_{P}}{V_{\\text{in}}}=\\frac{g_{m1} r_{O1}\\left(r_{O2}+r_{O4}\\right)}{\\left(1+g_{m1} r_{O1}\\right)\\left(r_{O2}+r_{O4}\\right)+\\left(1+g_{m2} r_{O2}\\right) r_{O1}} \\tag{5.23}\n\\end{equation*}\n$$\n\nWe now determine $V_{\\text{out}} / V_{P}$. From Fig. 5.25,\n\n$$\n\\begin{equation*}\n\\frac{V_{\\text{out}}}{V_{P}}=\\frac{\\left(1+g_{m2} r_{O2}\\right) r_{O4}}{r_{O2}+r_{O4}} \\tag{5.24}\n\\end{equation*}\n$$\n\nimage_name:Figure 5.25 Circuit for calculation of $V_{\\text{out}} / V_{P}$.\ndescription:\n[\nname: ro4, type: Resistor, value: ro4, ports: {N1: VDD, N2: Vout}\nname: ro2, type: Resistor, value: ro2, ports: {N1: Vout, N2: Vp}\nname: M2, type: NMOS, ports: {S: Vp, D: Vout, G: Vb}\nname: Vp, type: VoltageSource, value: Vp, ports: {Np: Vp, Nn: GND}\n]\nextrainfo:The circuit is a differential amplifier with an active load, using NMOS transistor M2 and resistors ro2 and ro4. The output voltage Vout is taken from the drain of M2. Vp is the input voltage source.\n\nFrom (5.23) and (5.24), we have\n\n$$\n\\begin{align*}\n\\frac{V_{\\text{out}}}{V_{\\text{in}}} & =\\frac{g_{m2} r_{O2} r_{O4}}{2 r_{O2}+r_{O4}} \\tag{5.25}\\\\\n& =\\frac{g_{m2}}{2}\\left[\\left(2 r_{O2}\\right) \\| r_{O4}\\right] \\tag{5.26}\n\\end{align*}\n$$\n\n**Differential Pair with Active Load**\nIn the circuit of Fig. 5.23(a), the small-signal drain current of $M_{1}$ is \"wasted.\" As conceptually shown in Fig. 5.26(a), it is desirable to utilize this current with proper polarity at the output. This can be achieved by the five-transistor OTA depicted in Fig. 5.26(b), where $M_{3}$ and $M_{4}$ are identical and function as an active current mirror.\nimage_name:(a)\ndescription:The circuit is a differential pair with an active load. M3 and M4 form an active current mirror to enhance the gain. The input nodes are Vip and Vin, and the output node is Vout. The current source Iss provides biasing.\nimage_name:(b)\ndescription:The circuit is a five-transistor operational transconductance amplifier (OTA) with a differential pair (M1 and M2) and an active load (M3 and M4). The current source Iss provides biasing. The differential input is applied to M1 and M2, and the output is taken at Vout. M3 and M4 form a current mirror to enhance gain.\nimage_name:(c)\ndescription:The circuit is a differential pair with an active load, utilizing a five-transistor operational transconductance amplifier (OTA) configuration. The NMOS transistors M1 and M2 form the differential pair, while PMOS transistors M3 and M4 act as a current mirror load, enhancing the gain by combining the drain currents of M1 and M2.\n\nFigure 5.26 (a) Concept of combining the drain currents of $M_{1}$ and $M_{2}$, (b) realization of (a), and (c) response of the circuit to differential inputs.\n\nTo understand how $M_{3}$ boosts the gain, consider the scenario where the gate voltages of $M_{1}$ and $M_{2}$ change by equal and opposite amounts [Fig. 5.26(c)]. Consequently, $I_{D1}$ increases, $V_{F}$ decreases, and $I_{D2}$ decreases. Thus, the output voltage rises through two mechanisms: $M_{2}$ draws less current from $X$ to ground, and $M_{4}$ pushes more current from $V_{DD}$ to $X$. In contrast, in the circuit of Fig. 5.23(a), $M_{4}$ plays no active role in altering $V_{\\text{out}}$ because its gate voltage is constant. The five-transistor OTA is also known as a differential pair with an active load."
},
{
    "text": "As previously mentioned and illustrated by the circuit in Fig. 5.11, current mirrors can function as signal processors, acting as \"active\" components. A particularly beneficial topology is the one used alongside differential pairs. This section delves into the examination of this circuit and its characteristics. Depicted in Fig. 5.22 and often referred to as a five-transistor \"operational transconductance amplifier\" (OTA), this configuration is widely utilized in both analog and digital systems, warranting an in-depth analysis here. Note that the output is single-ended, leading to its occasional use in converting differential signals to a single-ended output. We begin by analyzing a simpler topology featuring a passive load before exploring the OTA.\n\n**Differential Pair with Passive Load**\nTo derive a single-ended output, one output of a differential pair can be disregarded, as shown in Fig. 5.23(a). Here, a current source in a \"passive\" mirror setup serves as the load. What is the small-signal gain, $A_{v}=V_{\\text{out}} / V_{\\text{in}}$, of this configuration? We\n**Figure 5.22 Description**\n- **M1**: NMOS, S: P, D: X, G: Vin1\n- **M2**: NMOS, S: P, D: Vout, G: Vin2\n- **M3**: PMOS, S: VDD, D: X, G: X\n- **M4**: PMOS, S: VDD, D: Vout, G: X\n- **I1**: CurrentSource, value: I1, Np: P, Nn: GND\n**Extra Info**: The circuit is a five-transistor OTA. The differential pair M1 and M2 is loaded by a current mirror formed by M3 and M4. It converts differential input signals to a single-ended output.\n**Figure 5.23(a) Description**\nThe circuit diagram (a) depicts a differential pair with a current-source load. NMOS transistors M1 and M2 form the differential pair, while PMOS transistors M3 and M4 act as the current-source load. Current sources I1 and Iss provide biasing. The output is taken from the drain of M4, labeled as Vout. Resistors ro4, Rout, ro2, and ro1 model various circuit resistances.\n**Figure 5.23(b) Description**\nThe circuit (b) is a differential pair with a current-source load, featuring NMOS transistors M1 and M2, and PMOS transistors M3 and M4. Current sources I1 and Iss provide biasing. The output is at Vout. Resistors ro4, Rout, ro2, and ro1 are part of the load and biasing network.\n**Figure 5.23(c) Description**\nThe circuit diagram (c) shows a differential pair with a current-source load. It includes NMOS transistor M2 with its source connected to node s2, drain to Vout, and gate to Vb. Resistors ro4 and Rout are between VDD and Vout, and Vout and GND respectively. Resistors ro2 and ro1 connect Vb and s2 to GND.\n\n**Figure 5.23** (a) Differential pair with current-source load; (b) circuit for $G_{m}$ calculation; (c) circuit for $R_{\\text{out}}$ calculation.\ncalculate $A_{v}$ using two distinct methods, assuming $\\gamma=0$ for simplicity. Due to asymmetry, the half-circuit concept cannot be directly applied.\n\nBy expressing $\\left|A_{v}\\right|=G_{m} R_{\\text{out}}$, we need to determine the short-circuit transconductance, $G_{m}$, and the output resistance, $R_{\\text{out}}$. From Fig. 5.23(b), we observe that M1 and M2 become symmetric when the output is shorted to ac ground. Thus, $G_{m}=I_{\\text{out}} / V_{\\text{in}}=\\left(g_{m1} V_{\\text{in}} / 2\\right) / V_{\\text{in}}=g_{m1} / 2$. As shown in Fig. 5.23(c), for $R_{\\text{out}}$ calculation, M2 is degenerated by the source output impedance of M1, $R_{\\text{deg}}=\\left(1 / g_{m1}\\right) \\| r_{O1}$, resulting in an output impedance of $\\left(1+g_{m2} r_{O2}\\right) R_{\\text{deg}}+r_{O2} \\approx 2 r_{O2}$. Consequently, $R_{\\text{out}}=\\left(2 r_{O2}\\right) \\| r_{O4}$, and\n\n$$\n\\begin{equation*}\n\\left|A_{v}\\right|=\\frac{g_{m1}}{2}\\left[\\left(2 r_{O2}\\right) \\| r_{O4}\\right] \\tag{5.20}\n\\end{equation*}\n$$\n\nInterestingly, if $r_{O4} \\rightarrow \\infty$, then $A_{v} \\rightarrow -g_{m1} r_{O2}$.\nIn our second approach, we compute $V_{P} / V_{\\text{in}}$ and $V_{\\text{out}} / V_{P}$ in Fig. 5.23(a) and multiply the results to obtain $V_{\\text{out}} / V_{\\text{in}}$. With the help of Fig. 5.24 and viewing M1 as a source follower, we write\n\n$$\n\\begin{equation*}\n\\frac{V_{P}}{V_{\\text{in}}}=\\frac{R_{\\text{eq}} \\| r_{O1}}{R_{\\text{eq}} \\| r_{O1}+\\frac{1}{g_{m1}}} \\tag{5.21}\n\\end{equation*}\n$$\n\n**Figure 5.24 Description**\n- **M1**: NMOS, S: P, D: VDD, G: Vin\n- **M2**: NMOS, S: P, D: Vout, G: GND\n- **ro4**: Resistor, value: ro4, N1: VDD, N2: Vout\n- **Iss**: CurrentSource, value: Iss, Np: P, Nn: GND\n**Extra Info**: The circuit calculates Vout/Vin using a source follower configuration with NMOS transistors M1 and M2, including a current source Iss and resistors ro4, with the output taken across ro4.\n\n**Figure 5.24** Circuit for calculation of $V_{P} / V_{\\text{in}}$.\nwhere $R_{\\text{eq}}$ represents the resistance seen looking into the source of M2. Since the drain of M2 is terminated by a relatively large resistance, $r_{O4}$, the value of $R_{\\text{eq}}$ is derived from Eq. (3.117):\n\n$$\n\\begin{equation*}\nR_{\\text{eq}}=\\frac{r_{O2}+r_{O4}}{1+g_{m2} r_{O2}} \\tag{5.22}\n\\end{equation*}\n$$\n\nIt follows that\n\n$$\n\\begin{equation*}\n\\frac{V_{P}}{V_{\\text{in}}}=\\frac{g_{m1} r_{O1}\\left(r_{O2}+r_{O4}\\right)}{\\left(1+g_{m1} r_{O1}\\right)\\left(r_{O2}+r_{O4}\\right)+\\left(1+g_{m2} r_{O2}\\right) r_{O1}} \\tag{5.23}\n\\end{equation*}\n$$\n\nWe now calculate $V_{\\text{out}} / V_{P}$. From Fig. 5.25,\n\n$$\n\\begin{equation*}\n\\frac{V_{\\text{out}}}{V_{P}}=\\frac{\\left(1+g_{m2} r_{O2}\\right) r_{O4}}{r_{O2}+r_{O4}} \\tag{5.24}\n\\end{equation*}\n$$\n\n**Figure 5.25 Description**\n- **ro4**: Resistor, value: ro4, N1: VDD, N2: Vout\n- **ro2**: Resistor, value: ro2, N1: Vout, N2: Vp\n- **M2**: NMOS, S: Vp, D: Vout, G: Vb\n- **Vp**: VoltageSource, value: Vp, Np: Vp, Nn: GND\n**Extra Info**: The circuit is a differential amplifier with an active load, using NMOS transistor M2 and resistors ro2 and ro4. The output voltage Vout is taken from the drain of M2. Vp is the input voltage source.\n\nFrom (5.23) and (5.24), we have\n\n$$\n\\begin{align*}\n\\frac{V_{\\text{out}}}{V_{\\text{in}}} & =\\frac{g_{m2} r_{O2} r_{O4}}{2 r_{O2}+r_{O4}} \\tag{5.25}\\\\\n& =\\frac{g_{m2}}{2}\\left[\\left(2 r_{O2}\\right) \\| r_{O4}\\right] \\tag{5.26}\n\\end{align*}\n$$\n\n**Differential Pair with Active Load**\nIn the circuit of Fig. 5.23(a), the small-signal drain current of M1 is \"wasted.\" As conceptually shown in Fig. 5.26(a), it is advantageous to utilize this current with proper polarity at the output. This can be achieved by the five-transistor OTA depicted in Fig. 5.26(b), where M3 and M4 are identical and function as an active current mirror.\n**Figure 5.26(a) Description**\nThe circuit is a differential pair with an active load. M3 and M4 form an active current mirror to enhance gain. The input nodes are Vip and Vin, and the output node is Vout. The current source Iss provides biasing.\n**Figure 5.26(b) Description**\nThe circuit is a five-transistor OTA with a differential pair (M1 and M2) and an active load (M3 and M4). The current source Iss provides biasing. The differential input is applied to M1 and M2, and the output is taken at Vout. M3 and M4 form a current mirror to enhance gain.\n**Figure 5.26(c) Description**\nThe circuit is a differential pair with an active load, using a five-transistor OTA configuration. NMOS transistors M1 and M2 form the differential pair, while PMOS transistors M3 and M4 act as a current mirror load, enhancing gain by combining the drain currents of M1 and M2.\n\n**Figure 5.26** (a) Concept of combining the drain currents of M1 and M2, (b) realization of (a), and (c) response of the circuit to differential inputs.\n\nTo understand how M3 enhances the gain, consider the scenario where the gate voltages of M1 and M2 change by equal and opposite amounts [Fig. 5.26(c)]. Consequently, $I_{D1}$ increases, $V_{F}$ decreases, and $I_{D2}$ decreases. Thus, the output voltage rises through two mechanisms: M2 draws less current from X to ground, and M4 pushes more current from VDD to X. In contrast, in the circuit of Fig. 5.23(a), M4 plays no active role in altering $V_{\\text{out}}$ because its gate voltage is constant. The five-transistor OTA is also known as a differential pair with an active load."
},
{
    "text": "As previously mentioned and illustrated by the circuit in Fig. 5.11, current mirrors can function as signal processors, acting as \"active\" elements. A particularly beneficial mirror topology is used alongside differential pairs, which we examine in this section. Featured in Fig. 5.22 and often referred to as a five-transistor \"operational transconductance amplifier\" (OTA), this configuration is widely employed in both analog and digital systems, warranting a thorough analysis. Note that the output is single-ended, making the circuit suitable for converting differential signals to a single-ended output. We first analyze a simpler topology with a passive load before delving into the OTA.\n\nDifferential Pair with Passive Load To produce a single-ended output, one output of a differential pair can be disregarded, as shown in Fig. 5.23(a). Here, a current source in a \"passive\" mirror setup serves as the load. What is the small-signal gain, $A_{v}=V_{\\text {out }} / V_{\\text {in }}$, of this circuit? We\nimage_name:Figure 5.22\ndescription:\n[\nname: M1, type: NMOS, ports: {S: P, D: X, G: Vin1}\nname: M2, type: NMOS, ports: {S: P, D: Vout, G: Vin2}\nname: M3, type: PMOS, ports: {S: VDD, D: X, G: X}\nname: M4, type: PMOS, ports: {S: VDD, D: Vout, G: X}\nname: I1, type: CurrentSource, value: I1, ports: {Np: P, Nn: GND}\n]\nextrainfo:The circuit is a five-transistor operational transconductance amplifier (OTA). The differential pair M1 and M2 are loaded by a current mirror formed by M3 and M4. The circuit is used for converting differential input signals to a single-ended output.\nimage_name:(a)\ndescription:The circuit diagram (a) depicts a differential pair with a current-source load. NMOS transistors M1 and M2 constitute the differential pair, while PMOS transistors M3 and M4 act as the current-source load. Current sources I1 and Iss provide biasing. The output is derived from the drain of M4, labeled as Vout. Resistors ro4, Rout, ro2, and ro1 model various resistances in the circuit.\nimage_name:(b)\ndescription:The circuit (b) is a differential pair with a current-source load. It includes NMOS transistors M1 and M2, and PMOS transistors M3 and M4. Current sources I1 and Iss provide biasing. The output is taken at Vout. Resistors ro4, Rout, ro2, and ro1 are part of the load and biasing network.\nimage_name:(c)\ndescription:The circuit diagram (c) represents a differential pair with a current-source load. It features an NMOS transistor M2 with its source connected to node s2, drain to Vout, and gate to Vb. Resistors ro4 and Rout are connected between VDD and Vout, and Vout and GND respectively. Resistors ro2 and ro1 connect Vb and s2 to GND.\n\nFigure 5.23 (a) Differential pair with current-source load; (b) circuit for calculation of $G_{m}$; (c) circuit for calculation of $R_{\\text {out }}$.\ncalculate $A_{v}$ using two distinct methods, assuming $\\gamma=0$ for simplicity. Due to the asymmetry, the half-circuit concept cannot be directly applied.\n\nBy expressing $\\left|A_{v}\\right|=G_{m} R_{\\text {out }}$, we need to determine the short-circuit transconductance, $G_{m}$, and the output resistance, $R_{\\text {out }}$. From Fig. $5.23(\\mathrm{~b})$, we observe that $M_{1}$ and $M_{2}$ become symmetric when the output is shorted to ac ground. Thus, $G_{m}=I_{o u t} / V_{i n}=\\left(g_{m 1} V_{i n} / 2\\right) / V_{i n}=g_{m 1} / 2$. As depicted in Fig. 5.23(c), for the $R_{\\text {out }}$ calculation, $M_{2}$ is degenerated by the source output impedance of $M_{1}, R_{d e g}=\\left(1 / g_{m 1}\\right) \\| r_{O 1}$, resulting in an output impedance of $\\left(1+g_{m 2} r_{O 2}\\right) R_{d e g}+r_{O 2} a \\approx 2 r_{O 2}$. Consequently, $R_{\\text {out }}=\\left(2 r_{O 2}\\right) \\| r_{O 4}$, and\n\n$$\n\\begin{equation*}\n\\left|A_{v}\\right|=\\frac{g_{m 1}}{2}\\left[\\left(2 r_{O 2}\\right) \\| r_{O 4}\\right] \\tag{5.20}\n\\end{equation*}\n$$\n\nInterestingly, if $r_{O 4} \\rightarrow \\infty$, then $A_{v} \\rightarrow-g_{m 1} r_{O 2}$.\nIn our second approach, we compute $V_{P} / V_{\\text {in }}$ and $V_{\\text {out }} / V_{P}$ in Fig. 5.23(a) and multiply the results to obtain $V_{\\text {out }} / V_{\\text {in }}$. With the help of Fig. 5.24 and considering $M_{1}$ as a source follower, we write\n\n$$\n\\begin{equation*}\n\\frac{V_{P}}{V_{i n}}=\\frac{R_{e q} \\| r_{O 1}}{R_{e q} \\| r_{O 1}+\\frac{1}{g_{m 1}}} \\tag{5.21}\n\\end{equation*}\n$$\n\nimage_name:Figure 5.24\ndescription:\n[\nname: M1, type: NMOS, ports: {S: P, D: VDD, G: Vin}\nname: M2, type: NMOS, ports: {S: P, D: Vout, G: GND}\nname: ro4, type: Resistor, value: ro4, ports: {N1: VDD, N2: Vout}\nname: Iss, type: CurrentSource, value: Iss, ports: {Np: P, Nn: GND}\n]\nextrainfo:The circuit is designed to calculate the voltage gain Vout/Vin using a source follower configuration with NMOS transistors M1 and M2. The circuit includes a current source Iss and resistors ro4, with the output taken across ro4.\n\nFigure 5.24 Circuit for calculation of $V_{P} / V_{\\text {in }}$.\nwhere $R_{e q}$ represents the resistance seen looking into the source of $M_{2}$. Since the drain of $M_{2}$ is terminated by a relatively large resistance, $r_{O 4}$, the value of $R_{e q}$ must be derived from Eq. (3.117):\n\n$$\n\\begin{equation*}\nR_{e q}=\\frac{r_{O 2}+r_{O 4}}{1+g_{m 2} r_{O 2}} \\tag{5.22}\n\\end{equation*}\n$$\n\nIt follows that\n\n$$\n\\begin{equation*}\n\\frac{V_{P}}{V_{i n}}=\\frac{g_{m 1} r_{O 1}\\left(r_{O 2}+r_{O 4}\\right)}{\\left(1+g_{m 1} r_{O 1}\\right)\\left(r_{O 2}+r_{O 4}\\right)+\\left(1+g_{m 2} r_{O 2}\\right) r_{O 1}} \\tag{5.23}\n\\end{equation*}\n$$\n\nWe now calculate $V_{\\text {out }} / V_{P}$. From Fig. 5.25,\n\n$$\n\\begin{equation*}\n\\frac{V_{\\text {out }}}{V_{P}}=\\frac{\\left(1+g_{m 2} r_{O 2}\\right) r_{O 4}}{r_{O 2}+r_{O 4}} \\tag{5.24}\n\\end{equation*}\n$$\n\nimage_name:Figure 5.25 Circuit for calculation of $V_{\\text {out }} / V_{P}$.\ndescription:\n[\nname: ro4, type: Resistor, value: ro4, ports: {N1: VDD, N2: Vout}\nname: ro2, type: Resistor, value: ro2, ports: {N1: Vout, N2: Vp}\nname: M2, type: NMOS, ports: {S: Vp, D: Vout, G: Vb}\nname: Vp, type: VoltageSource, value: Vp, ports: {Np: Vp, Nn: GND}\n]\nextrainfo:The circuit is a differential amplifier with an active load, using NMOS transistor M2 and resistors ro2 and ro4. The output voltage Vout is taken from the drain of M2. Vp is the input voltage source.\n\nFrom (5.23) and (5.24), we have\n\n$$\n\\begin{align*}\n\\frac{V_{\\text {out }}}{V_{\\text {in }}} & =\\frac{g_{m 2} r_{O 2} r_{O 4}}{2 r_{O 2}+r_{O 4}}  \\tag{5.25}\\\\\n& =\\frac{g_{m 2}}{2}\\left[\\left(2 r_{O 2}\\right) \\| r_{O 4}\\right] \\tag{5.26}\n\\end{align*}\n$$\n\nDifferential Pair with Active Load In the circuit of Fig. 5.23(a), the small-signal drain current of $M_{1}$ is \"wasted.\" As conceptually shown in Fig. 5.26(a), it is desirable to utilize this current with proper polarity at the output. This can be achieved by the five-transistor OTA depicted in Fig. 5.26(b), where $M_{3}$ and $M_{4}$ are identical and function as an active current mirror.\nimage_name:(a)\ndescription:The circuit illustrates a differential pair with an active load. M3 and M4 form an active current mirror to enhance gain. The input nodes are Vip and Vin, and the output node is Vout. The current source Iss provides biasing.\nimage_name:(b)\ndescription:The circuit is a five-transistor operational transconductance amplifier (OTA) featuring a differential pair (M1 and M2) and an active load (M3 and M4). The current source Iss supplies biasing. The differential input is applied to M1 and M2, and the output is taken at Vout. M3 and M4 constitute a current mirror to enhance gain.\nimage_name:(c)\ndescription:The circuit is a differential pair with an active load, utilizing a five-transistor operational transconductance amplifier (OTA) configuration. NMOS transistors M1 and M2 form the differential pair, while PMOS transistors M3 and M4 act as a current mirror load, enhancing the gain by combining the drain currents of M1 and M2.\n\nFigure 5.26 (a) Concept of combining the drain currents of $M_{1}$ and $M_{2}$, (b) realization of (a), and (c) response of the circuit to differential inputs.\n\nTo understand how $M_{3}$ boosts the gain, consider equal and opposite changes in the gate voltages of $M_{1}$ and $M_{2}$ [Fig. 5.26(c)]. Consequently, $I_{D 1}$ increases, $V_{F}$ decreases, and $I_{D 2}$ decreases. Thus, the output voltage increases through two mechanisms: $M_{2}$ draws less current from $X$ to ground and $M_{4}$ pushes more current from $V_{D D}$ to $X$. In contrast, in the circuit of Fig. 5.23(a), $M_{4}$ plays no active role in altering $V_{\\text {out }}$ because its gate voltage remains constant. The five-transistor OTA is also known as a differential pair with an active load."
},
{
    "text": "As previously mentioned and illustrated by the circuit in Fig. 5.11, current mirrors can function as signal processors, acting as \"active\" elements. A particularly beneficial mirror topology is used alongside differential pairs. This section delves into the study of this circuit and its characteristics. Presented in Fig. 5.22 and often referred to as a five-transistor \"operational transconductance amplifier\" (OTA), this topology is widely applied in various analog and digital systems, warranting a detailed examination here. Note that the output is single-ended, leading to its occasional use for converting differential signals to a single-ended output. We first analyze a simpler topology with a passive load before exploring the OTA.\n\nDifferential Pair with Passive Load To achieve a single-ended output, one output of a differential pair can be disregarded, as depicted in Fig. 5.23(a). Here, a current source in a \"passive\" mirror configuration acts as the load. What is the small-signal gain, $A_{v}=V_{\\text {out }} / V_{\\text {in }}$, of this circuit? We\nimage_name:Figure 5.22\ndescription:\n[\nname: M1, type: NMOS, ports: {S: P, D: X, G: Vin1}\nname: M2, type: NMOS, ports: {S: P, D: Vout, G: Vin2}\nname: M3, type: PMOS, ports: {S: VDD, D: X, G: X}\nname: M4, type: PMOS, ports: {S: VDD, D: Vout, G: X}\nname: I1, type: CurrentSource, value: I1, ports: {Np: P, Nn: GND}\n]\nextrainfo:The circuit is a five-transistor operational transconductance amplifier (OTA). The differential pair M1 and M2 are loaded by a current mirror formed by M3 and M4. The circuit is used for converting differential input signals to a single-ended output.\nimage_name:(a)\ndescription:The circuit diagram (a) shows a differential pair with a current-source load. NMOS transistors M1 and M2 form the differential pair, while PMOS transistors M3 and M4 serve as the current-source load. Current sources I1 and Iss provide biasing. The output is taken from the drain of M4, labeled as Vout. Resistors ro4, Rout, ro2, and ro1 model various resistances in the circuit.\nimage_name:(b)\ndescription:The circuit (b) is a differential pair with a current-source load. It includes NMOS transistors M1 and M2, and PMOS transistors M3 and M4. Current sources I1 and Iss provide biasing. The output is taken at Vout. Resistors ro4, Rout, ro2, and ro1 are part of the load and biasing network.\nimage_name:(c)\ndescription:The circuit diagram (c) shows a differential pair with a current-source load. It includes an NMOS transistor M2 with its source connected to node s2, drain to Vout, and gate to Vb. Resistors ro4 and Rout are connected between VDD and Vout, and Vout and GND respectively. Resistors ro2 and ro1 connect Vb and s2 to GND.\n\nFigure 5.23 (a) Differential pair with current-source load; (b) circuit for calculation of $G_{m}$; (c) circuit for calculation of $R_{\\text {out }}$.\ncalculate $A_{v}$ using two distinct methods, assuming $\\gamma=0$ for simplicity. Due to asymmetry, the half-circuit concept cannot be directly applied.\n\nBy expressing $\\left|A_{v}\\right|=G_{m} R_{\\text {out }}$, we need to determine the short-circuit transconductance, $G_{m}$, and the output resistance, $R_{\\text {out }}$. From Fig. $5.23(\\mathrm{~b})$, we observe that $M_{1}$ and $M_{2}$ become symmetric when the output is shorted to ac ground. Thus, $G_{m}=I_{o u t} / V_{i n}=\\left(g_{m 1} V_{i n} / 2\\right) / V_{i n}=g_{m 1} / 2$. As shown in Fig. 5.23(c), for the $R_{\\text {out }}$ calculation, $M_{2}$ is degenerated by the source output impedance of $M_{1}, R_{d e g}=\\left(1 / g_{m 1}\\right) \\| r_{O 1}$, resulting in an output impedance of $\\left(1+g_{m 2} r_{O 2}\\right) R_{d e g}+r_{O 2} a \\approx 2 r_{O 2}$. Consequently, $R_{\\text {out }}=\\left(2 r_{O 2}\\right) \\| r_{O 4}$, and\n\n$$\n\\begin{equation*}\n\\left|A_{v}\\right|=\\frac{g_{m 1}}{2}\\left[\\left(2 r_{O 2}\\right) \\| r_{O 4}\\right] \\tag{5.20}\n\\end{equation*}\n$$\n\nInterestingly, if $r_{O 4} \\rightarrow \\infty$, then $A_{v} \\rightarrow-g_{m 1} r_{O 2}$.\nIn our second approach, we compute $V_{P} / V_{\\text {in }}$ and $V_{\\text {out }} / V_{P}$ in Fig. 5.23(a) and multiply the results to obtain $V_{\\text {out }} / V_{\\text {in }}$. With the help of Fig. 5.24 and considering $M_{1}$ as a source follower, we write\n\n$$\n\\begin{equation*}\n\\frac{V_{P}}{V_{i n}}=\\frac{R_{e q} \\| r_{O 1}}{R_{e q} \\| r_{O 1}+\\frac{1}{g_{m 1}}} \\tag{5.21}\n\\end{equation*}\n$$\n\nimage_name:Figure 5.24\ndescription:\n[\nname: M1, type: NMOS, ports: {S: P, D: VDD, G: Vin}\nname: M2, type: NMOS, ports: {S: P, D: Vout, G: GND}\nname: ro4, type: Resistor, value: ro4, ports: {N1: VDD, N2: Vout}\nname: Iss, type: CurrentSource, value: Iss, ports: {Np: P, Nn: GND}\n]\nextrainfo:The circuit is designed to calculate the voltage gain Vout/Vin using a source follower configuration with NMOS transistors M1 and M2. The circuit includes a current source Iss and resistors ro4, with the output taken across ro4.\n\nFigure 5.24 Circuit for calculation of $V_{P} / V_{\\text {in }}$.\nwhere $R_{e q}$ represents the resistance seen looking into the source of $M_{2}$. Since the drain of $M_{2}$ is terminated by a relatively large resistance, $r_{O 4}$, the value of $R_{e q}$ must be derived from Eq. (3.117):\n\n$$\n\\begin{equation*}\nR_{e q}=\\frac{r_{O 2}+r_{O 4}}{1+g_{m 2} r_{O 2}} \\tag{5.22}\n\\end{equation*}\n$$\n\nIt follows that\n\n$$\n\\begin{equation*}\n\\frac{V_{P}}{V_{i n}}=\\frac{g_{m 1} r_{O 1}\\left(r_{O 2}+r_{O 4}\\right)}{\\left(1+g_{m 1} r_{O 1}\\right)\\left(r_{O 2}+r_{O 4}\\right)+\\left(1+g_{m 2} r_{O 2}\\right) r_{O 1}} \\tag{5.23}\n\\end{equation*}\n$$\n\nWe now calculate $V_{\\text {out }} / V_{P}$. From Fig. 5.25,\n\n$$\n\\begin{equation*}\n\\frac{V_{\\text {out }}}{V_{P}}=\\frac{\\left(1+g_{m 2} r_{O 2}\\right) r_{O 4}}{r_{O 2}+r_{O 4}} \\tag{5.24}\n\\end{equation*}\n$$\n\nimage_name:Figure 5.25 Circuit for calculation of $V_{\\text {out }} / V_{P}$.\ndescription:\n[\nname: ro4, type: Resistor, value: ro4, ports: {N1: VDD, N2: Vout}\nname: ro2, type: Resistor, value: ro2, ports: {N1: Vout, N2: Vp}\nname: M2, type: NMOS, ports: {S: Vp, D: Vout, G: Vb}\nname: Vp, type: VoltageSource, value: Vp, ports: {Np: Vp, Nn: GND}\n]\nextrainfo:The circuit is a differential amplifier with an active load, using NMOS transistor M2 and resistors ro2 and ro4. The output voltage Vout is taken from the drain of M2. Vp is the input voltage source.\n\nFrom (5.23) and (5.24), we have\n\n$$\n\\begin{align*}\n\\frac{V_{\\text {out }}}{V_{\\text {in }}} & =\\frac{g_{m 2} r_{O 2} r_{O 4}}{2 r_{O 2}+r_{O 4}}  \\tag{5.25}\\\\\n& =\\frac{g_{m 2}}{2}\\left[\\left(2 r_{O 2}\\right) \\| r_{O 4}\\right] \\tag{5.26}\n\\end{align*}\n$$\n\nDifferential Pair with Active Load In the circuit of Fig. 5.23(a), the small-signal drain current of $M_{1}$ is \"wasted.\" As conceptually illustrated in Fig. 5.26(a), it is desirable to utilize this current with proper polarity at the output. This can be achieved by the five-transistor OTA shown in Fig. 5.26(b), where $M_{3}$ and $M_{4}$ are identical and operate as an active current mirror.\nimage_name:(a)\ndescription:The circuit illustrates a differential pair with an active load. M3 and M4 form an active current mirror to enhance gain. The input nodes are Vip and Vin, and the output node is Vout. The current source Iss provides biasing.\nimage_name:(b)\ndescription:The circuit is a five-transistor operational transconductance amplifier (OTA) with a differential pair (M1 and M2) and an active load (M3 and M4). The current source Iss provides biasing. The differential input is applied to M1 and M2, and the output is taken at Vout. M3 and M4 form a current mirror to enhance gain.\nimage_name:(c)\ndescription:The circuit is a differential pair with an active load, utilizing a five-transistor operational transconductance amplifier (OTA) configuration. The NMOS transistors M1 and M2 form the differential pair, while PMOS transistors M3 and M4 act as a current mirror load, enhancing the gain by combining the drain currents of M1 and M2.\n\nFigure 5.26 (a) Concept of combining the drain currents of $M_{1}$ and $M_{2}$, (b) realization of (a), and (c) response of the circuit to differential inputs.\n\nTo understand how $M_{3}$ enhances the gain, consider the scenario where the gate voltages of $M_{1}$ and $M_{2}$ change by equal and opposite amounts [Fig. 5.26(c)]. Consequently, $I_{D 1}$ increases, $V_{F}$ decreases, and $I_{D 2}$ decreases. Thus, the output voltage rises through two mechanisms: $M_{2}$ draws less current from $X$ to ground and $M_{4}$ pushes more current from $V_{D D}$ to $X$. In contrast, in the circuit of Fig. 5.23(a), $M_{4}$ plays no active role in altering $V_{\\text {out }}$ because its gate voltage is constant. The five-transistor OTA is also known as a differential pair with an active load."
},
{
    "text": "As previously noted and demonstrated by the circuit in Fig. 5.11, current mirrors can function as signal processors, acting as \"active\" components. A particularly beneficial configuration is the mirror topology used alongside differential pairs, which we examine in this section. Fig. 5.22 illustrates this topology, often referred to as a five-transistor \"operational transconductance amplifier\" (OTA), widely employed in both analog and digital systems, warranting a thorough investigation. Note that the output is single-ended, making this circuit suitable for converting differential signals to a single-ended output. We first analyze a simpler topology with a passive load before delving into the OTA.\n\n**Differential Pair with Passive Load**\nTo obtain a single-ended output, one output of a differential pair can be disregarded, as shown in Fig. 5.23(a). Here, a current source in a \"passive\" mirror setup serves as the load. What is the small-signal gain, $A_{v}=V_{\\text{out}}/V_{\\text{in}}$, of this circuit? We\nimage_name: Figure 5.22\ndescription:\n[\nname: M1, type: NMOS, ports: {S: P, D: X, G: Vin1}\nname: M2, type: NMOS, ports: {S: P, D: Vout, G: Vin2}\nname: M3, type: PMOS, ports: {S: VDD, D: X, G: X}\nname: M4, type: PMOS, ports: {S: VDD, D: Vout, G: X}\nname: I1, type: CurrentSource, value: I1, ports: {Np: P, Nn: GND}\n]\nextrainfo: The circuit is a five-transistor operational transconductance amplifier (OTA). The differential pair M1 and M2 are loaded by a current mirror formed by M3 and M4. The circuit is used for converting differential input signals to a single-ended output.\nimage_name: (a)\ndescription: The circuit diagram (a) represents a differential pair with a current-source load. The NMOS transistors M1 and M2 form the differential pair, while PMOS transistors M3 and M4 serve as the current-source load. The current sources I1 and Iss provide biasing. The output is taken from the drain of M4, labeled as Vout. Resistors ro4, Rout, ro2, and ro1 are used to model various resistances in the circuit.\nimage_name: (b)\ndescription: The circuit (b) is a differential pair with a current-source load. It features NMOS transistors M1 and M2, and PMOS transistors M3 and M4. Current sources I1 and Iss provide biasing. The output is taken at Vout. Resistors ro4, Rout, ro2, and ro1 are part of the load and biasing network.\nimage_name: (c)\ndescription: The circuit diagram (c) represents a differential pair with a current-source load. It includes an NMOS transistor M2 with its source connected to node s2, drain to Vout, and gate to Vb. Resistors ro4 and Rout are connected between VDD and Vout, and Vout and GND respectively. Resistors ro2 and ro1 connect Vb and s2 to GND.\n\nFigure 5.23 (a) Differential pair with current-source load; (b) circuit for calculation of $G_{m}$; (c) circuit for calculation of $R_{\\text{out}}$.\ncalculate $A_{v}$ using two different methods, assuming $\\gamma=0$ for simplicity. Due to asymmetry, the half-circuit concept cannot be directly applied.\n\nBy expressing $\\left|A_{v}\\right|=G_{m}R_{\\text{out}}$, we need to determine the short-circuit transconductance, $G_{m}$, and the output resistance, $R_{\\text{out}}$. From Fig. 5.23(b), we observe that $M_{1}$ and $M_{2}$ become symmetric when the output is shorted to ac ground, thus $G_{m}=I_{\\text{out}}/V_{\\text{in}}=\\left(g_{m1}V_{\\text{in}}/2\\right)/V_{\\text{in}}=g_{m1}/2$. As depicted in Fig. 5.23(c), for the $R_{\\text{out}}$ calculation, $M_{2}$ is degenerated by the source output impedance of $M_{1}, R_{\\text{deg}}=\\left(1/g_{m1}\\right) \\| r_{O1}$, resulting in an output impedance of $\\left(1+g_{m2}r_{O2}\\right)R_{\\text{deg}}+r_{O2} \\approx 2r_{O2}$. Consequently, $R_{\\text{out}}=\\left(2r_{O2}\\right) \\| r_{O4}$, and\n\n$$\n\\begin{equation*}\n\\left|A_{v}\\right|=\\frac{g_{m1}}{2}\\left[\\left(2r_{O2}\\right) \\| r_{O4}\\right] \\tag{5.20}\n\\end{equation*}\n$$\n\nInterestingly, if $r_{O4} \\rightarrow \\infty$, then $A_{v} \\rightarrow -g_{m1}r_{O2}$.\nIn our second approach, we compute $V_{P}/V_{\\text{in}}$ and $V_{\\text{out}}/V_{P}$ in Fig. 5.23(a) and multiply the results to obtain $V_{\\text{out}}/V_{\\text{in}}$. With the help of Fig. 5.24 and considering $M_{1}$ as a source follower, we write\n\n$$\n\\begin{equation*}\n\\frac{V_{P}}{V_{\\text{in}}}=\\frac{R_{\\text{eq}} \\| r_{O1}}{R_{\\text{eq}} \\| r_{O1}+\\frac{1}{g_{m1}}} \\tag{5.21}\n\\end{equation*}\n$$\n\nimage_name: Figure 5.24\ndescription:\n[\nname: M1, type: NMOS, ports: {S: P, D: VDD, G: Vin}\nname: M2, type: NMOS, ports: {S: P, D: Vout, G: GND}\nname: ro4, type: Resistor, value: ro4, ports: {N1: VDD, N2: Vout}\nname: Iss, type: CurrentSource, value: Iss, ports: {Np: P, Nn: GND}\n]\nextrainfo: The circuit is designed to calculate the voltage gain Vout/Vin using a source follower configuration with NMOS transistors M1 and M2. The circuit includes a current source Iss and resistors ro4, with the output taken across ro4.\n\nFigure 5.24 Circuit for calculation of $V_{P}/V_{\\text{in}}$.\nwhere $R_{\\text{eq}}$ denotes the resistance seen looking into the source of $M_{2}$. Since the drain of $M_{2}$ is terminated by a relatively large resistance, $r_{O4}$, the value of $R_{\\text{eq}}$ must be derived from Eq. (3.117):\n\n$$\n\\begin{equation*}\nR_{\\text{eq}}=\\frac{r_{O2}+r_{O4}}{1+g_{m2}r_{O2}} \\tag{5.22}\n\\end{equation*}\n$$\n\nIt follows that\n\n$$\n\\begin{equation*}\n\\frac{V_{P}}{V_{\\text{in}}}=\\frac{g_{m1}r_{O1}\\left(r_{O2}+r_{O4}\\right)}{\\left(1+g_{m1}r_{O1}\\right)\\left(r_{O2}+r_{O4}\\right)+\\left(1+g_{m2}r_{O2}\\right)r_{O1}} \\tag{5.23}\n\\end{equation*}\n$$\n\nWe now calculate $V_{\\text{out}}/V_{P}$. From Fig. 5.25,\n\n$$\n\\begin{equation*}\n\\frac{V_{\\text{out}}}{V_{P}}=\\frac{\\left(1+g_{m2}r_{O2}\\right)r_{O4}}{r_{O2}+r_{O4}} \\tag{5.24}\n\\end{equation*}\n$$\n\nimage_name: Figure 5.25 Circuit for calculation of $V_{\\text{out}}/V_{P}$.\ndescription:\n[\nname: ro4, type: Resistor, value: ro4, ports: {N1: VDD, N2: Vout}\nname: ro2, type: Resistor, value: ro2, ports: {N1: Vout, N2: Vp}\nname: M2, type: NMOS, ports: {S: Vp, D: Vout, G: Vb}\nname: Vp, type: VoltageSource, value: Vp, ports: {Np: Vp, Nn: GND}\n]\nextrainfo: The circuit is a differential amplifier with an active load, using NMOS transistor M2 and resistors ro2 and ro4. The output voltage Vout is taken from the drain of M2. Vp is the input voltage source.\n\nFrom (5.23) and (5.24), we have\n\n$$\n\\begin{align*}\n\\frac{V_{\\text{out}}}{V_{\\text{in}}} & =\\frac{g_{m2}r_{O2}r_{O4}}{2r_{O2}+r_{O4}} \\tag{5.25}\\\\\n& =\\frac{g_{m2}}{2}\\left[\\left(2r_{O2}\\right) \\| r_{O4}\\right] \\tag{5.26}\n\\end{align*}\n$$\n\n**Differential Pair with Active Load**\nIn the circuit of Fig. 5.23(a), the small-signal drain current of $M_{1}$ is \"wasted.\" As conceptually shown in Fig. 5.26(a), it is desirable to utilize this current with proper polarity at the output. This can be achieved by the five-transistor OTA shown in Fig. 5.26(b), where $M_{3}$ and $M_{4}$ are identical and operate as an active current mirror.\nimage_name: (a)\ndescription: The circuit is a differential pair with an active load. M3 and M4 form an active current mirror to enhance the gain. The input nodes are Vip and Vin, and the output node is Vout. The current source Iss provides biasing.\nimage_name: (b)\ndescription: The circuit is a five-transistor operational transconductance amplifier (OTA) with a differential pair (M1 and M2) and an active load (M3 and M4). The current source Iss provides biasing. The differential input is applied to M1 and M2, and the output is taken at Vout. M3 and M4 form a current mirror to enhance gain.\nimage_name: (c)\ndescription: The circuit is a differential pair with an active load, utilizing a five-transistor operational transconductance amplifier (OTA) configuration. The NMOS transistors M1 and M2 form the differential pair, while PMOS transistors M3 and M4 act as a current mirror load, enhancing the gain by combining the drain currents of M1 and M2.\n\nFigure 5.26 (a) Concept of combining the drain currents of $M_{1}$ and $M_{2}$, (b) realization of (a), and (c) response of the circuit to differential inputs.\n\nTo understand how $M_{3}$ enhances the gain, suppose the gate voltages of $M_{1}$ and $M_{2}$ change by equal and opposite amounts [Fig. 5.26(c)]. Consequently, $I_{D1}$ increases, $V_{F}$ decreases, and $I_{D2}$ decreases. Thus, the output voltage rises through two mechanisms: $M_{2}$ draws less current from $X$ to ground, and $M_{4}$ pushes more current from $V_{DD}$ to $X$. In contrast, in the circuit of Fig. 5.23(a), $M_{4}$ plays no active role in changing $V_{\\text{out}}$ because its gate voltage is constant. The five-transistor OTA is also known as a differential pair with an active load."
},
{
    "text": "Let's examine the operation of the five-transistor operational transconductance amplifier (OTA) under large-signal conditions. Initially, we substitute the ideal tail current source with a MOSFET, as depicted in Fig. 5.27(a). When the voltage at $V_{in1}$ is significantly more negative than at $V_{in2}$, transistor $M_{1}$ is turned off, and as a result, $M_{3}$ and $M_{4}$ are also non-conducting. Consequently, since no current flows from $V_{DD}$, both $M_{2}$ and $M_{5}$ are in the deep triode region and carry no current, leading to an output voltage of $V_{out} = 0$. As $V_{in1}$ nears $V_{in2}$, $M_{1}$ activates, siphoning a portion of $I_{D5}$ from $M_{3}$, thereby activating $M_{4}$. At this point, the output voltage depends on the disparity between $I_{D4}$ and $I_{D2}$. When the difference between $V_{in1}$ and $V_{in2}$ is minimal, both $M_{2}$ and $M_{4}$ are in saturation, delivering a high gain, as shown in Fig. 5.27(b). If $V_{in1}$ becomes more positive than $V_{in2}$, the currents $I_{D1}$, $|I_{D3}|$, and $|I_{D4}|$ increase while $I_{D2}$ decreases, enabling $V_{out}$ to increase and eventually forcing $M_{4}$ into the triode region. Should the difference $V_{in1} - V_{in2}$ be adequately large, $M_{2}$ switches off, $M_{4}$ operates in the deep triode region with zero current, and the output voltage $V_{out}$ equals $V_{DD}$."
},
{
    "text": "Let us examine the behavior of the five-transistor operational transconductance amplifier (OTA) under large-signal conditions. For this analysis, we substitute the ideal tail current source with a MOSFET, as depicted in Fig. 5.27(a). When the input voltage \\( V_{in1} \\) is significantly more negative than \\( V_{in2} \\), transistor \\( M_{1} \\) is turned off, and consequently, \\( M_{3} \\) and \\( M_{4} \\) are also non-conducting. Without any current flowing from \\( V_{DD} \\), both \\( M_{2} \\) and \\( M_{5} \\) operate in the deep triode region, conducting no current. Consequently, the output voltage \\( V_{out} \\) is zero. As \\( V_{in1} \\) nears \\( V_{in2} \\), \\( M_{1} \\) activates, siphoning a portion of \\( I_{D5} \\) from \\( M_{3} \\) and activating \\( M_{4} \\). The output voltage then becomes dependent on the difference between \\( I_{D4} \\) and \\( I_{D2} \\). For a small difference between \\( V_{in1} \\) and \\( V_{in2} \\), both \\( M_{2} \\) and \\( M_{4} \\) are in saturation, offering a high gain, as shown in Fig. 5.27(b). When \\( V_{in1} \\) becomes more positive than \\( V_{in2} \\), the currents \\( I_{D1} \\), \\( |I_{D3}| \\), and \\( |I_{D4}| \\) increase, while \\( I_{D2} \\) decreases, allowing \\( V_{out} \\) to rise and eventually forcing \\( M_{4} \\) into the triode region. If the difference between \\( V_{in1} \\) and \\( V_{in2} \\) is sufficiently large, \\( M_{2} \\) shuts off, \\( M_{4} \\) operates in the deep triode region with zero current, and \\( V_{out} \\) equals \\( V_{DD} \\). \n\nThe circuit depicted in Fig. 5.27(a) is a differential amplifier with an active current mirror load. Transistors \\( M_{1} \\) and \\( M_{2} \\) form a differential pair, \\( M_{3} \\) and \\( M_{4} \\) act as a current mirror, and \\( M_{5} \\) provides biasing. Figure 5.27(b) illustrates a large-signal input-output characteristic graph for a differential pair circuit, plotting the output voltage \\( V_{out} \\) against the differential input voltage \\( V_{in1} - V_{in2} \\). This graph is a voltage transfer characteristic curve, commonly used to describe the behavior of differential amplifiers. The x-axis represents the differential input voltage \\( V_{in1} - V_{in2} \\), and the y-axis represents the output voltage \\( V_{out} \\), both typically in volts. The graph is plotted with a linear scale on both axes. The curve starts at a low output voltage when \\( V_{in1} - V_{in2} \\) is negative, indicating that the output is initially low. As \\( V_{in1} - V_{in2} \\) increases, the output voltage \\( V_{out} \\) rises sharply, indicating a high-gain region. The curve eventually levels off, approaching the supply voltage \\( V_{DD} \\) as \\( V_{in1} - V_{in2} \\) becomes sufficiently positive. The graph shows a high-gain region where small changes in \\( V_{in1} - V_{in2} \\) result in large changes in \\( V_{out} \\). The curve is sigmoidal, with an initial flat region, a steep linear region, and a final saturation region. The saturation region occurs when \\( V_{out} \\) approaches \\( V_{DD} \\), indicating that the transistors are either in cutoff or deep triode region. The graph is annotated with a label indicating the 'High-Gain Region.' The output voltage \\( V_{out} \\) reaches \\( V_{DD} \\) in the saturation region, showing the limits of the output range.\n\nIf \\( V_{in1} \\) is greater than \\( V_{F} + V_{TH} \\), \\( M_{1} \\) enters the triode region. Also, \\( V_{out} \\) is in-phase with respect to \\( V_{in1} \\) but \\( 180^{\\circ} \\) out of phase with respect to \\( V_{in2} \\). The choice of the input common-mode voltage of the circuit is important. For \\( M_{2} \\) to be saturated, the output voltage cannot be less than \\( V_{in,CM} - V_{TH} \\). Thus, to allow maximum output swings, the input CM level must be as low as possible, with the minimum given by \\( V_{GS1,2} + V_{DS5,\\min} \\). The constraint imposed by the input CM level upon the output swing in this circuit is a critical drawback.\n\nThe output voltage of the circuit when \\( V_{in1} = V_{in2} \\) is \\( V_{F} = V_{DD} - |V_{GS3}| \\), assuming perfect symmetry. This can be proved by contradiction. If \\( V_{out} < V_{F} \\), then due to channel-length modulation, \\( M_{1} \\) must carry a greater current than \\( M_{2} \\) (and \\( M_{4} \\) a greater current than \\( M_{3} \\)). But this means that the total current through \\( M_{3} \\) also exceeds \\( I_{SS}/2 \\), violating the assumption that \\( M_{4} \\) carries more current than \\( M_{3} \\). In reality, asymmetries in the circuit may result in a large deviation in \\( V_{out} \\), possibly driving \\( M_{2} \\) or \\( M_{4} \\) into the triode region. For example, if the threshold voltage of \\( M_{2} \\) is slightly smaller than that of \\( M_{1} \\), the former carries a greater current than the latter even with \\( V_{in1} = V_{in2} \\), causing \\( V_{out} \\) to drop significantly. For this reason, the circuit is rarely used in an open-loop configuration to amplify small signals. Nonetheless, the open-loop OTA proves useful as a differential to a single-ended converter for large swings.\n\nThe five-transistor OTA can convert moderate-swing differential signals to a single-ended rail-to-rail signal by sensing swings equal to \\( V_{2} - V_{1} = 300 \\text{mV} \\). With proper choice of \\( (W/L)_{1,2} \\) and \\( I_{SS} \\), we can ensure that such a swing turns off one side. For instance, if \\( M_{1} \\) carries all of \\( I_{SS} \\), then \\( M_{2} \\) remains off, allowing \\( M_{4} \\) to pull \\( V_{out} \\) to \\( V_{DD} \\). Conversely, when \\( M_{2} \\) carries \\( I_{SS} \\), \\( M_{1} \\), \\( M_{2} \\), and \\( M_{4} \\) turn off, \\( M_{2} \\) and \\( M_{5} \\) remain on with zero current, and \\( V_{out} = 0 \\). The \"push-pull\" action between \\( M_{2} \\) and \\( M_{4} \\) thus produces rail-to-rail swings at the output.\n\nIn practice, \\( V_{out} \\) does not reach exactly \\( V_{DD} \\) or zero if \\( V_{1} > V_{TH1,2} \\). The proof is left as an exercise for the reader. (Hint: if \\( M_{2} \\) and \\( M_{5} \\) are in the deep triode region, then \\( V_{P} \\) approaches zero, possibly turning on \\( M_{1} \\).) For this reason, the OTA is typically followed by a CMOS inverter to obtain rail-to-rail swings.\n\nAssuming perfect symmetry, the output voltage of the circuit in Fig. 5.29(a) as \\( V_{DD} \\) varies from 3 V to zero is \\( V_{out} = V_{F} \\) for \\( V_{DD} = 3 \\text{V} \\). As \\( V_{DD} \\) drops, so do \\( V_{F} \\) and \\( V_{out} \\) with a slope close to unity [Fig. 5.29(b)]. As \\( V_{F} \\) and \\( V_{out} \\) fall below \\( +1.5 \\text{V} - V_{THN} \\), \\( M_{1} \\) and \\( M_{2} \\) enter the triode region, but their drain currents are constant if \\( M_{5} \\) is saturated. Further decrease in \\( V_{DD} \\) and hence \\( V_{F} \\) and \\( V_{out} \\) causes \\( V_{GS1} \\) and \\( V_{GS2} \\) to increase, eventually driving \\( M_{5} \\) into the triode region. Thereafter, the bias current of all of the transistors drops, lowering the rate at which \\( V_{out} \\) decreases. For \\( V_{DD} < |V_{THP}| \\), we have \\( V_{out} = 0 \\).\n\nSketching the large-signal input-output characteristic of the unity-gain buffer shown in Fig. 5.30(a) if the op amp is realized as a five-transistor OTA, we begin with \\( V_{in} = 0 \\) and note that \\( M_{1} \\), \\( M_{3} \\), and \\( M_{4} \\) are off. Thus, \\( M_{5} \\) enters the triode region with zero drain current and the diode-connected device \\( M_{2} \\) sustains a zero \\( V_{GS} \\). We therefore have \\( V_{out} = V_{P} = 0 \\) [Fig. 5.30(c)]. As \\( V_{in} \\) rises and exceeds one threshold, \\( M_{1} \\) begins to draw current from \\( M_{3} \\), turning \\( M_{4} \\) and hence \\( M_{2} \\) on. Note that, since \\( I_{D3} \\approx I_{D4} \\), we have \\( I_{D1} \\approx I_{D2} \\) and \\( V_{GS1} \\approx V_{GS2} \\). That is, \\( V_{out} \\approx V_{in} \\). This unity-gain action continues as \\( V_{in} \\) increases. For a sufficiently high \\( V_{in} \\), two phenomena occur: (a) \\( M_{1} \\) enters the triode region if \\( V_{in} > V_{DD} - |V_{GS3}| + V_{TH1} \\), and (b) \\( M_{4} \\) enters the triode region if \\( V_{out} > V_{DD} - |V_{GS4} - V_{TH4}| \\), and hence \\( V_{in} > V_{DD} - |V_{GS4} - V_{TH4}| \\). These two values are roughly equal if \\( V_{TH1} \\) and \\( |V_{TH4}| \\) are comparable. Beyond this point, \\( |I_{D4}| < |I_{D3}| \\) (why?), and hence \\( V_{GS1} > V_{GS2} \\), yielding \\( V_{out} < V_{in} \\). If \\( V_{in} = V_{DD} \\), then \\( M_{4} \\) carries little current and \\( V_{out} \\) incurs substantial error."
},
{
    "text": "We shall examine the behavior of the five-transistor operational transconductance amplifier (OTA) under large-signal conditions. To achieve this, we substitute the ideal tail current source with a MOSFET, as depicted in Fig. 5.27(a). When the voltage at the input \\( V_{i n 1} \\) is significantly more negative than \\( V_{i n 2} \\), transistor \\( M_{1} \\) is non-conducting, and consequently, \\( M_{3} \\) and \\( M_{4} \\) are also non-conducting. As a result, no current flows from \\( V_{D D} \\), and both \\( M_{2} \\) and \\( M_{5} \\) are in the deep triode region with zero current. Hence, the output voltage \\( V_{\\text {out }} \\) is zero. As \\( V_{i n 1} \\) nears \\( V_{i n 2} \\), \\( M_{1} \\) starts to conduct, drawing a portion of \\( I_{D 5} \\) from \\( M_{3} \\) and activating \\( M_{4} \\). The output voltage then depends on the difference between \\( I_{D 4} \\) and \\( I_{D 2} \\). When \\( V_{i n 1} \\) and \\( V_{i n 2} \\) are nearly equal, both \\( M_{2} \\) and \\( M_{4} \\) are in saturation, providing a high gain, as shown in Fig. 5.27(b). If \\( V_{i n 1} \\) is more positive than \\( V_{i n 2} \\), \\( I_{D 1} \\), \\( \\left|I_{D 3}\\right| \\), and \\( \\left|I_{D 4}\\right| \\) increase, while \\( I_{D 2} \\) decreases, causing \\( V_{\\text {out }} \\) to rise and eventually forcing \\( M_{4} \\) into the triode region. When \\( V_{i n 1}-V_{i n 2} \\) is sufficiently large, \\( M_{2} \\) shuts off, \\( M_{4} \\) operates in the deep triode region with zero current, and \\( V_{\\text {out }}=V_{D D} \\).\n\nThe circuit illustrated in Fig. 5.27(a) is a differential amplifier featuring an active current mirror load. Transistors \\( M_{1} \\) and \\( M_{2} \\) form a differential pair, \\( M_{3} \\) and \\( M_{4} \\) serve as a current mirror, and \\( M_{5} \\) provides biasing. Figure 5.27(b) presents a large-signal input-output characteristic graph for a differential pair circuit, plotting the output voltage \\( V_{out} \\) against the differential input voltage \\( V_{in1} - V_{in2} \\).\n\nIn Fig. 5.28, \\( M_{1} \\) and \\( M_{2} \\) detect swings equal to \\( V_{2}-V_{1}=300 \\mathrm{mV} \\). By selecting appropriate \\( (W / L)_{1,2} \\) and \\( I_{S S} \\), one can ensure that such a swing turns off one side. For instance, if \\( M_{1} \\) conducts all of \\( I_{S S} \\), then \\( M_{2} \\) remains off, enabling \\( M_{4} \\) to pull \\( V_{\\text {out }} \\) to \\( V_{D D} \\). Conversely, when \\( M_{2} \\) dominates \\( I_{S S} \\), \\( M_{1} \\), \\( M_{2} \\), and \\( M_{4} \\) turn off, \\( M_{2} \\) and \\( M_{5} \\) remain on with zero current, resulting in \\( V_{\\text {out }}=0 \\). The \"push-pull\" action between \\( M_{2} \\) and \\( M_{4} \\) thus generates rail-to-rail swings at the output.\n\nFor \\( V_{D D}=3 \\mathrm{~V} \\), symmetry dictates that \\( V_{\\text {out }}=V_{F} \\). As \\( V_{D D} \\) decreases, \\( V_{F} \\) and \\( V_{\\text {out }} \\) also decrease with a slope close to unity, as shown in Fig. 5.29(b). As \\( V_{F} \\) and \\( V_{\\text {out }} \\) fall below \\( +1.5 \\mathrm{~V}-V_{T H N} \\), \\( M_{1} \\) and \\( M_{2} \\) enter the triode region, but their drain currents remain constant if \\( M_{5} \\) is saturated. Further reduction in \\( V_{D D} \\) and therefore \\( V_{F} \\) and \\( V_{\\text {out }} \\) leads to an increase in \\( V_{G S 1} \\) and \\( V_{G S 2} \\), ultimately driving \\( M_{5} \\) into the triode region. Thereafter, the bias current of all transistors diminishes, slowing the rate at which \\( V_{\\text {out }} \\) decreases. For \\( V_{D D}<\\left|V_{T H P}\\right| \\), \\( V_{\\text {out }} \\) is zero.\n\nIn Fig. 5.30(a), starting with \\( V_{i n}=0 \\), \\( M_{1} \\), \\( M_{3} \\), and \\( M_{4} \\) are off. Thus, \\( M_{5} \\) enters the triode region with zero drain current, and the diode-connected device \\( M_{2} \\) maintains a zero \\( V_{G S} \\). Consequently, \\( V_{\\text {out }}=V_{P}=0 \\), as shown in Fig. 5.30(c). As \\( V_{\\text {in }} \\) rises and surpasses one threshold, \\( M_{1} \\) begins to draw current from \\( M_{3} \\), turning \\( M_{4} \\) and hence \\( M_{2} \\) on. Since \\( I_{D 3} \\approx I_{D 4} \\), \\( I_{D 1} \\approx I_{D 2} \\) and \\( V_{G S 1} \\approx V_{G S 2} \\), implying \\( V_{\\text {out }} \\approx V_{\\text {in }} \\). This unity-gain action persists as \\( V_{i n} \\) increases. For a sufficiently high \\( V_{i n} \\), two phenomena occur: (a) \\( M_{1} \\) enters the triode region if \\( V_{\\text {in }}>V_{D D}-\\left|V_{G S 3}\\right|+V_{T H 1} \\), and (b) \\( M_{4} \\) enters the triode region if \\( V_{\\text {out }}>V_{D D}-\\left|V_{G S 4}-V_{T H 4}\\right| \\), meaning \\( V_{i n}>V_{D D}-\\left|V_{G S 4}-V_{T H 4}\\right| \\). These two values are roughly equal if \\( V_{T H 1} \\) and \\( \\left|V_{T H 4}\\right| \\) are comparable. Beyond this point, \\( \\left|I_{D 4}\\right|<\\left|I_{D 3}\\right| \\) (why?), resulting in \\( V_{G S 1}>V_{G S 2} \\) and \\( V_{\\text {out }}<V_{i n} \\). If \\( V_{i n}=V_{D D} \\), then \\( M_{4} \\) carries little current, and \\( V_{\\text {out }} \\) incurs significant error."
},
{
    "text": "We shall examine the behavior of a five-transistor operational transconductance amplifier (OTA) under large-signal conditions. To do this, we simulate the ideal tail current source with a MOSFET, as depicted in Fig. 5.27(a). When the input voltage $V_{i n 1}$ is significantly more negative than $V_{i n 2}$, transistor $M_{1}$ is non-conducting, and as a result, $M_{3}$ and $M_{4}$ are also non-conducting. With no current flowing from $V_{D D}$, both $M_{2}$ and $M_{5}$ are in the deep triode region and carry no current. Consequently, the output voltage $V_{\\text {out }}$ is zero. As $V_{i n 1}$ nears $V_{i n 2}$, $M_{1}$ starts to conduct, drawing a portion of $I_{D 5}$ from $M_{3}$ and activating $M_{4}$. The output voltage then becomes dependent on the difference between $I_{D 4}$ and $I_{D 2}$. For a small differential between $V_{i n 1}$ and $V_{i n 2}$, both $M_{2}$ and $M_{4}$ are in saturation, providing a high gain, as shown in Fig. 5.27(b). When $V_{i n 1}$ becomes more positive than $V_{i n 2}$, the currents $I_{D 1}$, $\\left|I_{D 3}\\right|$, and $\\left|I_{D 4}\\right|$ increase, while $I_{D 2}$ decreases, allowing $V_{\\text {out }}$ to rise and eventually forcing $M_{4}$ into the triode region. If the difference $V_{i n 1}-V_{i n 2}$ is sufficiently large, $M_{2}$ shuts off, $M_{4}$ operates in the deep triode region with zero current, and $V_{\\text {out }}$ equals $V_{D D}$. \n\nThe circuit represented in the images is a differential amplifier featuring an active current mirror load. Transistors $M_{1}$ and $M_{2}$ form a differential pair, $M_{3}$ and $M_{4}$ act as a current mirror, and $M_{5}$ provides biasing. Figure 5.27(b) illustrates a large-signal input-output characteristic graph for a differential pair circuit, plotting the output voltage $V_{out}$ against the differential input voltage $V_{in1} - V_{in2}$.\n\nThe graph is a voltage transfer characteristic curve, commonly used to describe the behavior of differential amplifiers. The x-axis represents the differential input voltage $V_{in1} - V_{in2}$, typically in volts, while the y-axis represents the output voltage $V_{out}$, also in volts. The graph is plotted on a linear scale for both axes. The curve starts at a low output voltage when $V_{in1} - V_{in2}$ is negative, indicating an initial low output. As $V_{in1} - V_{in2}$ increases, the output voltage $V_{out}$ rises sharply, indicating a high-gain region. The curve eventually levels off, approaching the supply voltage $V_{DD}$ as $V_{in1} - V_{in2}$ becomes sufficiently positive. The graph shows a high-gain region where small changes in $V_{in1} - V_{in2}$ result in large changes in $V_{out}$. The curve is sigmoidal, with an initial flat region, a steep linear region, and a final saturation region. The saturation region occurs when $V_{out}$ approaches $V_{DD}$, indicating that the transistors are either in cutoff or deep triode region. The graph is annotated with a label indicating the 'High-Gain Region'. The output voltage $V_{out}$ reaches $V_{DD}$ in the saturation region, showing the limits of the output range.\n\nNote that if $V_{i n 1}>V_{F}+V_{T H}$, then $M_{1}$ enters the triode region. Also, $V_{\\text {out }}$ is in-phase with respect to $V_{i n 1}$ but $180^{\\circ}$ out of phase with respect to $V_{i n 2}$. The choice of the input common-mode voltage of the circuit is also important. For $M_{2}$ to be saturated, the output voltage cannot be less than $V_{i n, C M}-V_{T H}$. Thus, to allow maximum output swings, the input CM level must be as low as possible, with the minimum given by $V_{G S 1,2}+V_{D S 5, \\min }$. The constraint imposed by the input CM level upon the output swing in this circuit is a critical drawback.\n\nWhen $V_{\\text {in1 }}=V_{\\text {in } 2}$, the output voltage of the circuit, assuming perfect symmetry, is $V_{\\text {out }}=V_{F}=$ $V_{D D}-\\left|V_{G S 3}\\right|$. This can be proved by contradiction as well. Suppose, for example, that $V_{\\text {out }}<V_{F}$. Then, due to channel-length modulation, $M_{1}$ must carry a greater current than $M_{2}$ (and $M_{4}$ a greater current than $M_{3}$). In other words, the total current through $M_{1}$ is greater than half of $I_{S S}$. But this means that the total current through $M_{3}$ also exceeds $I_{S S} / 2$, violating the assumption that $M_{4}$ carries more current than $M_{3}$. In reality, however, asymmetries in the circuit may result in a large deviation in $V_{\\text {out }}$, possibly driving $M_{2}$ or $M_{4}$ into the triode region. For example, if the threshold voltage of $M_{2}$ is slightly smaller than that of $M_{1}$, the former carries a greater current than the latter even with $V_{i n 1}=V_{i n 2}$, causing $V_{\\text {out }}$ to drop significantly. For this reason, the circuit is rarely used in an open-loop configuration to amplify small signals. Nonetheless, the open-loop OTA proves useful as a differential to a single-ended converter for large swings, as illustrated by the following example.\n\n#### Example 5.8\n\nSome digital circuits operate with differential (complementary) signals having voltage swings less than $V_{D D}$. For example, the single-ended swing can be $300 \\mathrm{mV}_{p p}$. Explain how a five-transistor OTA can convert the moderate-swing differential signals to a single-ended rail-to-rail signal.\n\n#### Solution\n\nConsider the OTA shown in Fig. 5.28, where $M_{1}$ and $M_{2}$ sense swings equal to $V_{2}-V_{1}=300 \\mathrm{mV}$. With proper choice of $(W / L)_{1,2}$ and $I_{S S}$, we can guarantee that such a swing turns off one side. For example, if $M_{1}$ carries all of $I_{S S}$, then $M_{2}$ remains off, allowing $M_{4}$ to pull $V_{\\text {out }}$ to $V_{D D}$. Conversely, when $M_{2}$ hogs $I_{S S}, M_{1}, M_{2}$, and $M_{4}$ turn off, $M_{2}$ and $M_{5}$ remain on with zero current, and $V_{\\text {out }}=0$. The \"push-pull\" action between $M_{2}$ and $M_{4}$ thus produces rail-to-rail swings at the output.\n\nIn practice, $V_{\\text {out }}$ does not reach exactly $V_{D D}$ or zero if $V_{1}>V_{T H 1,2}$. The proof is left as an exercise for the reader. (Hint: if $M_{2}$ and $M_{5}$ are in the deep triode region, then $V_{P}$ approaches zero, possibly turning on $M_{1}$.) For this reason, the OTA is typically followed by a CMOS inverter to obtain rail-to-rail swings.\n\n#### Example 5.9\n\nAssuming perfect symmetry, sketch the output voltage of the circuit in Fig. 5.29(a) as $V_{D D}$ varies from 3 V to zero. Assume that for $V_{D D}=3 \\mathrm{~V}$, all of the devices are saturated.\nimage_name:(a)\ndescription:\n[\nname: M1, type: NMOS, ports: {S: P, D: F, G: Vip}\nname: M2, type: NMOS, ports: {S: P, D: Vout, G: Vin}\nname: M3, type: PMOS, ports: {S: VDD, D: F, G: F}\nname: M4, type: PMOS, ports: {S: VDD, D: Vout, G: F}\nname: M5, type: NMOS, ports: {S: GND, D: P, G: Vb}\n]\nextrainfo:The circuit is a differential amplifier with PMOS current mirror load. M1 and M2 form the differential pair, while M3 and M4 form the current mirror. M5 acts as a current source.\nimage_name:(b)\ndescription:The graph in Figure 5.29(b) is a plot of the output voltage \\( V_{\\text{out}} \\) versus the supply voltage \\( V_{DD} \\). It is a linear graph depicting how the output voltage changes as \\( V_{DD} \\) varies from 0 to 3 volts.\n\n1. **Type of Graph and Function:**\n- The graph is a linear plot.\n- It represents the relationship between the output voltage \\( V_{\\text{out}} \\) and the supply voltage \\( V_{DD} \\).\n\n2. **Axes Labels and Units:**\n- The horizontal axis represents \\( V_{DD} \\) in volts, ranging from 0 to +3 V.\n- The vertical axis represents \\( V_{\\text{out}} \\) in volts.\n\n3. **Overall Behavior and Trends:**\n- The graph shows an increasing trend of \\( V_{\\text{out}} \\) as \\( V_{DD} \\) increases.\n- Initially, at low values of \\( V_{DD} \\), the slope is gentle, indicating a slower increase in \\( V_{\\text{out}} \\).\n- As \\( V_{DD} \\) approaches 3 V, the slope becomes steeper, indicating a more rapid increase in \\( V_{\\text{out}} \\).\n- The graph suggests that \\( V_{\\text{out}} \\) reaches a maximum value of \\( 3V - |V_{GS3}| \\) when \\( V_{DD} \\) is +3 V.\n\n4. **Key Features and Technical Details:**\n- The graph crosses the \\( V_{DD} \\) axis at \\( V_{THP} \\), which is the threshold voltage for the PMOS.\n- The slope of the graph is close to unity beyond \\( V_{THP} \\), indicating a linear relationship between \\( V_{DD} \\) and \\( V_{\\text{out}} \\).\n\n5. **Annotations and Specific Data Points:**\n- The graph is annotated with \\( 3V - |V_{GS3}| \\) as the maximum \\( V_{\\text{out}} \\) value.\n- The threshold voltage \\( V_{THP} \\) is marked on the \\( V_{DD} \\) axis, indicating where the output starts to increase significantly.\n\nFigure 5.29\n\n#### Solution\n\nFor $V_{D D}=3 \\mathrm{~V}$, symmetry requires that $V_{\\text {out }}=V_{F}$. As $V_{D D}$ drops, so do $V_{F}$ and $V_{\\text {out }}$ with a slope close to unity [Fig. 5.29(b)]. As $V_{F}$ and $V_{\\text {out }}$ fall below $+1.5 \\mathrm{~V}-V_{T H N}, M_{1}$ and $M_{2}$ enter the triode region, but their drain currents are constant if $M_{5}$ is saturated. Further decrease in $V_{D D}$ and hence $V_{F}$ and $V_{\\text {out }}$ causes $V_{G S 1}$ and $V_{G S 2}$ to increase, eventually driving $M_{5}$ into the triode region. Thereafter, the bias current of all of the transistors drops, lowering the rate at which $V_{\\text {out }}$ decreases. For $V_{D D}<\\left|V_{T H P}\\right|$, we have $V_{\\text {out }}=0$.\n\n#### Example 5.10\n\nSketch the large-signal input-output characteristic of the unity-gain buffer shown in Fig. 5.30(a) if the op amp is realized as a five-transistor OTA.\nimage_name:Figure 5.30(a)\ndescription:\n[\nname: A, type: OpAmp, value: A, ports: {InP: Vin, InN: Vout, OutP: Vout}\n]\nextrainfo:The circuit is a unity-gain buffer using a five-transistor operational transconductance amplifier (OTA). The op-amp is configured with feedback to maintain Vout equal to Vin.\nimage_name:Figure 5.30(b)\ndescription:\n[\nname: M1, type: NMOS, ports: {S: P, D: d1d3g3g4, G: Vin}\nname: M2, type: NMOS, ports: {S: P, D: Vout, G: Vout}\nname: M3, type: PMOS, ports: {S: VDD, D: d1d3g3g4, G: d1d3g3g4}\nname: M4, type: PMOS, ports: {S: VDD, D: Vout, G: d1d3g3g4}\nname: M5, type: NMOS, ports: {S: GND, D: P, G: Vb}\n]\nextrainfo:The circuit is a unity-gain buffer using a five-transistor operational transconductance amplifier (OTA). M5 acts as a current source, and M1 and M2 form a differential pair. M3 and M4 are active loads. The output voltage Vout is fed back to the input of the op-amp to maintain unity gain.\nimage_name:Figure 5.30(c)\ndescription:The graph in Figure 5.30(c) represents the large-signal input-output characteristic of a unity-gain buffer using a five-transistor operational transconductance amplifier (OTA). This is a voltage transfer characteristic graph.\n\n1. **Type of Graph and Function:**\n- The graph is a voltage transfer characteristic curve showing the relationship between input voltage (V_in) and output voltage (V_out).\n\n2. **Axes Labels and Units:**\n- The horizontal axis represents the input voltage, V_in.\n- The vertical axis represents the output voltage, V_out.\n- Both axes are likely in volts, though specific units are not labeled on the graph.\n\n3. **Overall Behavior and Trends:**\n- The graph starts at the origin, indicating that when V_in is zero, V_out is also zero.\n- As V_in increases, V_out initially rises slowly, indicating a non-linear region at low input voltages.\n- After surpassing a certain threshold voltage (V_TH), the curve becomes linear, indicating that V_out approximately equals V_in. This is the expected behavior for a unity-gain buffer.\n- As V_in continues to increase, the graph shows a deviation from the linear behavior, indicating that M_4 enters the triode region, which affects the linearity.\n\n4. **Key Features and Technical Details:**\n- The threshold voltage (V_TH) is marked on the graph, showing the point where the behavior changes from non-linear to linear.\n- The linear region is depicted with a dashed line, representing the ideal V_out = V_in line.\n- The point where M_4 enters the triode region is annotated, indicating the onset of non-linearity due to this transistor's behavior.\n\n5. **Annotations and Specific Data Points:**\n- Annotations indicate the transition points such as V_TH and the region where M_4 enters the triode region, highlighting the non-ideal behavior at higher input voltages.\n- The ideal linear behavior is illustrated with a dashed line for reference, showing how actual performance deviates from the ideal as conditions change.\n\n#### Solution\n\nDrawing the circuit as shown in Fig. 5.30(b), we begin with $V_{i n}=0$ and note that $M_{1}, M_{3}$, and $M_{4}$ are off. Thus, $M_{5}$ enters the triode region with zero drain current and the diode-connected device $M_{2}$ sustains a zero $V_{G S} .{ }^{4}$ We therefore have $V_{\\text {out }}=V_{P}=0[$ Fig. 5.30 (c) $]$. As $V_{\\text {in }}$ rises and exceeds one threshold, $M_{1}$ begins to draw current from $M_{3}$,\n\nturning $M_{4}$ and hence $M_{2}$ on. Note that, since $I_{D 3} \\approx I_{D 4}$, we have $I_{D 1} \\approx I_{D 2}$ and $V_{G S 1} \\approx V_{G S 2}$. That is, $V_{\\text {out }} \\approx V_{\\text {in }}$. This unity-gain action continues as $V_{i n}$ increases. For a sufficiently high $V_{i n}$, two phenomena occur: (a) $M_{1}$ enters the triode region if $V_{\\text {in }}>V_{D D}-\\left|V_{G S 3}\\right|+V_{T H 1}$, and (b) $M_{4}$ enters the triode region if $V_{\\text {out }}>V_{D D}-\\left|V_{G S 4}-V_{T H 4}\\right|$, and hence $V_{i n}>V_{D D}-\\left|V_{G S 4}-V_{T H 4}\\right|$. These two values are roughly equal if $V_{T H 1}$ and"
},
{
    "text": "Let's delve into the analysis of the OTA's behavior with a non-ideal tail current source, as depicted in Fig. 5.27(a). In this scenario, we substitute the ideal tail current source with a MOSFET. When the voltage of $V_{in1}$ is significantly lower than $V_{in2}$, transistor $M_1$ is non-conducting, and consequently, $M_3$ and $M_4$ are also turned off. Due to the absence of current flow from $V_{DD}$, both $M_2$ and $M_5$ are in the deep triode region, carrying no current. As a result, the output voltage $V_{out}$ is zero. As $V_{in1}$ nears $V_{in2}$, $M_1$ starts to conduct, diverting a portion of $I_{D5}$ from $M_3$ and activating $M_4$. The output voltage then hinges on the disparity between $I_{D4}$ and $I_{D2}$. For a negligible difference between $V_{in1}$ and $V_{in2}$, both $M_2$ and $M_4$ are in saturation, delivering a high gain, as illustrated in Fig. 5.27(b). When $V_{in1}$ surpasses $V_{in2}$, $I_{D1}$, the absolute values of $I_{D3}$, and $I_{D4}$ surge, whereas $I_{D2}$ diminishes, enabling $V_{out}$ to escalate and ultimately forcing $M_4$ into the triode region. Should the difference between $V_{in1}$ and $V_{in2}$ be adequately substantial, $M_2$ shuts off, $M_4$ operates in the deep triode region without any current, and $V_{out}$ equals $V_{DD}$.\n\nThe additional information reveals that the circuit is a differential amplifier equipped with an active current mirror load. Transistors $M_1$ and $M_2$ constitute a differential pair, $M_3$ and $M_4$ function as a current mirror, and $M_5$ provides biasing. Fig. 5.27(b) presents a graph depicting the large-signal input-output characteristics of a differential pair circuit, plotting the output voltage $V_{out}$ against the differential input voltage $V_{in1} - V_{in2}$.\n\nThe graph illustrates the voltage transfer characteristic curve, a common representation of differential amplifiers' behavior. The x-axis denotes the differential input voltage $V_{in1} - V_{in2}$, usually in volts, while the y-axis represents the output voltage $V_{out}$, also in volts. The graph employs a linear scale on both axes.\n\nThe curve's overall behavior shows a low output voltage at negative $V_{in1} - V_{in2}$, suggesting an initial low output. As $V_{in1} - V_{in2}$ rises, $V_{out}$ climbs steeply, signifying a high-gain region. Eventually, the curve flattens out, approaching the supply voltage $V_{DD}$ as $V_{in1} - V_{in2}$ becomes sufficiently positive.\n\nKey features include a high-gain region where minor fluctuations in $V_{in1} - V_{in2}$ induce significant changes in $V_{out}$. The curve is sigmoidal, with an initial flat segment, a steep linear section, and a concluding saturation region. Saturation occurs when $V_{out}$ nears $V_{DD}$, indicating that the transistors are either in cutoff or deep triode region.\n\nAnnotations on the graph mark the 'High-Gain Region', and specific data points show that $V_{out}$ reaches $V_{DD}$ in the saturation region, demarcating the output's limits.\n\nThe circuit's input common-mode voltage selection is crucial. For $M_2$ to saturate, the output voltage must not drop below $V_{in,CM} - V_{TH}$. Hence, to enable maximum output swings, the input CM level should be as low as feasible, with the minimum value dictated by $V_{GS1,2} + V_{DS5,min}$. The constraint imposed by the input CM level on the output swing is a notable disadvantage of this circuit.\n\nWhen $V_{in1}$ equals $V_{in2}$, the output voltage under perfect symmetry is $V_F = V_{DD} - |V_{GS3}|$. This can be demonstrated by contradiction. For instance, if $V_{out} < V_F$, channel-length modulation necessitates that $M_1$ carries more current than $M_2$ (and $M_4$ more than $M_3$). In other words, the total current through $M_1$ exceeds half of $I_{SS}$. But this implies that the total current through $M_3$ also surpasses $I_{SS}/2$, contradicting the assumption that $M_4$ carries more current than $M_3$. However, actual circuit asymmetries may cause a substantial deviation in $V_{out}$, potentially forcing $M_2$ or $M_4$ into the triode region. For example, if $M_2$'s threshold voltage is slightly less than $M_1$'s, the former carries more current than the latter even with $V_{in1} = V_{in2}$, causing $V_{out}$ to plummet significantly. Therefore, this circuit is infrequently used in an open-loop configuration for amplifying small signals. Nonetheless, the open-loop OTA serves as a valuable differential-to-single-ended converter for large swings, as demonstrated in the subsequent example.\n\n#### Example 5.8\n\nSome digital circuits utilize differential (complementary) signals with voltage swings less than $V_{DD}$. For instance, the single-ended swing can be $300 \\mathrm{mV}_{pp}$. Explain how a five-transistor OTA can transform moderate-swing differential signals into a single-ended rail-to-rail signal.\n\n#### Solution\n\nRefer to the OTA depicted in Fig. 5.28, where $M_1$ and $M_2$ detect swings equivalent to $V_2 - V_1 = 300 \\mathrm{mV}$. By choosing appropriate $(W/L)_{1,2}$ and $I_{SS}$ values, we can ensure that such swings deactivate one side. For example, if $M_1$ conducts the entire $I_{SS}$, $M_2$ remains inactive, allowing $M_4$ to pull $V_{out}$ to $V_{DD}$. Conversely, when $M_2$ dominates $I_{SS}$, $M_1$, $M_2$, and $M_4$ turn off, $M_2$ and $M_5$ stay on with zero current, resulting in $V_{out} = 0$. The \"push-pull\" action between $M_2$ and $M_4$ thereby generates rail-to-rail swings at the output.\n\nIn practice, $V_{out}$ does not reach exactly $V_{DD}$ or zero if $V_1 > V_{TH1,2}$. The proof is left as an exercise for the reader. (Hint: if $M_2$ and $M_5$ are in the deep triode region, then $V_P$ approaches zero, potentially turning on $M_1$.) Consequently, the OTA is commonly followed by a CMOS inverter to achieve rail-to-rail swings.\n\n#### Example 5.9\n\nAssuming perfect symmetry, sketch the output voltage of the circuit in Fig. 5.29(a) as $V_{DD}$ varies from 3 V to zero. Presume that for $V_{DD} = 3 \\mathrm{~V}$, all devices are saturated.\n\n#### Solution\n\nFor $V_{DD} = 3 \\mathrm{~V}$, symmetry dictates that $V_{out} = V_F$. As $V_{DD}$ decreases, so do $V_F$ and $V_{out}$ with a slope close to unity [Fig. 5.29(b)]. As $V_F$ and $V_{out}$ fall below $+1.5 \\mathrm{~V} - V_{THN}$, $M_1$ and $M_2$ enter the triode region, but their drain currents remain constant if $M_5$ is saturated. Further reduction in $V_{DD}$ and, consequently, $V_F$ and $V_{out}$ causes $V_{GS1}$ and $V_{GS2}$ to increase, eventually driving $M_5$ into the triode region. Thereafter, the bias current of all transistors diminishes, slowing the rate of $V_{out}$ decrease. For $V_{DD} < |V_{THP}|$, we have $V_{out} = 0$.\n\n#### Example 5.10\n\nSketch the large-signal input-output characteristic of the unity-gain buffer shown in Fig. 5.30(a) if the op amp is realized as a five-transistor OTA.\n\n#### Solution\n\nBy depicting the circuit as shown in Fig. 5.30(b), we start with $V_{in} = 0$ and observe that $M_1$, $M_3$, and $M_4$ are off. Consequently, $M_5$ enters the triode region with zero drain current, and the diode-connected device $M_2$ maintains a zero $V_{GS}$. Hence, $V_{out} = V_P = 0$ [Fig. 5.30(c)]. As $V_{in}$ increases and surpasses one threshold, $M_1$ begins to draw current from $M_3$, activating $M_4$ and, consequently, $M_2$. Note that, since $I_{D3} \\approx I_{D4}$, we have $I_{D1} \\approx I_{D2}$ and $V_{GS1} \\approx V_{GS2}$. That is, $V_{out} \\approx V_{in}$. This unity-gain action persists as $V_{in}$ rises. For a sufficiently high $V_{in}$, two phenomena arise: (a) $M_1$ enters the triode region if $V_{in} > V_{DD} - |V_{GS3}| + V_{TH1}$, and (b) $M_4$ enters the triode region if $V_{out} > V_{DD} - |V_{GS4} - V_{TH4}|$, and thus $V_{in} > V_{DD} - |V_{GS4} - V_{TH4}|$. These two values are approximately equal if $V_{TH1}$ and $|V_{TH4}|$ are similar. Beyond this point, $|I_{D4}| < |I_{D3}|$ (why?), and hence $V_{GS1} > V_{GS2}$, leading to $V_{out} < V_{in}$. If $V_{in} = V_{DD}$, then $M_4$ conducts minimal current, and $V_{out}$ incurs significant error."
},
{
    "text": "Let us delve into the examination of the large-signal characteristics of a five-transistor operational transconductance amplifier (OTA). For this purpose, we substitute the ideal tail current source with a MOSFET, as depicted in Fig. 5.27(a). When the voltage at the input $V_{i n 1}$ is significantly more negative than $V_{i n 2}$, transistor $M_{1}$ is in the off state, and so are $M_{3}$ and $M_{4}$. As a result, with no current flowing from $V_{D D}$, both $M_{2}$ and $M_{5}$ are in the deep triode region, with zero current flowing through them. Consequently, the output voltage $V_{\\text {out }}$ is zero. As $V_{i n 1}$ nears $V_{i n 2}$, $M_{1}$ switches on, sourcing a fraction of $I_{D 5}$ from $M_{3}$, thereby activating $M_{4}$. The output voltage then becomes dependent on the disparity between $I_{D 4}$ and $I_{D 2}$. When there is a small difference between $V_{i n 1}$ and $V_{i n 2}$, both $M_{2}$ and $M_{4}$ are in saturation, yielding a high gain, as shown in Fig. 5.27(b). As $V_{i n 1}$ becomes more positive than $V_{i n 2}$, the currents $I_{D 1}$, $\\left|I_{D 3}\\right|$, and $\\left|I_{D 4}\\right|$ increase while $I_{D 2}$ decreases, causing $V_{\\text {out }}$ to rise and eventually pushing $M_{4}$ into the triode region. If the difference $V_{i n 1}-V_{i n 2}$ is adequately large, $M_{2}$ switches off, $M_{4}$ operates in the deep triode region with zero current, and $V_{\\text {out }}$ equals $V_{D D}$.\n\nIn Fig. 5.27(a), we observe a differential amplifier equipped with an active current mirror load. Transistors $M_{1}$ and $M_{2}$ constitute a differential pair, $M_{3}$ and $M_{4}$ function as a current mirror, and $M_{5}$ provides biasing. Figure 5.27(b) illustrates a large-signal input-output characteristic graph for a differential pair circuit, plotting the output voltage $V_{out}$ against the differential input voltage $V_{in1} - V_{in2}$.\n\nThis graph is a voltage transfer characteristic curve, commonly utilized to illustrate the behavior of differential amplifiers. The x-axis represents the differential input voltage $V_{in1} - V_{in2}$, usually in volts, while the y-axis represents the output voltage $V_{out}$, also in volts. The plot is drawn with a linear scale on both axes.\n\nThe curve starts at a low output voltage when $V_{in1} - V_{in2}$ is negative, signifying that the output is initially low. As $V_{in1} - V_{in2}$ increases, the output voltage $V_{out}$ rises sharply, indicating a high-gain region. The curve eventually flattens out, approaching the supply voltage $V_{DD}$ as $V_{in1} - V_{in2}$ becomes sufficiently positive.\n\nKey features of the graph include a high-gain region where minor changes in $V_{in1} - V_{in2}$ result in significant changes in $V_{out}$. The curve exhibits a sigmoidal shape, with an initial flat region, a steep linear region, and a final saturation region. The saturation region occurs when $V_{out}$ approaches $V_{DD}$, indicating that the transistors are either in cutoff or deep triode region. The graph is annotated with a label marking the 'High-Gain Region', and the output voltage $V_{out}$ reaches $V_{DD}$ in the saturation region, demonstrating the limits of the output range.\n\nIt is important to note that the input common-mode voltage of the circuit plays a crucial role. For $M_{2}$ to be saturated, the output voltage cannot be less than $V_{i n, C M}-V_{T H}$. Therefore, to enable maximum output swings, the input CM level must be as low as possible, with the minimum determined by $V_{G S 1,2}+V_{D S 5, \\min }$. The constraint imposed by the input CM level on the output swing is a significant drawback of this circuit.\n\nWhen $V_{i n 1}=V_{i n 2}$, the output voltage of the circuit is $V_{F}=$ $V_{D D}-\\left|V_{G S 3}\\right|$, assuming perfect symmetry. This can be proven by contradiction. If $V_{\\text {out }}<V_{F}$, then due to channel-length modulation, $M_{1}$ must carry a greater current than $M_{2}$ (and $M_{4}$ a greater current than $M_{3}$). This implies that the total current through $M_{1}$ exceeds half of $I_{S S}$, which in turn means that the total current through $M_{3}$ also surpasses $I_{S S} / 2$, contradicting the assumption that $M_{4}$ carries more current than $M_{3}$. However, in reality, asymmetries in the circuit may lead to a substantial deviation in $V_{\\text {out }}$, potentially driving $M_{2}$ or $M_{4}$ into the triode region. For instance, if the threshold voltage of $M_{2}$ is slightly smaller than that of $M_{1}$, the former carries a greater current than the latter even with $V_{i n 1}=V_{i n 2}$, causing $V_{\\text {out }}$ to drop significantly. Due to this reason, the circuit is rarely employed in an open-loop configuration to amplify small signals. Nonetheless, the open-loop OTA is valuable as a differential to single-ended converter for large swings, as demonstrated in the following example.\n\n#### Example 5.8\n\nSome digital circuits operate with differential (complementary) signals having voltage swings less than $V_{D D}$. For instance, the single-ended swing can be $300 \\mathrm{mV}_{p p}$. Explain how a five-transistor OTA can convert moderate-swing differential signals to a single-ended rail-to-rail signal.\n\n#### Solution\n\nConsider the OTA depicted in Fig. 5.28, where $M_{1}$ and $M_{2}$ sense swings equal to $V_{2}-V_{1}=300 \\mathrm{mV}$. By selecting appropriate $(W / L)_{1,2}$ and $I_{S S}$ values, we can ensure that such a swing switches off one side. For example, if $M_{1}$ carries all of $I_{S S}$, then $M_{2}$ remains off, allowing $M_{4}$ to pull $V_{\\text {out }}$ to $V_{D D}$. Conversely, when $M_{2}$ dominates $I_{S S}$, $M_{1}$, $M_{2}$, and $M_{4}$ switch off, $M_{2}$ and $M_{5}$ remain on with zero current, and $V_{\\text {out }}=0$. The \"push-pull\" action between $M_{2}$ and $M_{4}$ thus generates rail-to-rail swings at the output.\n\nIn practice, $V_{\\text {out }}$ does not reach exactly $V_{D D}$ or zero if $V_{1}>V_{T H 1,2}$. The proof of this is left as an exercise for the reader. (Hint: if $M_{2}$ and $M_{5}$ are in the deep triode region, then $V_{P}$ approaches zero, potentially turning on $M_{1}$.) For this reason, the OTA is typically followed by a CMOS inverter to achieve rail-to-rail swings.\n\n#### Example 5.9\n\nAssuming perfect symmetry, sketch the output voltage of the circuit in Fig. 5.29(a) as $V_{D D}$ varies from 3 V to zero. Assume that for $V_{D D}=3 \\mathrm{~V}$, all of the devices are saturated.\n\n#### Solution\n\nFor $V_{D D}=3 \\mathrm{~V}$, symmetry dictates that $V_{\\text {out }}=V_{F}$. As $V_{D D}$ decreases, so do $V_{F}$ and $V_{\\text {out }}$ with a slope near unity [Fig. 5.29(b)]. As $V_{F}$ and $V_{\\text {out }}$ fall below $+1.5 \\mathrm{~V}-V_{T H N}$, $M_{1}$ and $M_{2}$ enter the triode region, but their drain currents remain constant if $M_{5}$ is saturated. Further decrease in $V_{D D}$ and hence $V_{F}$ and $V_{\\text {out }}$ causes $V_{G S 1}$ and $V_{G S 2}$ to increase, eventually driving $M_{5}$ into the triode region. Beyond this point, the bias current of all the transistors decreases, slowing the rate at which $V_{\\text {out }}$ decreases. For $V_{D D}<\\left|V_{T H P}\\right|$, we have $V_{\\text {out }}=0$.\n\n#### Example 5.10\n\nSketch the large-signal input-output characteristic of the unity-gain buffer depicted in Fig. 5.30(a) if the op amp is realized as a five-transistor OTA.\n\n#### Solution\n\nAnalyzing the circuit as shown in Fig. 5.30(b), we start with $V_{i n}=0$ and observe that $M_{1}$, $M_{3}$, and $M_{4}$ are off. Consequently, $M_{5}$ enters the triode region with zero drain current, and the diode-connected device $M_{2}$ maintains a zero $V_{G S}$. Therefore, we have $V_{\\text {out }}=V_{P}=0$ [Fig. 5.30(c)]. As $V_{i n}$ increases and exceeds one threshold, $M_{1}$ starts to draw current from $M_{3}$, activating $M_{4}$ and hence $M_{2}$. Note that, since $I_{D 3} \\approx I_{D 4}$, we have $I_{D 1} \\approx I_{D 2}$ and $V_{G S 1} \\approx V_{G S 2}$. This implies that $V_{\\text {out }} \\approx V_{\\text {in }}$. This unity-gain action persists as $V_{i n}$ increases. For a sufficiently high $V_{i n}$, two phenomena occur: (a) $M_{1}$ enters the triode region if $V_{\\text {in }}>V_{D D}-\\left|V_{G S 3}\\right|+V_{T H 1}$, and (b) $M_{4}$ enters the triode region if $V_{\\text {out }}>V_{D D}-\\left|V_{G S 4}-V_{T H 4}\\right|$, and hence $V_{i n}>V_{D D}-\\left|V_{G S 4}-V_{T H 4}\\right|$. These two values are roughly equal if $V_{T H 1}$ and $\\left|V_{T H 4}\\right|$ are comparable. Beyond this point, $\\left|I_{D 4}\\right|<\\left|I_{D 3}\\right|$ (why?), and hence $V_{G S 1}>V_{G S 2}$, resulting in $V_{\\text {out }}<V_{i n}$. If $V_{i n}=V_{D D}$, then $M_{4}$ carries little current, and $V_{\\text {out }}$ experiences significant error."
},
{
    "text": "To analyze the behavior of the five-transistor operational transconductance amplifier (OTA) under large-signal conditions, we substitute the ideal tail current source with a MOSFET, as depicted in Fig. 5.27(a). When the voltage at the input \\( V_{in1} \\) is significantly more negative than \\( V_{in2} \\), transistor \\( M_1 \\) is turned off, which also results in \\( M_3 \\) and \\( M_4 \\) being inactive. Consequently, with no current flowing from \\( V_{DD} \\), \\( M_2 \\) and \\( M_5 \\) are in the deep triode region and carry no current, leading to an output voltage \\( V_{out} = 0 \\). As \\( V_{in1} \\) nears \\( V_{in2} \\), \\( M_1 \\) activates, siphoning a portion of \\( I_{D5} \\) from \\( M_3 \\) and activating \\( M_4 \\). The output voltage then hinges on the disparity between \\( I_{D4} \\) and \\( I_{D2} \\). When \\( V_{in1} \\) and \\( V_{in2} \\) differ by a small amount, \\( M_2 \\) and \\( M_4 \\) are in saturation, delivering high gain as shown in Fig. 5.27(b). If \\( V_{in1} \\) is more positive than \\( V_{in2} \\), \\( I_{D1} \\), \\( |I_{D3}| \\), and \\( |I_{D4}| \\) increase while \\( I_{D2} \\) decreases, enabling \\( V_{out} \\) to rise and eventually pushing \\( M_4 \\) into the triode region. Should the difference between \\( V_{in1} \\) and \\( V_{in2} \\) be sufficiently large, \\( M_2 \\) switches off, \\( M_4 \\) operates in the deep triode region with zero current, and \\( V_{out} = V_{DD} \\)."
},
{
    "text": "We shall examine the behavior of a five-transistor operational transconductance amplifier (OTA) under large-signal conditions. To do this, we'll substitute the ideal tail current source with a MOSFET, as depicted in Fig. 5.27(a). When the input voltage $V_{in1}$ is significantly more negative than $V_{in2}$, transistor $M_{1}$ is turned off, which also switches off $M_{3}$ and $M_{4}$. Consequently, since no current flows from $V_{DD}$, both $M_{2}$ and $M_{5}$ are in the deep triode region and carry no current. Thus, the output voltage $V_{out}$ is zero. As $V_{in1}$ approaches $V_{in2}$, $M_{1}$ activates, siphoning a portion of $I_{D5}$ from $M_{3}$ and activating $M_{4}$. The output voltage then becomes dependent on the disparity between $I_{D4}$ and $I_{D2}$. For a minor difference between $V_{in1}$ and $V_{in2}$, both $M_{2}$ and $M_{4}$ are in saturation, yielding a high gain, as shown in Fig. 5.27(b). As $V_{in1}$ becomes more positive than $V_{in2}$, $I_{D1}$, $|I_{D3}|$, and $|I_{D4}|$ increase, while $I_{D2}$ decreases, enabling $V_{out}$ to rise and eventually push $M_{4}$ into the triode region. If the difference $V_{in1} - V_{in2}$ is adequately large, $M_{2}$ shuts off, $M_{4}$ operates in the deep triode region with zero current, and $V_{out}$ equals $V_{DD}$.\n\nThe circuit illustrated in Fig. 5.27(a) is a differential amplifier equipped with an active current mirror load. Transistors $M_{1}$ and $M_{2}$ constitute a differential pair, $M_{3}$ and $M_{4}$ function as a current mirror, and $M_{5}$ provides biasing. The corresponding graph in Fig. 5.27(b) depicts the large-signal input-output characteristics of a differential pair circuit, plotting the output voltage $V_{out}$ against the differential input voltage $V_{in1} - V_{in2}$.\n\nIf $V_{in1}$ exceeds $V_{F} + V_{TH}$, $M_{1}$ enters the triode region. Additionally, $V_{out}$ is in phase with $V_{in1}$ but 180 degrees out of phase with $V_{in2}$. The selection of the input common-mode voltage is crucial for the circuit. To ensure $M_{2}$ saturation, the output voltage cannot drop below $V_{in,CM} - V_{TH}$. Consequently, to allow for maximum output swings, the input CM level must be minimized, with the lowest possible value being $V_{GS1,2} + V_{DS5,\\min}$. The constraint imposed by the input CM level on the output swing is a significant drawback of this circuit.\n\nWhen $V_{in1} = V_{in2}$, the output voltage under perfect symmetry is $V_{F} = V_{DD} - |V_{GS3}|$. This can be demonstrated through a contradiction argument. For instance, if $V_{out} < V_{F}$, due to channel-length modulation, $M_{1}$ must conduct more current than $M_{2}$ (and $M_{4}$ more than $M_{3}$). This implies that the total current through $M_{1}$ exceeds half of $I_{SS}$. However, this also means that the total current through $M_{3}$ surpasses $I_{SS}/2$, contradicting the assumption that $M_{4}$ conducts more current than $M_{3}$. In reality, circuit asymmetries can lead to substantial deviations in $V_{out}$, potentially forcing $M_{2}$ or $M_{4}$ into the triode region. For example, if $M_{2}$ has a slightly lower threshold voltage than $M_{1}$, it will carry more current even when $V_{in1} = V_{in2}$, causing $V_{out}$ to drop markedly. Due to these reasons, the circuit is infrequently employed in an open-loop configuration for amplifying small signals. Nonetheless, the open-loop OTA serves as an effective differential-to-single-ended converter for large swings, as demonstrated in subsequent examples.\n\n#### Example 5.8\n\nSome digital circuits employ differential (complementary) signals with voltage swings less than $V_{DD}$. For instance, the single-ended swing can be $300 \\mathrm{mV}_{pp}$. Explain how a five-transistor OTA can transform such moderate-swing differential signals into a single-ended rail-to-rail signal.\n\n#### Solution\n\nConsider the OTA depicted in Fig. 5.28, where $M_{1}$ and $M_{2}$ detect swings equal to $V_{2} - V_{1} = 300 \\mathrm{mV}$. By appropriately selecting $(W/L)_{1,2}$ and $I_{SS}$, we can ensure that such swings will turn off one side. For example, if $M_{1}$ conducts the entire $I_{SS}$, $M_{2}$ remains off, allowing $M_{4}$ to pull $V_{out}$ to $V_{DD}$. Conversely, when $M_{2}$ monopolizes $I_{SS}$, $M_{1}$, $M_{2}$, and $M_{4}$ turn off, while $M_{2}$ and $M_{5}$ remain on with zero current, resulting in $V_{out} = 0$. The \"push-pull\" action between $M_{2}$ and $M_{4}$ thus generates rail-to-rail swings at the output.\n\nIn practice, $V_{out}$ does not reach exactly $V_{DD}$ or zero if $V_{1} > V_{TH1,2}$. The proof is left as an exercise for the reader. (Hint: if $M_{2}$ and $M_{5}$ are in the deep triode region, then $V_{P}$ approaches zero, potentially turning on $M_{1}$.) For this reason, the OTA is commonly followed by a CMOS inverter to achieve rail-to-rail swings.\n\n#### Example 5.9\n\nAssuming perfect symmetry, sketch the output voltage of the circuit in Fig. 5.29(a) as $V_{DD}$ varies from 3 V to zero. Assume that for $V_{DD} = 3 \\mathrm{~V}$, all devices are saturated.\n\n#### Solution\n\nFor $V_{DD} = 3 \\mathrm{~V}$, symmetry dictates that $V_{out} = V_{F}$. As $V_{DD}$ decreases, $V_{F}$ and $V_{out}$ also decrease with a slope close to unity [Fig. 5.29(b)]. As $V_{F}$ and $V_{out}$ fall below $+1.5 \\mathrm{~V} - V_{THN}$, $M_{1}$ and $M_{2}$ enter the triode region, but their drain currents remain constant if $M_{5}$ is saturated. Further reduction in $V_{DD}$, and consequently $V_{F}$ and $V_{out}$, causes $V_{GS1}$ and $V_{GS2}$ to increase, eventually driving $M_{5}$ into the triode region. Thereafter, the bias current of all transistors diminishes, slowing the rate at which $V_{out}$ decreases. For $V_{DD} < |V_{THP}|$, we have $V_{out} = 0$.\n\n#### Example 5.10\n\nSketch the large-signal input-output characteristic of the unity-gain buffer shown in Fig. 5.30(a) if the op amp is implemented as a five-transistor OTA.\n\n#### Solution\n\nDepicting the circuit as shown in Fig. 5.30(b), we start with $V_{in} = 0$ and observe that $M_{1}$, $M_{3}$, and $M_{4}$ are off. Thus, $M_{5}$ enters the triode region with zero drain current, and the diode-connected device $M_{2}$ maintains a zero $V_{GS}$. Consequently, $V_{out} = V_{P} = 0$ [Fig. 5.30(c)]. As $V_{in}$ increases and surpasses one threshold, $M_{1}$ starts to draw current from $M_{3}$, turning on $M_{4}$ and thereby $M_{2}$. Note that since $I_{D3} \\approx I_{D4}$, we have $I_{D1} \\approx I_{D2}$ and $V_{GS1} \\approx V_{GS2}$. This means $V_{out} \\approx V_{in}$. This unity-gain action persists as $V_{in}$ rises. For a sufficiently high $V_{in}$, two phenomena occur: (a) $M_{1}$ enters the triode region if $V_{in} > V_{DD} - |V_{GS3}| + V_{TH1}$, and (b) $M_{4}$ enters the triode region if $V_{out} > V_{DD} - |V_{GS4} - V_{TH4}|$, and hence $V_{in} > V_{DD} - |V_{GS4} - V_{TH4}|$. These two values are roughly equal if $V_{TH1}$ and $|V_{TH4}|$ are similar. Beyond this point, $|I_{D4}| < |I_{D3}|$ (why?), and therefore $V_{GS1} > V_{GS2}$, resulting in $V_{out} < V_{in}$. If $V_{in} = V_{DD}$, then $M_{4}$ carries little current, and $V_{out}$ incurs considerable error."
},
{
    "text": "We will examine the small-signal characteristics of the circuit depicted in Fig. 5.27(a), simplifying by setting $\\gamma=0$. It is questionable whether we can employ the half-circuit approach to determine the differential gain in this instance. As Fig. 5.31 demonstrates, the voltage fluctuations at nodes $F$ and $X$ are significantly dissimilar when small differential inputs are applied. This discrepancy arises because the diode-connected transistor $M_{3}$ results in a significantly reduced voltage gain from the input to node $F$ as opposed to the input to node $X$. Consequently, the impacts of $V_{F}$ and $V_{X}$ at node $P$ (via $r_{O 1}$ and $r_{O 2}$, respectively) do not negate each other, precluding node $P$ from being deemed a virtual ground. Employing the lemma $\\left|A_{v}\\right|=G_{m} R_{\\text {out }}$, we commence with a rough analysis to glean insight, followed by a precise computation of the gain."
},
{
    "text": "We proceed to examine the small-signal characteristics of the circuit depicted in Fig. 5.27(a), simplifying our analysis by assuming $\\gamma=0$. The question arises whether the half-circuit approach can be utilized to determine the differential gain for this configuration. As depicted in Fig. 5.31, when small differential inputs are applied, the voltage swings at nodes $F$ and $X$ exhibit significant disparity. This disparity occurs because the diode-connected transistor $M_{3}$ results in a notably lower voltage gain from the input to node $F$ compared to that from the input to node $X$. Consequently, the influences of $V_{F}$ and $V_{X}$ at node $P$—mediated by $r_{O 1}$ and $r_{O 2}$ respectively—do not counterbalance, and node $P$ cannot be regarded as a virtual ground. Utilizing the lemma $\\left|A_{v}\\right|=G_{m} R_{\\text {out }}$, we commence with an approximate analysis to garner insights, followed by an exact computation of the gain.\n\n---\n\nFigure 5.31 portrays asymmetric swings within a differential pair that incorporates an active current mirror. The differential pair circuit integrates PMOS and NMOS transistors, with $M3$ and $M4$ constructing the active current mirror. It is designed to manage asymmetric voltage swings at nodes $F$ and $X$, approximating node $P$ as a virtual ground for analysis purposes.\n\n---\n\nFor the approximation of $G_{m}$, we refer to Fig. 5.32(a). Despite the circuit's lack of symmetry, the impedance at node $F$ is fairly low, and the swing at this node is minimal, making the current flowing back to $P$ via $r_{O 1}$ insignificant. Thus, node $P$ can be approximated as a virtual ground, as shown in Fig. 5.32(b). Consequently, $I_{D 1}=\\left|I_{D 3}\\right|=\\left|I_{D 4}\\right|=g_{m 1,2} V_{i n} / 2$ and $I_{D 2}=-g_{m 1,2} V_{i n} / 2$, resulting in $I_{\\text {out }}=-g_{m 1,2} V_{i n}$, and hence $\\left|G_{m}\\right|=g_{m 1,2}$. It is noteworthy that, due to the active current mirror's operation, this value is double the transconductance of the circuit depicted in Fig. 5.23(b).\n\n---\n\nCalculating $R_{\\text {out }}$ is more complex. One might presume that the output resistance of this circuit matches that of the circuit in Fig. 5.23(c), specifically, $\\left(2 r_{O 2}\\right) \\| r_{O 4}$. However, the active mirror's operation yields a distinct value since the gate voltage of $M_{4}$ does not remain constant when a voltage is applied to the output to measure $R_{\\text {out }}$. Instead of depicting the complete equivalent circuit, we observe that for small signals, $I_{S S}$ is open, as shown in Fig. 5.33(a). Any current entering $M_{1}$ must exit $M_{2}$, and the function of these two transistors can be represented by a resistor $R_{X Y}=2 r_{O 1,2}$, as illustrated in Fig. 5.33(b). Consequently, the current sourced from $V_{X}$ by $R_{X Y}$ is mirrored onto $M_{4}$ by $M_{3}$ with a gain of unity. This current is given by\n\n$$\n\\frac{V_{X}}{2 r_{O 1,2}+\\left(1 / g_{m 3}\\right) \\| r_{O 3}}\n$$\n\nMultiplying this current by $\\left(1 / g_{m 3}\\right) \\| r_{O 3}$ yields the gate-source voltage of $M_{4}$, which, when multiplied by $g_{m 4}$, provides the following expression:\n\n$$\nI_{X}=\\frac{V_{X}}{2 r_{O 1,2}+\\frac{1}{g_{m 3}} \\| r_{O 3}}\\left[1+\\left(\\frac{1}{g_{m 3}} \\| r_{O 3}\\right) g_{m 4}\\right]+\\frac{V_{X}}{r_{O 4}}\n$$\n\nFor $2 r_{O 1,2} \\gg\\left(1 / g_{m 3}\\right) \\| r_{O 3}$, we obtain\n\n$$\nR_{\\text {out }} \\approx r_{O 2} \\| r_{O 4}\n$$\n\nThe overall voltage gain is approximately $\\left|A_{v}\\right|=G_{m} R_{o u t}=g_{m 1,2}\\left(r_{O 2} \\| r_{O 4}\\right)$, which is somewhat greater than that of the circuit in Fig. 5.23(a).\n\n---\n\nFor the exact analysis, we must determine both $G_{m}$ and $R_{\\text {out }}$ of the OTA. We calculate $G_{m}$ without grounding node $P$ by solving the equivalent circuit presented in Fig. 5.34. To shorten the discussion, we use the subscript 1 to refer to both $M_{1}$ and $M_{2}$. Given that the current flowing downward through $\\left(1 / g_{m 3}\\right) \\| r_{O 3}$ (hereafter denoted as $r_{d}$) is $-V_{4} / r_{d}$, $r_{O 1}$ experiences a voltage equal to $\\left(-V_{4} / r_{d}-g_{m 1} V_{1}\\right) r_{O 1}$. Adding this voltage to $V_{P}=V_{i n 1}-V_{1}$ yields\n\n$$\n\\left(-\\frac{V_{4}}{r_{d}}-g_{m 1} V_{1}\\right) r_{O 1}+V_{i n 1}-V_{1}=V_{4}\n$$\n\n---\n\nWe also acknowledge that the sum of $g_{m 2} V_{2}$ and the current flowing through $r_{O 2}$ equals $V_{4} / r_{d}$. That is\n\n$$\ng_{m 2} V_{2}-\\frac{V_{i n 2}-V_{2}}{r_{O 2}}=\\frac{V_{4}}{r_{D}}\n$$\n\nSolving for $V_{1}$ and $V_{2}$ from these equations in terms of $V_{4}$ and considering that $V_{1}-V_{2}=V_{i n 1}-V_{i n 2}$ and $I_{\\text {out }}=g_{m 4} V_{4}+V_{4} / r_{d}$, we arrive at\n\n$$\nI_{\\text {out }}=-g_{m 1} r_{O 1} \\frac{g_{m 4} r_{d}+1}{r_{d}+2 r_{O 1}}\\left(V_{i n 1}-V_{i n 2}\\right)\n$$\n\n---\n\nIt follows that\n\n$$\nG_{m}=-g_{m 1} r_{O 1} \\frac{g_{m 4} r_{d}+1}{r_{d}+2 r_{O 1}}\n$$\n\nNext, we calculate $R_{\\text {out }}$. Expressing the output admittance from Eq. (5.27) as\n\n$$\n\\frac{I_{X}}{V_{X}} =\\frac{1+g_{m 4} r_{d}}{2 r_{O 1}+r_{d}}+\\frac{1}{r_{O 4}}\n$$\n\nand\n\n$$\n\\frac{I_{X}}{V_{X}} =\\frac{\\left(1+g_{m 4} r_{d}\\right) r_{O 4}+2 r_{O 1}+r_{d}}{\\left(2 r_{O 1}+r_{d}\\right) r_{O 4}}\n$$\n\nwe find\n\n$$\nG_{m} R_{o u t}=-g_{m 1} r_{O 1} \\frac{\\left(g_{m 4} r_{d}+1\\right) r_{O 4}}{\\left(g_{m 4} r_{d}+1\\right) r_{O 4}+2 r_{O 1}+r_{d}}\n$$\n\nSince $r_{d}=r_{O 3} /\\left(1+g_{m 3} r_{O 3}\\right)$, this expression simplifies to\n\n$$\nG_{m} R_{o u t}=-g_{m 1} r_{O 1} r_{O 4} \\frac{2 g_{m 3} r_{O 3}+1}{\\left(2 g_{m 3} r_{O 3}+1\\right) r_{O 4}+2 r_{O 1}\\left(1+g_{m 3} r_{O 3}\\right)+r_{O 3}}\n$$\n\nand\n\n$$\nG_{m} R_{o u t}=-\\frac{g_{m 1} r_{O 1} r_{O 4}}{r_{O 1}+r_{O 3}} \\cdot \\frac{2 g_{m 3} r_{O 3}+1}{2\\left(g_{m 3} r_{O 3}+1\\right)}\n$$\n\n---\n\nWe thus derive a simple yet exact expression for the gain:\n\n$$\n\\left|A_{v}\\right|=g_{m 1}\\left(r_{O 1}| | r_{O 4}\\right) \\frac{2 g_{m 4} r_{O 4}+1}{2\\left(g_{m 4} r_{O 4}+1\\right)}\n$$\n\nThis result can be seen as our approximate solution, $g_{m 1}\\left(r_{O 1} \\| r_{O 4}\\right)$, multiplied by a \"correction\" factor that is less than unity. For instance, if $g_{m 4} r_{O 4}=5$, then $\\left|A_{v}\\right|=0.92 g_{m 1}\\left(r_{O 1} \\| r_{O 4}\\right)$.\n\n---\n\n#### Example 5.11\n\nWith the aid of the above results, determine the output response to an input CM change if mismatches are neglected.\n\n#### Solution\n\nTo represent an input CM change, we set $V_{i n 1}=V_{i n 2}$ in Fig. 5.34, which, from Eq. (5.31), yields $I_{o u t}=0$. Hence, the single-ended output voltage is unaffected by the input CM change.\n\n---\n\n#### Example 5.12\n\nCalculate the small-signal voltage gain of the circuit shown in Fig. 5.35. How does the performance of this circuit compare with that of a differential pair with active mirror?\n\n#### Solution\n\nThe voltage gain is $A_{v}=g_{m 1}\\left(r_{O 1} \\| r_{O 2}\\right)$, analogous to the value derived previously. For given device dimensions, this circuit necessitates half the bias current of a differential pair to achieve the same gain. Nonetheless, the benefits of differential operation, such as reduced sensitivity to CM noise and lower distortion, often outweigh the power consumption penalty.\n\nThe preceding gain calculations have presumed an ideal tail current source. In actuality, the output impedance of this source affects the gain, albeit the error is relatively minor.\n\n---\n\nHeadroom Issues The five-transistor OTA is not ideally suited for low-voltage operation, as the diode-connected PMOS device tends to require considerable voltage headroom. To address this, we observe that the gate voltage of this device need not be equal to its drain voltage. As depicted in Fig. 5.36, we introduce a resistor in series with the gate and source a constant current from it, thereby allowing $V_{G}$ to be lower than $V_{F}$ by $R_{1} I_{1} \\leq V_{T H 3}$. This level shifting permits a higher input CM level, simplifying the design of the preceding stage and the tail current source. The value of $I_{1}$ must be much less than $I_{S S} / 2$ to introduce negligible asymmetry between the two sides of the circuit. The reader is encouraged to calculate the input-referred offset voltage generated by $I_{1}$."
},
{
    "text": "We proceed to examine the small-signal characteristics of the circuit depicted in Fig. 5.27(a), with the assumption that $\\gamma=0$ to simplify the analysis. The question arises whether the half-circuit approach can be utilized to determine the differential gain in this context. As depicted in Fig. 5.31, under the influence of small differential inputs, the voltage fluctuations at nodes $F$ and $X$ exhibit substantial disparities. This discrepancy is due to the diode-connected device $M_{3}$, which yields a significantly lower voltage gain from the input to node $F$ compared to that from the input to node $X$. Consequently, the impacts of $V_{F}$ and $V_{X}$ at node $P$, transmitted via $r_{O 1}$ and $r_{O 2}$ respectively, do not nullify each other, rendering node $P$ unsuitable to be regarded as a virtual ground. Utilizing the lemma $\\left|A_{v}\\right|=G_{m} R_{\\text {out }}$, we commence with a preliminary analysis to garner insights, followed by a precise computation of the gain.\n\nThe accompanying images and their descriptions depict a differential pair circuit with an active current mirror, incorporating both PMOS and NMOS transistors. $M_{3}$ and $M_{4}$ constitute the active current mirror. The circuit is engineered to accommodate asymmetric voltage fluctuations at nodes $F$ and $X$, with node $P$ approximated as a virtual ground for analytical purposes.\n\nAn approximate analysis for the determination of $G_{m}$ is conducted with reference to Fig. 5.32(a). Despite the circuit's lack of symmetry, the impedance perceived at node $F$ is comparatively low, and the voltage swing at this node is minimal, rendering the current flowing back to $P$ through $r_{O 1}$ insignificant. Consequently, node $P$ can be approximated as a virtual ground, as illustrated in Fig. 5.32(b). This leads to $I_{D 1}=\\left|I_{D 3}\\right|=\\left|I_{D 4}\\right|=g_{m 1,2} V_{i n} / 2$ and $I_{D 2}=-g_{m 1,2} V_{i n} / 2$, resulting in $I_{\\text {out }}=-g_{m 1,2} V_{i n}$, and thereby $\\left|G_{m}\\right|=g_{m 1,2}$. It is noteworthy that, owing to the active current mirror operation, this value is double the transconductance of the circuit depicted in Fig. 5.23(b).\n\nThe calculation of $R_{\\text {out }}$ is less straightforward. One might infer that the output resistance of this circuit corresponds to that of the circuit in Fig. 5.23(c), specifically, $\\left(2 r_{O 2}\\right) \\| r_{O 4}$. However, the active mirror operation yields a distinct value because when a voltage is applied to the output to measure $R_{\\text {out }}$, the gate voltage of $M_{4}$ does not remain constant. Instead of depicting the entire equivalent circuit, we observe that for small signals, $I_{S S}$ is open, as shown in Fig. 5.33(a). Any current flowing into $M_{1}$ must emanate from $M_{2}$, and the function of these two transistors can be represented by a resistor $R_{X Y}=2 r_{O 1,2}$, as depicted in Fig. 5.33(b). Consequently, the current drawn from $V_{X}$ by $R_{X Y}$ is mirrored by $M_{3}$ onto $M_{4}$ with unity gain. This current is expressed as $V_{X} /\\left[2 r_{O 1,2}+\\left(1 / g_{m 3}\\right) \\| r_{O 3}\\right]$. This current is then multiplied by $\\left(1 / g_{m 3}\\right) \\| r_{O 3}$ to determine the gate-source voltage of $M_{4}$, followed by multiplication by $g_{m 4}$ to yield the final result.\n\nFor $2 r_{O 1,2} \\gg\\left(1 / g_{m 3}\\right) \\| r_{O 3}$, the output resistance is approximated as $R_{\\text {out }} \\approx r_{O 2} \\| r_{O 4}$. The overall voltage gain is approximately $\\left|A_{v}\\right|=\nG_{m} R_{o u t}=g_{m 1,2}\\left(r_{O 2} \\| r_{O 4}\\right)$, slightly surpassing that of the circuit in Fig. 5.23(a).\n\nIn the exact analysis, both $G_{m}$ and $R_{\\text {out }}$ of the operational transconductance amplifier (OTA) must be computed. The $G_{m}$ is determined without grounding node $P$, by resolving the equivalent circuit presented in Fig. 5.34. To conserve space, both $M_{1}$ and $M_{2}$ are denoted by the subscript 1. Given that the current flowing downward through $\\left(1 / g_{m 3}\\right) \\| r_{O 3}$ (designated as $r_{d}$ hereafter) is $-V_{4} / r_{d}$, $r_{O 1}$ experiences a voltage equivalent to $\\left(-V_{4} / r_{d}-g_{m 1} V_{1}\\right) r_{O 1}$. Adding this voltage to $V_{P}=V_{i n 1}-V_{1}$ yields $V_{4}$.\n\nFurthermore, it is acknowledged that the sum of $g_{m 2} V_{2}$ and the current traversing $r_{O 2}$ equals $V_{4} / r_{d}$. This leads to the equation $g_{m 2} V_{2}-\\frac{V_{i n 2}-V_{2}}{r_{O 2}}=\\frac{V_{4}}{r_{D}}$. By deriving $V_{1}$ and $V_{2}$ from these equations in terms of $V_{4}$, considering that $V_{1}-V_{2}=V_{i n 1}-V_{i n 2}$ and $I_{\\text {out }}=g_{m 4} V_{4}+V_{4} / r_{d}$, we arrive at $I_{\\text {out }}=-g_{m 1} r_{O 1} \\frac{g_{m 4} r_{d}+1}{r_{d}+2 r_{O 1}}\\left(V_{i n 1}-V_{i n 2}\\right)$, which implies $G_{m}=-g_{m 1} r_{O 1} \\frac{g_{m 4} r_{d}+1}{r_{d}+2 r_{O 1}}$.\n\nSubsequently, the calculation of $R_{\\text {out }}$ is performed. The output admittance from Eq. (5.27) is expressed as $\\frac{I_{X}}{V_{X}} =\\frac{1+g_{m 4} r_{d}}{2 r_{O 1}+r_{d}}+\\frac{1}{r_{O 4}}$, which simplifies to $\\frac{\\left(1+g_{m 4} r_{d}\\right) r_{O 4}+2 r_{O 1}+r_{d}}{\\left(2 r_{O 1}+r_{d}\\right) r_{O 4}}$. This leads to $G_{m} R_{o u t}=-g_{m 1} r_{O 1} \\frac{\\left(g_{m 4} r_{d}+1\\right) r_{O 4}}{\\left(g_{m 4} r_{d}+1\\right) r_{O 4}+2 r_{O 1}+r_{d}}$. Since $r_{d}=r_{O 3} /\\left(1+g_{m 3} r_{O 3}\\right)$, this expression simplifies further to $G_{m} R_{o u t}=-g_{m 1} r_{O 1} r_{O 4} \\frac{2 g_{m 3} r_{O 3}+1}{\\left(2 g_{m 3} r_{O 3}+1\\right) r_{O 4}+2 r_{O 1}\\left(1+g_{m 3} r_{O 3}\\right)+r_{O 3}}$, which reduces to $G_{m} R_{o u t}=-\\frac{g_{m 1} r_{O 1} r_{O 4}}{r_{O 1}+r_{O 3}} \\cdot \\frac{2 g_{m 3} r_{O 3}+1}{2\\left(g_{m 3} r_{O 3}+1\\right)}$.\n\nThis provides a straightforward yet precise expression for the gain: $\\left|A_{v}\\right|=g_{m 1}\\left(r_{O 1}| | r_{O 4}\\right) \\frac{2 g_{m 4} r_{O 4}+1}{2\\left(g_{m 4} r_{O 4}+1\\right)}$. This result can be perceived as our approximate solution, $g_{m 1}\\left(r_{O 1} \\| r_{O 4}\\right)$, multiplied by a \"correction\" factor that is less than unity.\n\nFor instance, if $g_{m 4} r_{O 4}=5$, then $\\left|A_{v}\\right|=0.92 g_{m 1}\\left(r_{O 1} \\| r_{O 4}\\right)$.\n\n#### Example 5.11\n\nWith the aforementioned findings, we can ascertain the output response to an input common-mode (CM) change, disregarding mismatches.\n\n#### Solution\n\nTo represent an input CM change, we set $V_{i n 1}=V_{i n 2}$ in Fig. 5.34, which, according to Eq. (5.31), yields $I_{o u t}=0$. Thus, the single-ended output voltage remains unaffected by the input CM change.\n\n#### Example 5.12\n\nThe small-signal voltage gain of the circuit depicted in Fig. 5.35 is computed. A comparison is drawn between the performance of this circuit and that of a differential pair with an active mirror.\n\n#### Solution\n\nThe voltage gain is given by $A_{v}=g_{m 1}\\left(r_{O 1} \\| r_{O 2}\\right)$, analogous to the value derived previously. For specified device dimensions, this circuit necessitates half the bias current to achieve the same gain as a differential pair. Nonetheless, the benefits of differential operation, such as reduced sensitivity to CM noise and lower distortion, often outweigh the power disadvantage.\n\nThe gain calculations outlined above presuppose an ideal tail current source. In practical scenarios, the output impedance of this source influences the gain, albeit the error is relatively minor.\n\n#### Headroom Issues\n\nThe five-transistor OTA is not conducive to low-voltage operation due to the substantial voltage headroom consumed by the diode-connected PMOS device. To address this, a resistor is inserted in series with the gate, and a constant current is drawn from it, as shown in Fig. 5.36. This modification allows the gate voltage of $M_{3}$ to be lower than its drain voltage by an amount determined by $R_{1} I_{1} \\leq V_{T H 3}$. With this level shift, the input CM level can be elevated, facilitating the design of the preceding stage and the tail current source. The value of $I_{1}$ must be substantially less than $I_{S S} / 2$ to introduce negligible asymmetry between the two sides of the circuit. The reader is encouraged to calculate the input-referred offset voltage induced by $I_{1}$."
},
{
    "text": "We are currently examining the small-signal characteristics of the circuit depicted in Fig. 5.27(a), with the simplifying assumption that $\\gamma=0$. The question arises whether the half-circuit approach can be utilized to determine the differential gain in this scenario. As depicted in Fig. 5.31, under small differential input conditions, there is a significant discrepancy in the voltage swings at nodes $F$ and $X$. This disparity arises because the diode-connected transistor $M_{3}$ provides a much lower voltage gain from the input to node $F$ compared to that from the input to node $X$. Consequently, the influences of $V_{F}$ and $V_{X}$ at node $P$ (via $r_{O 1}$ and $r_{O 2}$, respectively) do not cancel each other out, precluding the consideration of this node as a virtual ground. Utilizing the lemma $\\left|A_{v}\\right|=G_{m} R_{\\text {out }}$, we initially conduct an approximate analysis to gain insights, followed by an exact computation of the gain.\n\n---\n\nThe circuit under study comprises a differential pair with an active current mirror, incorporating both PMOS and NMOS transistors. Transistors M3 and M4 constitute the active current mirror. The circuit is configured to manage asymmetric voltage swings at nodes F and X, approximating node P as a virtual ground for analysis purposes.\n\nFig. 5.31 illustrates these asymmetric swings within a differential pair equipped with an active current mirror.\n\nFor the approximation of $G_{m}$, we refer to Fig. 5.32(a). Despite the circuit's lack of symmetry, the impedance at node $F$ is sufficiently low and the voltage swing at this node is small enough that the current flowing back to $P$ through $r_{O 1}$ is insignificant. Consequently, node $P$ can be approximated as a virtual ground, as shown in Fig. 5.32(b). Thus, we have $I_{D 1}=\\left|I_{D 3}\\right|=\\left|I_{D 4}\\right|=g_{m 1,2} V_{i n} / 2$ and $I_{D 2}=-g_{m 1,2} V_{i n} / 2$, leading to $I_{\\text {out }}=-g_{m 1,2} V_{i n}$, and therefore $\\left|G_{m}\\right|=g_{m 1,2}$. It is important to note that, due to the active current mirror functionality, this value is double the transconductance of the circuit in Fig. 5.23(b).\n\nDetermining $R_{\\text {out }}$ is more complex. One might infer that the output resistance of this circuit matches that of the circuit in Fig. 5.23(c), which is $\\left(2 r_{O 2}\\right) \\| r_{O 4}$. However, the active mirror operation yields a different result because the gate voltage of $M_{4}$ is not constant when a voltage is applied to the output to measure $R_{\\text {out }}$. Instead of depicting the entire equivalent circuit, we observe that for small signals, $I_{S S}$ is open, as shown in Fig. 5.33(a). Any current flowing into $M_{1}$ must exit through $M_{2}$, and the function of these two transistors can be represented by a resistor $R_{X Y}=2 r_{O 1,2}$, as illustrated in Fig. 5.33(b). Consequently, the current drawn from $V_{X}$ by $R_{X Y}$ is mirrored onto $M_{4}$ by $M_{3}$ with unity gain. This current is given by\n\n$$\nV_{X} /\\left[2 r_{O 1,2}+\\left(1 / g_{m 3}\\right) \\| r_{O 3}\\right]\n$$\n\nMultiplying this current by $\\left(1 / g_{m 3}\\right) \\| r_{O 3}$ yields the gate-source voltage of $M_{4}$, which is then multiplied by $g_{m 4}$ to obtain the following:\n\n$$\nI_{X}=\\frac{V_{X}}{2 r_{O 1,2}+\\frac{1}{g_{m 3}} \\| r_{O 3}}\\left[1+\\left(\\frac{1}{g_{m 3}} \\| r_{O 3}\\right) g_{m 4}\\right]+\\frac{V_{X}}{r_{O 4}}\n$$\n\nWhen $2 r_{O 1,2} \\gg\\left(1 / g_{m 3}\\right) \\| r_{O 3}$, we get\n\n$$\nR_{\\text {out }} \\approx r_{O 2} \\| r_{O 4}\n$$\n\nThe overall voltage gain is approximately $\\left|A_{v}\\right|=G_{m} R_{o u t}=g_{m 1,2}\\left(r_{O 2} \\| r_{O 4}\\right)$, which is somewhat higher than that of the circuit in Fig. 5.23(a).\n\n---\n\nFor the exact analysis, we must calculate both $G_{m}$ and $R_{\\text {out }}$ of the OTA. We start by determining $G_{m}$, without grounding node $P$, by solving the equivalent circuit presented in Fig. 5.34. To simplify, we use the subscript 1 to represent both $M_{1}$ and $M_{2}$. Given that the current flowing downward through $\\left(1 / g_{m 3}\\right) \\| r_{O 3}$ (denoted as $r_{d}$ hereafter) is $-V_{4} / r_{d}$, $r_{O 1}$ experiences a voltage equal to $\\left(-V_{4} / r_{d}-g_{m 1} V_{1}\\right) r_{O 1}$. Adding this voltage to $V_{P}=V_{i n 1}-V_{1}$, we arrive at\n\n$$\n\\left(-\\frac{V_{4}}{r_{d}}-g_{m 1} V_{1}\\right) r_{O 1}+V_{i n 1}-V_{1}=V_{4}\n$$\n\nFurthermore, we recognize that the sum of $g_{m 2} V_{2}$ and the current flowing through $r_{O 2}$ equals $V_{4} / r_{d}$. This is expressed as\n\n$$\ng_{m 2} V_{2}-\\frac{V_{i n 2}-V_{2}}{r_{O 2}}=\\frac{V_{4}}{r_{D}}\n$$\n\nSolving for $V_{1}$ and $V_{2}$ in terms of $V_{4}$, and considering that $V_{1}-V_{2}=V_{i n 1}-V_{i n 2}$ and $I_{\\text {out }}=g_{m 4} V_{4}+V_{4} / r_{d}$, we obtain\n\n$$\nI_{\\text {out }}=-g_{m 1} r_{O 1} \\frac{g_{m 4} r_{d}+1}{r_{d}+2 r_{O 1}}\\left(V_{i n 1}-V_{i n 2}\\right)\n$$\n\nThus,\n\n$$\nG_{m}=-g_{m 1} r_{O 1} \\frac{g_{m 4} r_{d}+1}{r_{d}+2 r_{O 1}}\n$$\n\nNext, we calculate $R_{\\text {out }}$. Expressing the output admittance from Eq. (5.27) as\n\n$$\n\\frac{I_{X}}{V_{X}} =\\frac{1+g_{m 4} r_{d}}{2 r_{O 1}+r_{d}}+\\frac{1}{r_{O 4}}\n$$\n\nand further simplifying to\n\n$$\n\\frac{\\left(1+g_{m 4} r_{d}\\right) r_{O 4}+2 r_{O 1}+r_{d}}{\\left(2 r_{O 1}+r_{d}\\right) r_{O 4}}\n$$\n\nwe arrive at\n\n$$\nG_{m} R_{o u t}=-g_{m 1} r_{O 1} \\frac{\\left(g_{m 4} r_{d}+1\\right) r_{O 4}}{\\left(g_{m 4} r_{d}+1\\right) r_{O 4}+2 r_{O 1}+r_{d}}\n$$\n\nSince $r_{d}=r_{O 3} /\\left(1+g_{m 3} r_{O 3}\\right)$, this expression simplifies to\n\n$$\nG_{m} R_{o u t}=-g_{m 1} r_{O 1} r_{O 4} \\frac{2 g_{m 3} r_{O 3}+1}{\\left(2 g_{m 3} r_{O 3}+1\\right) r_{O 4}+2 r_{O 1}\\left(1+g_{m 3} r_{O 3}\\right)+r_{O 3}}\n$$\n\nand further to\n\n$$\nG_{m} R_{o u t}=-\\frac{g_{m 1} r_{O 1} r_{O 4}}{r_{O 1}+r_{O 3}} \\cdot \\frac{2 g_{m 3} r_{O 3}+1}{2\\left(g_{m 3} r_{O 3}+1\\right)}\n$$\n\nThis yields a concise but precise expression for the gain:\n\n$$\n\\left|A_{v}\\right|=g_{m 1}\\left(r_{O 1}| | r_{O 4}\\right) \\frac{2 g_{m 4} r_{O 4}+1}{2\\left(g_{m 4} r_{O 4}+1\\right)}\n$$\n\nThis result can be interpreted as our approximate solution, $g_{m 1}\\left(r_{O 1} \\| r_{O 4}\\right)$, multiplied by a \"correction\" factor that is less than unity. For instance, if $g_{m 4} r_{O 4}=5$, then $\\left|A_{v}\\right|=0.92 g_{m 1}\\left(r_{O 1} \\| r_{O 4}\\right)$.\n\n---\n\n#### Example 5.11\n\nUsing the derived results, we can determine the output response to an input CM change, assuming no mismatches.\n\n#### Solution\n\nTo represent an input CM change, we set $V_{i n 1}=V_{i n 2}$ in Fig. 5.34, which, from Eq. (5.31), yields $I_{o u t}=0$. Consequently, the single-ended output voltage is independent of the input CM change.\n\n---\n\n#### Example 5.12\n\nWe calculate the small-signal voltage gain of the circuit depicted in Fig. 5.35. We then compare the performance of this circuit with that of a differential pair with an active mirror.\n\n#### Solution\n\nThe voltage gain is $A_{v}=g_{m 1}\\left(r_{O 1} \\| r_{O 2}\\right)$, similar to the previously derived value. For given device dimensions, this circuit necessitates only half the bias current required to achieve the same gain as a differential pair. However, the benefits of differential operation, such as reduced sensitivity to CM noise and lower distortion, often compensate for the power penalty.\n\nThe gain calculations above assume an ideal tail current source. In practice, the output impedance of this source affects the gain, albeit to a minor extent.\n\n---\n\n#### Headroom Issues\n\nThe five-transistor OTA is not well-suited for low-voltage operation due to the substantial voltage headroom consumed by the diode-connected PMOS device. To address this, as shown in Fig. 5.36, we introduce a resistor in series with the gate and draw a constant current from it. This allows the gate voltage of $M_{3}$ to be lower than the drain voltage by an amount up to $R_{1} I_{1} \\leq V_{T H 3}$. This level shift enables a higher input CM level, simplifying the design of the preceding stage and the tail current source. The value of $I_{1}$ must be much smaller than $I_{S S} / 2$ to avoid introducing significant asymmetry between the two sides of the circuit. The reader is encouraged to calculate the input-referred offset voltage caused by $I_{1}$."
},
{
    "text": "The analysis of the circuit depicted in Fig. 5.27(a) focuses on its small-signal characteristics, under the assumption that $\\gamma=0$. We are investigating whether the half-circuit approach is applicable for calculating the differential gain in this scenario. As shown in Fig. 5.31, when the circuit is subjected to small differential inputs, there is a significant disparity in the voltage swings at nodes $F$ and $X$. This disparity occurs because the diode-connected transistor $M_{3}$ provides a much lower voltage gain from the input to node $F$ compared to the input to node $X$. Consequently, the influence of $V_{F}$ and $V_{X}$ at node $P$ (via $r_{O 1}$ and $r_{O 2}$, respectively) does not offset each other, which means node $P$ cannot be treated as a virtual ground. Utilizing the lemma $\\left|A_{v}\\right|=G_{m} R_{\\text {out }}$, we initially conduct an approximate analysis to gain insight before proceeding with an exact calculation of the gain.\n\nThe circuit in question is a differential pair with an active current mirror, incorporating both PMOS and NMOS transistors. Transistors $M3$ and $M4$ constitute the active current mirror. The circuit is engineered to manage asymmetric voltage swings at nodes $F$ and $X$, with node $P$ approximated as a virtual ground for analytical purposes.\n\nIn the approximate analysis for determining $G_{m}$, we refer to Fig. 5.32(a). Despite the circuit's lack of symmetry, the impedance at node $F$ is relatively low, and the voltage swing at this node is small, making the current flowing from $F$ to $P$ through $r_{O 1}$ insignificant. Consequently, node $P$ can be approximated as a virtual ground, as shown in Fig. 5.32(b). This leads to $I_{D 1}=\\left|I_{D 3}\\right|=\\left|I_{D 4}\\right|=g_{m 1,2} V_{i n} / 2$ and $I_{D 2}=-g_{m 1,2} V_{i n} / 2$, resulting in $I_{\\text {out }}=-g_{m 1,2} V_{i n}$, and thus $\\left|G_{m}\\right|=g_{m 1,2}$. It is important to note that, due to the active current mirror operation, this value is double the transconductance of the circuit in Fig. 5.23(b).\n\nCalculating $R_{\\text {out }}$ is more complex. We might assume that the output resistance of this circuit matches that of the circuit in Fig. 5.23(c), which is $\\left(2 r_{O 2}\\right) \\| r_{O 4}$. However, the active mirror operation actually yields a different value because when a voltage is applied to the output to measure $R_{\\text {out }}$, the gate voltage of $M_{4}$ is not constant. Instead of depicting the entire equivalent circuit, we observe that for small signals, $I_{S S}$ is open, as shown in Fig. 5.33(a). Any current flowing into $M_{1}$ must flow out of $M_{2}$, and the role of these two transistors can be represented by a resistor $R_{X Y}=2 r_{O 1,2}$, as shown in Fig. 5.33(b). As a result, the current drawn from $V_{X}$ by $R_{X Y}$ is mirrored by $M_{3}$ onto $M_{4}$ with unity gain. This current is equal to $V_{X} /\\left[2 r_{O 1,2}+\\left(1 / g_{m 3}\\right) \\| r_{O 3}\\right]$. We multiply this current by $\\left(1 / g_{m 3}\\right) \\| r_{O 3}$ to obtain the gate-source voltage of $M_{4}$ and then multiply the result by $g_{m 4}$. This leads to the following equation:\n\n$$\n\\begin{equation*}\nI_{X}=\\frac{V_{X}}{2 r_{O 1,2}+\\frac{1}{g_{m 3}} \\| r_{O 3}}\\left[1+\\left(\\frac{1}{g_{m 3}} \\| r_{O 3}\\right) g_{m 4}\\right]+\\frac{V_{X}}{r_{O 4}} \\tag{5.27}\n\\end{equation*}\n$$\n\nFor $2 r_{O 1,2} \\gg\\left(1 / g_{m 3}\\right) \\| r_{O 3}$, we have\n\n$$\n\\begin{equation*}\nR_{\\text {out }} \\approx r_{O 2} \\| r_{O 4} \\tag{5.28}\n\\end{equation*}\n$$\n\nThe overall voltage gain is approximately $\\left|A_{v}\\right|=\nG_{m} R_{o u t}=g_{m 1,2}\\left(r_{O 2} \\| r_{O 4}\\right)$, which is somewhat higher than that of the circuit in Fig. 5.23(a).\n\nFor the exact analysis, we must compute both $G_{m}$ and $R_{\\text {out }}$ of the OTA. We determine $G_{m}$ without grounding node $P$ by solving the equivalent circuit depicted in Fig. 5.34. For brevity, we use the subscript 1 to represent both $M_{1}$ and $M_{2}$. Since the current flowing downward through $\\left(1 / g_{m 3}\\right) \\| r_{O 3}$ (denoted by $r_{d}$ hereafter) is $-V_{4} / r_{d}$, $r_{O 1}$ experiences a voltage equal to $\\left(-V_{4} / r_{d}-g_{m 1} V_{1}\\right) r_{O 1}$. Adding this voltage to $V_{P}=V_{i n 1}-V_{1}$, we obtain\n\n$$\n\\begin{equation*}\n\\left(-\\frac{V_{4}}{r_{d}}-g_{m 1} V_{1}\\right) r_{O 1}+V_{i n 1}-V_{1}=V_{4} \\tag{5.29}\n\\end{equation*}\n$$\n\nWe also recognize that the sum of $g_{m 2} V_{2}$ and the current flowing through $r_{O 2}$ equals $V_{4} / r_{d}$. This is expressed as\n\n$$\n\\begin{equation*}\ng_{m 2} V_{2}-\\frac{V_{i n 2}-V_{2}}{r_{O 2}}=\\frac{V_{4}}{r_{D}} \\tag{5.30}\n\\end{equation*}\n$$\n\nSolving for $V_{1}$ and $V_{2}$ in terms of $V_{4}$ and noting that $V_{1}-V_{2}=V_{i n 1}-V_{i n 2}$ and $I_{\\text {out }}=g_{m 4} V_{4}+V_{4} / r_{d}$, we arrive at\n\n$$\n\\begin{equation*}\nI_{\\text {out }}=-g_{m 1} r_{O 1} \\frac{g_{m 4} r_{d}+1}{r_{d}+2 r_{O 1}}\\left(V_{i n 1}-V_{i n 2}\\right) \\tag{5.31}\n\\end{equation*}\n$$\n\nThis implies that\n\n$$\n\\begin{equation*}\nG_{m}=-g_{m 1} r_{O 1} \\frac{g_{m 4} r_{d}+1}{r_{d}+2 r_{O 1}} \\tag{5.32}\n\\end{equation*}\n$$\n\nNext, we calculate $R_{\\text {out }}$. We express the output admittance from Eq. (5.27) as\n\n$$\n\\begin{align*}\n\\frac{I_{X}}{V_{X}} & =\\frac{1+g_{m 4} r_{d}}{2 r_{O 1}+r_{d}}+\\frac{1}{r_{O 4}}  \\tag{5.33}\\\\\n& =\\frac{\\left(1+g_{m 4} r_{d}\\right) r_{O 4}+2 r_{O 1}+r_{d}}{\\left(2 r_{O 1}+r_{d}\\right) r_{O 4}} \\tag{5.34}\n\\end{align*}\n$$\n\nand hence\n\n$$\n\\begin{equation*}\nG_{m} R_{o u t}=-g_{m 1} r_{O 1} \\frac{\\left(g_{m 4} r_{d}+1\\right) r_{O 4}}{\\left(g_{m 4} r_{d}+1\\right) r_{O 4}+2 r_{O 1}+r_{d}} \\tag{5.35}\n\\end{equation*}\n$$\n\nSince $r_{d}=r_{O 3} /\\left(1+g_{m 3} r_{O 3}\\right)$, this expression simplifies to\n\n$$\n\\begin{align*}\nG_{m} R_{o u t} & =-g_{m 1} r_{O 1} r_{O 4} \\frac{2 g_{m 3} r_{O 3}+1}{\\left(2 g_{m 3} r_{O 3}+1\\right) r_{O 4}+2 r_{O 1}\\left(1+g_{m 3} r_{O 3}\\right)+r_{O 3}}  \\tag{5.36}\\\\\n& =-\\frac{g_{m 1} r_{O 1} r_{O 4}}{r_{O 1}+r_{O 3}} \\cdot \\frac{2 g_{m 3} r_{O 3}+1}{2\\left(g_{m 3} r_{O 3}+1\\right)} \\tag{5.37}\n\\end{align*}\n$$\n\nThis yields a simplified but exact expression for the gain:\n\n$$\n\\begin{equation*}\n\\left|A_{v}\\right|=g_{m 1}\\left(r_{O 1}| | r_{O 4}\\right) \\frac{2 g_{m 4} r_{O 4}+1}{2\\left(g_{m 4} r_{O 4}+1\\right)} \\tag{5.38}\n\\end{equation*}\n$$\n\nThis result can be seen as our approximate solution, $g_{m 1}\\left(r_{O 1} \\| r_{O 4}\\right)$, multiplied by a \"correction\" factor that is less than unity. For instance, if $g_{m 4} r_{O 4}=5$, then $\\left|A_{v}\\right|=0.92 g_{m 1}\\left(r_{O 1} \\| r_{O 4}\\right)$.\n\n#### Example 5.11\n\nUsing the above findings, we can determine the output response to an input CM change, assuming mismatches are negligible.\n\n#### Solution\n\nTo represent an input CM change, we set $V_{i n 1}=V_{i n 2}$ in Fig. 5.34, which, according to Eq. (5.31), yields $I_{o u t}=0$. Consequently, the single-ended output voltage is unaffected by the input CM change.\n\n#### Example 5.12\n\nThe small-signal voltage gain of the circuit shown in Fig. 5.35 is calculated. The performance of this circuit is compared with that of a differential pair with an active mirror.\n\n#### Solution\n\nThe voltage gain is $A_{v}=g_{m 1}\\left(r_{O 1} \\| r_{O 2}\\right)$, similar to the value derived previously. For given device dimensions, this circuit requires only half of the bias current needed to achieve the same gain as a differential pair. However, the benefits of differential operation, such as reduced sensitivity to CM noise and lower distortion, often outweigh the power penalty.\n\nThe gain calculations presented assume an ideal tail current source. In reality, the output impedance of this source affects the gain, although the error is relatively small.\n\nRegarding headroom issues, the five-transistor OTA is not well-suited for low-voltage operation due to the diode-connected PMOS device, which tends to consume a significant portion of the voltage headroom. To address this, as shown in Fig. 5.36, a resistor is inserted in series with the gate, and a constant current is drawn from it, allowing $V_{G}$ to be below $V_{F}$ by $R_{1} I_{1} \\leq V_{T H 3}$. This level shift enables a higher input CM level, simplifying the design of the preceding stage and the tail current source. The value of $I_{1}$ must be much less than $I_{S S} / 2$ to introduce negligible asymmetry between the two sides of the circuit. The reader is encouraged to calculate the input-referred offset voltage resulting from $I_{1}$."
},
{
    "text": "We proceed to examine the small-signal characteristics of the circuit depicted in Fig. 5.27(a), simplifying our analysis by assuming a $\\gamma=0$. The question arises whether the half-circuit principle can be utilized to compute the differential gain for this configuration. As depicted in Fig. 5.31, it becomes evident that with differential inputs of small magnitude, the voltage fluctuations at nodes $F$ and $X$ differ significantly. This discrepancy occurs because the diode-connected transistor $M_{3}$ provides a much lower voltage gain from the input to node $F$ as compared to the input to node $X$. Consequently, the influences of $V_{F}$ and $V_{X}$ at node $P$—individually through $r_{O 1}$ and $r_{O 2}$—do not negate each other, precluding node $P$ from being treated as a virtual ground. Employing the lemma $\\left|A_{v}\\right|=G_{m} R_{\\text {out }}$, our initial approach involves a rough analysis to garner insight, followed by an exact computation of the gain. \n\nThe circuit, as shown in Fig. 5.31, comprises a differential pair with an active current mirror, which integrates PMOS and NMOS transistors. Transistors $M3$ and $M4$ constitute the active current mirror, while the architecture is intended to manage asymmetric voltage oscillations at nodes $F$ and $X$. For the purpose of analysis, node $P$ is approximated as a virtual ground.\n\nMoving to the approximate analysis for determining $G_{m}$, we refer to Fig. 5.32(a). Despite the lack of symmetry in the circuit, the impedance at node $F$ is relatively low, and the voltage swing at this node is minor, leading to the conclusion that the current flowing back to $P$ via $r_{O 1}$ is insignificant. Thus, node $P$ can be approximated as a virtual ground, as shown in Fig. 5.32(b). From this, we deduce that $I_{D 1}=\\left|I_{D 3}\\right|=\\left|I_{D 4}\\right|=g_{m 1,2} V_{i n} / 2$ and $I_{D 2}=-g_{m 1,2} V_{i n} / 2$, resulting in $I_{\\text {out }}=-g_{m 1,2} V_{i n}$, and therefore $\\left|G_{m}\\right|=g_{m 1,2}$. It is important to note that, due to the active current mirror mechanism, this value is double the transconductance of the circuit depicted in Fig. 5.23(b).\n\nDetermining $R_{\\text {out }}$ is more complex. One might assume that the output resistance of the circuit corresponds to that of the circuit in Fig. 5.23(c), specifically $\\left(2 r_{O 2}\\right) \\| r_{O 4}$. However, the active mirror function yields a different result because the gate voltage of $M_{4}$ is not constant when a voltage is applied to the output to measure $R_{\\text {out }}$. Instead of depicting the entire equivalent circuit, we note that for small signals, $I_{S S}$ is in an open state [Fig. 5.33(a)]. Any current flowing into $M_{1}$ must exit through $M_{2}$, and the function of these two transistors can be substituted with a resistor $R_{X Y}=2 r_{O 1,2}$ [Fig. 5.33(b)]. As a consequence, the current sourced from $V_{X}$ by $R_{X Y}$ is mirrored by $M_{3}$ onto $M_{4}$ with unitary gain. This current is expressed as\n\n$$\nV_{X} /\\left[2 r_{O 1,2}+\\left(1 / g_{m 3}\\right) \\| r_{O 3}\\right].\n$$\n\nMultiplying this current by $\\left(1 / g_{m 3}\\right) \\| r_{O 3}$ yields the gate-source voltage of $M_{4}$, which, when multiplied by $g_{m 4}$, provides\n\n$$\n\\begin{equation*}\nI_{X}=\\frac{V_{X}}{2 r_{O 1,2}+\\frac{1}{g_{m 3}} \\| r_{O 3}}\\left[1+\\left(\\frac{1}{g_{m 3}} \\| r_{O 3}\\right) g_{m 4}\\right]+\\frac{V_{X}}{r_{O 4}} \\tag{5.27}\n\\end{equation*}\n$$\n\nFor $2 r_{O 1,2} \\gg\\left(1 / g_{m 3}\\right) \\| r_{O 3}$, we approximate\n\n$$\n\\begin{equation*}\nR_{\\text {out }} \\approx r_{O 2} \\| r_{O 4} \\tag{5.28}\n\\end{equation*}\n$$\n\nConsequently, the overall voltage gain is roughly $\\left|A_{v}\\right|=G_{m} R_{o u t}=g_{m 1,2}\\left(r_{O 2} \\| r_{O 4}\\right)$, somewhat greater than that of the circuit in Fig. 5.23(a).\n\nFor the exact analysis, we must calculate both the $G_{m}$ and $R_{\\text {out }}$ of the OTA. We commence by determining $G_{m}$, without grounding node $P$, by solving the equivalent circuit presented in Fig. 5.34. For the sake of conciseness, we employ the subscript 1 to represent both $M_{1}$ and $M_{2}$. Since the current flowing downward through $\\left(1 / g_{m 3}\\right) \\| r_{O 3}$ (denoted by $r_{d}$ hereafter) is $-V_{4} / r_{d}$, $r_{O 1}$ bears a voltage equal to $\\left(-V_{4} / r_{d}-g_{m 1} V_{1}\\right) r_{O 1}$. Adding this voltage to $V_{P}=V_{i n 1}-V_{1}$, we derive\n\n$$\n\\begin{equation*}\n\\left(-\\frac{V_{4}}{r_{d}}-g_{m 1} V_{1}\\right) r_{O 1}+V_{i n 1}-V_{1}=V_{4} \\tag{5.29}\n\\end{equation*}\n$$\n\nFurthermore, we recognize that the sum of $g_{m 2} V_{2}$ and the current flowing through $r_{O 2}$ equals $V_{4} / r_{d}$ (why?). That is\n\n$$\n\\begin{equation*}\ng_{m 2} V_{2}-\\frac{V_{i n 2}-V_{2}}{r_{O 2}}=\\frac{V_{4}}{r_{D}} \\tag{5.30}\n\\end{equation*}\n$$\n\nSolving for $V_{1}$ and $V_{2}$ from these equations in terms of $V_{4}$ and considering that $V_{1}-V_{2}=V_{i n 1}-V_{i n 2}$ and $I_{\\text {out }}=g_{m 4} V_{4}+V_{4} / r_{d}$, we obtain\n\n$$\n\\begin{equation*}\nI_{\\text {out }}=-g_{m 1} r_{O 1} \\frac{g_{m 4} r_{d}+1}{r_{d}+2 r_{O 1}}\\left(V_{i n 1}-V_{i n 2}\\right) \\tag{5.31}\n\\end{equation*}\n$$\n\nThus, we find\n\n$$\n\\begin{equation*}\nG_{m}=-g_{m 1} r_{O 1} \\frac{g_{m 4} r_{d}+1}{r_{d}+2 r_{O 1}} \\tag{5.32}\n\\end{equation*}\n$$\n\nIn the subsequent step, we calculate $R_{\\text {out }}$. By expressing the output admittance from Eq. (5.27) as\n\n$$\n\\begin{align*}\n\\frac{I_{X}}{V_{X}} & =\\frac{1+g_{m 4} r_{d}}{2 r_{O 1}+r_{d}}+\\frac{1}{r_{O 4}}  \\tag{5.33}\\\\\n& =\\frac{\\left(1+g_{m 4} r_{d}\\right) r_{O 4}+2 r_{O 1}+r_{d}}{\\left(2 r_{O 1}+r_{d}\\right) r_{O 4}} \\tag{5.34}\n\\end{align*}\n$$\n\nwe arrive at\n\n$$\n\\begin{equation*}\nG_{m} R_{o u t}=-g_{m 1} r_{O 1} \\frac{\\left(g_{m 4} r_{d}+1\\right) r_{O 4}}{\\left(g_{m 4} r_{d}+1\\right) r_{O 4}+2 r_{O 1}+r_{d}} \\tag{5.35}\n\\end{equation*}\n$$\n\nGiven that $r_{d}=r_{O 3} /\\left(1+g_{m 3} r_{O 3}\\right)$, this expression simplifies to\n\n$$\n\\begin{align*}\nG_{m} R_{o u t} & =-g_{m 1} r_{O 1} r_{O 4} \\frac{2 g_{m 3} r_{O 3}+1}{\\left(2 g_{m 3} r_{O 3}+1\\right) r_{O 4}+2 r_{O 1}\\left(1+g_{m 3} r_{O 3}\\right)+r_{O 3}}  \\tag{5.36}\\\\\n& =-\\frac{g_{m 1} r_{O 1} r_{O 4}}{r_{O 1}+r_{O 3}} \\cdot \\frac{2 g_{m 3} r_{O 3}+1}{2\\left(g_{m 3} r_{O 3}+1\\right)} \\tag{5.37}\n\\end{align*}\n$$\n\nHence, we acquire a simple yet precise expression for the gain:\n\n$$\n\\begin{equation*}\n\\left|A_{v}\\right|=g_{m 1}\\left(r_{O 1}| | r_{O 4}\\right) \\frac{2 g_{m 4} r_{O 4}+1}{2\\left(g_{m 4} r_{O 4}+1\\right)} \\tag{5.38}\n\\end{equation*}\n$$\n\nThis result can be interpreted as our approximate solution, $g_{m 1}\\left(r_{O 1} \\| r_{O 4}\\right)$, multiplied by a \"correction\" factor that is less than unity. For instance, if $g_{m 4} r_{O 4}=5$, then $\\left|A_{v}\\right|=0.92 g_{m 1}\\left(r_{O 1} \\| r_{O 4}\\right)$.\n\n#### Example 5.11\n\nUtilizing the derived results, calculate the output response to an input CM change, disregarding mismatches.\n\n#### Solution\n\nTo represent an input CM change, we set $V_{i n 1}=V_{i n 2}$ in Fig. 5.34, which from Eq. (5.31) yields $I_{o u t}=0$. Consequently, the single-ended output voltage is insensitive to the input CM change.\n\n#### Example 5.12\n\nCompute the small-signal voltage gain of the circuit depicted in Fig. 5.35. How does the performance of this circuit compare with a differential pair with an active mirror?\n\n#### Solution\n\nThe gain is given by $A_{v}=g_{m 1}\\left(r_{O 1} \\| r_{O 2}\\right)$, analogous to the value previously derived. For given device dimensions, this circuit necessitates only half of the bias current required to achieve the same gain as a differential pair. Nonetheless, the benefits of differential operation, such as reduced sensitivity to CM noise and lower distortion, frequently compensate for the power expenditure.\n\nThe aforementioned gain calculations assume an ideal tail current source. In actuality, the output impedance of this source affects the gain, albeit the error is relatively minor.\n\nRegarding headroom concerns, the five-transistor OTA is not well-suited for low-voltage operation since the diode-connected PMOS transistor tends to necessitate a considerable voltage headroom. To address this, as shown in Fig. 5.36, we incorporate a resistor in series with the gate and draw a constant current from it, thereby allowing $V_{G}$ to be低于 $V_{F}$ by $R_{1} I_{1} \\leq V_{T H 3}$. With this level shift, the input CM level can be heightened, simplifying the design of the preceding stage and the tail current source. The value of $I_{1}$ must be substantially less than $I_{S S} / 2$ to introduce negligible asymmetry between the two sides of the circuit. The reader is encouraged to calculate the input-referred offset voltage resulting from $I_{1}$."
}
]