[

{
    "text": "A \"single-ended\" signal is characterized by being measured relative to a fixed potential, typically the ground [Fig. 4.1(a)]. Conversely, a differential signal is defined as one measured between two nodes that exhibit equal but opposite signal deviations around a fixed potential [Fig. 4.1(b)]. Strictly speaking, these two nodes must also present equal impedances to that potential. The \"center\" potential in differential signaling is termed the \"common-mode\" (CM) level, which can be viewed as the bias voltage of the signals, i.e., the voltage present when no signals are active.\n\nSpecifying signal swings in a differential system can be perplexing. Assume each single-ended output in Fig. 4.1(b) has a peak amplitude of $V_{0}$. Consequently, the single-ended peak-to-peak swing is $2 V_{0}$, while the differential peak-to-peak swing is $4 V_{0}$. For instance, if the voltage at $X$ (relative to ground) is $V_{0} \\cos \\omega t + V_{C M}$ and at $Y$ is $-V_{0} \\cos \\omega t + V_{C M}$, then the peak-to-peak swing of $V_{X} - V_{Y}$ $\\left(= 2 V_{0} \\cos \\omega t\\right)$ is $4 V_{0}$. Thus, it's feasible for a circuit with a 1 V supply voltage to achieve a peak-to-peak differential swing of 1.6 V.\n\nA significant benefit of differential operation over single-ended signaling is its enhanced resistance to \"environmental\" noise. Consider the scenario in Fig. 4.2, where two adjacent lines in a circuit carry a small, sensitive signal and a large clock waveform. Due to capacitive coupling, transitions on line $L_{2}$ distort the signal on line $L_{1}$. However, if the sensitive signal is distributed as two equal but opposite phases, as shown in Fig. 4.2(b), and the clock line is placed midway between them, the transitions affect the differential phases equally, preserving the difference. Although the common-mode level of the phases is disturbed, the differential output remains uncorrupted, demonstrating the arrangement's ability to \"reject\" common-mode noise. ${ }^{1}$\n\nimage_name:(a)\ndescription:The circuit in Figure 4.1(a) depicts a single-ended signal with resistor Zs connected to capacitor X2, driven by voltage source Vin. NMOS M1 is linked to a load resistor and driven by signal g1, illustrating signal corruption due to line coupling.\nimage_name:(b)\ndescription:The circuit diagram showcases a differential signaling setup with common-mode noise rejection, featuring NMOS transistors M1 and M2 and a clock line between two signal lines. Resistors labeled LOAD connect to power supply VDD, with capacitors L1, L2, and L3 for signal coupling and decoupling, and inverter CK driving the clock line.\n\nFigure 4.2 (a) Signal corruption due to coupling; (b) reduction of coupling via differential operation.\n\nAnother instance of common-mode rejection occurs with noisy supply voltages. In the CS stage of Fig. 4.3(a), if $V_{D D}$ varies by $\\Delta V$, then $V_{\\text {out }}$ changes by roughly the same amount, indicating high susceptibility to noise on $V_{D D}$. In contrast, the circuit in Fig. 4.3(b), if symmetric, experiences noise on $V_{D D}$ affecting $V_{X}$ and $V_{Y}$, but not $V_{X} - V_{Y} = V_{\\text {out }}$. Hence, Fig. 4.3(b)'s circuit is more resilient against supply noise.\nimage_name:(a)\ndescription:\n[\nname: M1, type: NMOS, ports: {S: GND, D: Vout, G: Vin}\nname: RD, type: Resistor, value: RD, ports: {N1: VDD, N2: Vout}\n]\nextrainfo:The circuit is a common-source amplifier with a resistive load, vulnerable to noise on supply voltage VDD, amplifying input voltage Vin to output voltage Vout.\nimage_name:(b)\ndescription:\n[\nname: M1, type: NMOS, ports: {S: GND, D: X, G: Vip}\nname: M2, type: NMOS, ports: {S: GND, D: Y, G: Vin}\nname: RD, type: Resistor, value: RD, ports: {N1: VDD, N2: X}\nname: RD, type: Resistor, value: RD, ports: {N1: VDD, N2: Y}\n]\nextrainfo:The circuit is a differential amplifier with NMOS transistors M1 and M2, designed to reject common-mode noise on VDD. Outputs Vx and Vy are differential, enhancing noise immunity.\nFigure 4.3 Impact of supply noise on (a) a single-ended circuit and (b) a differential circuit.\n\nThus far, we've highlighted the importance of using differential paths for sensitive signals (\"victims\"). Similarly, employing differential distribution for noisy lines (\"aggressors\") is advantageous. For example, if the clock signal in Fig. 4.2 is distributed differentially across two lines (Fig. 4.4), perfect symmetry ensures that components coupled from $C K$ and $\\overline{C K}$ to the signal line neutralize each other.\nimage_name:Figure 4.4\ndescription:\n[\nname: M1, type: NMOS, ports: {S: GND, D: Vx, G: Vin}\nname: LOAD, type: Resistor, value: LOAD, ports: {N1: Vx, N2: CK}\nname: L1, type: Inverter, ports: {In: Vx, Out: L1_out}\nname: L2, type: Inverter, ports: {In: CK, Out: L2_out}\nname: L3, type: Inverter, ports: {In: CK, Out: L3_out}\n]\nextrainfo:The circuit diagram illustrates differential clock distribution to mitigate coupled noise, using inverters and an NMOS transistor. The clock signal is distributed in CK and \\overline{CK} lines with inverters L2 and L3.\nimage_name:Figure 4.4\ndescription:The diagram in Figure 4.4 depicts a differential circuit configuration with both differential victims and aggressors. It comprises three main lines (L1, L2, L3) connected to differential clock signals (CK and \\( \\overline{CK} \\)), fed through inverters.\n\n1. **Type of Graph and Function:**\n- The diagram is a schematic of an electronic circuit, focusing on differential signaling.\n\n2. **Axes Labels and Units:**\n- As a circuit schematic, it lacks typical graph axes or units, featuring components like transistors, capacitors, and inductors.\n\n3. **Overall Behavior and Trends:**\n- The circuit demonstrates differential signaling, with differential aggressors (clock signals) surrounding differential victims (signal path), aiming to minimize noise coupling through symmetry.\n- Waveform representations on the right show expected signal shapes: square waves for clock signals and a sinusoidal waveform for the victim signal.\n\n4. **Key Features and Technical Details:**\n- **Transistor \\( M_1 \\):** A MOSFET connected to input voltage \\( V_{in} \\) and ground, controlling the signal path.\n- **Load Resistor \\( L_{\\text{OAP}} \\):** In series with the transistor, affecting the load.\n- **Inductors (L1, L2, L3):** Part of the differential paths, aiding symmetry and reducing noise coupling.\n- **Capacitors:** Used for filtering or coupling between lines.\n\n5. **Annotations and Specific Data Points:**\n- Waveforms illustrate the differential nature of the signals: top and bottom are square waves (clock signals), and the middle is sinusoidal (victim signal).\n- The differential approach aims to demonstrate noise reduction through circuit symmetry.\n\n#### Example 4.1\n\nCan we opt for differential phases for both victims and aggressors if it enhances overall noise immunity?\n\n#### Solution\n\nYes, we can. Consider the setup in Fig. 4.5(a), where differential victims are surrounded by differential aggressors. However, in this case, $V_{\\text {out }}^{+} - V_{\\text {out }}^{-}$ is corrupted due to opposite jumps in $V_{\\text {out }}^{+}$ and $V_{\\text {out }}^{-}$.\nimage_name:Figure 4.5(a)\ndescription:The circuit in Figure 4.5(a) shows differential victims surrounded by differential aggressors, with outputs Vout+ and Vout- experiencing opposite voltage jumps, leading to differential output corruption.\nimage_name:Figure 4.5(b)\ndescription:The circuit employs twisted pair routing for noise cancellation, where Vout+ and Vout- are adjacent to CK and CK_bar for half the distance, then swapped for the remaining half, effectively neutralizing coupling from CK and CK_bar.\n\nNow, if we alter the routing as in Fig. 4.5(b), where $V_{\\text {out }}^{+}\\left(V_{\\text {out }}^{-}\\right)$ is adjacent to $C K(\\overline{C K})$ for half the distance and to $\\overline{C K}(C K)$ for the rest, the couplings from $C K$ and $\\overline{C K}$ cancel each other. Consequently, $V_{\\text {out }}^{+}$ and $V_{\\text {out }}^{-}$ remain free from coupling, as does their difference. This configuration exemplifies \"twisted pairs.\"\n\nAnother advantage of differential signaling is the increase in maximum achievable voltage swings. In Fig. 4.3's circuit, for instance, the maximum output swing at $X$ or $Y$ is $V_{D D} - \\left(V_{G S} - V_{T H}\\right)$, while for $V_{X} - V_{Y}$, the peak-to-peak swing is $2\\left[V_{D D} - \\left(V_{G S} - V_{T H}\\right)\\right]$. Differential circuits also offer simpler biasing and higher linearity (Chapter 14) compared to single-ended circuits.\n\nAlthough differential circuits may require approximately twice the area of single-ended alternatives, this drawback is minor. The extensive benefits of differential operation significantly outweigh the potential increase in area."
},
{
    "text": "A \"single-ended\" signal is characterized by being measured relative to a fixed potential, typically the ground [Fig. 4.1(a)]. Conversely, a differential signal is defined as one measured between two nodes that exhibit equal but opposite signal deviations around a fixed potential [Fig. 4.1(b)]. Strictly speaking, these two nodes must also present equal impedances to that potential. The \"center\" potential in differential signaling is termed the \"common-mode\" (CM) level, which can be viewed as the bias voltage of the signal, i.e., the voltage level in the absence of any signal.\n\nUnderstanding signal swings in a differential system can be perplexing. Assume each single-ended output in Fig. 4.1(b) has a peak amplitude of $V_{0}$. Consequently, the single-ended peak-to-peak swing is $2 V_{0}$, while the differential peak-to-peak swing is $4 V_{0}$. For instance, if the voltage at $X$ (relative to ground) is $V_{0} \\cos \\omega t + V_{C M}$ and at $Y$ is $-V_{0} \\cos \\omega t + V_{C M}$, then the peak-to-peak swing of $V_{X} - V_{Y}$ $\\left(= 2 V_{0} \\cos \\omega t\\right)$ amounts to $4 V_{0}$. Thus, it's feasible for a circuit with a 1 V supply voltage to achieve a peak-to-peak differential swing of 1.6 V.\n\nA significant benefit of differential operation over single-ended signaling is its enhanced resistance to \"environmental\" noise. Consider the scenario in Fig. 4.2, where two adjacent lines in a circuit carry a small, sensitive signal and a large clock waveform. Due to capacitive coupling between the lines, transitions on line $L_{2}$ degrade the signal on line $L_{1}$. However, if the sensitive signal is distributed as two equal but opposite phases, as shown in Fig. 4.2(b), and the clock line is positioned midway between them, the transitions affect the differential phases equally, preserving the difference. Although the common-mode level of the two phases is disturbed, the differential output remains intact, demonstrating the arrangement's ability to \"reject\" common-mode noise. ${ }^{1}$\n\nimage_name:(a)\ndescription:The circuit in Figure 4.1(a) illustrates a single-ended signal with a resistor Zs connected to a capacitor X2, driven by a voltage source Vin. The NMOS M1 is linked to a load resistor and driven by a signal g1, showcasing signal corruption due to line coupling.\nimage_name:(b)\ndescription:The circuit diagram depicts a differential signaling setup with common-mode noise rejection, featuring NMOS transistors M1 and M2 and a clock line placed between two signal lines. Resistors labeled LOAD are connected to a power supply VDD, with capacitors L1, L2, and L3 used for signal coupling and decoupling. An inverter CK drives the clock line.\n\nFigure 4.2 (a) Signal corruption due to coupling; (b) reduction of coupling through differential operation.\n\nAnother instance of common-mode rejection occurs with noisy supply voltages. In the CS stage of Fig. 4.3(a), if $V_{D D}$ varies by $\\Delta V$, then $V_{\\text {out }}$ changes by roughly the same amount, indicating high susceptibility to noise on $V_{D D}$. In contrast, the circuit in Fig. 4.3(b), if symmetric, experiences noise on $V_{D D}$ affecting $V_{X}$ and $V_{Y}$, but not $V_{X} - V_{Y} = V_{\\text {out }}$. Thus, Fig. 4.3(b)'s circuit is significantly more resilient to supply noise.\nimage_name:(a)\ndescription:\n[\nname: M1, type: NMOS, ports: {S: GND, D: Vout, G: Vin}\nname: RD, type: Resistor, value: RD, ports: {N1: VDD, N2: Vout}\n]\nextrainfo:The circuit is a common-source amplifier with a resistive load, vulnerable to noise on the supply voltage VDD, amplifying input voltage Vin to produce output voltage Vout.\nimage_name:(b)\ndescription:\n[\nname: M1, type: NMOS, ports: {S: GND, D: X, G: Vip}\nname: M2, type: NMOS, ports: {S: GND, D: Y, G: Vin}\nname: RD, type: Resistor, value: RD, ports: {N1: VDD, N2: X}\nname: RD, type: Resistor, value: RD, ports: {N1: VDD, N2: Y}\n]\nextrainfo:The circuit is a differential amplifier with NMOS transistors M1 and M2, designed to reject common-mode noise on VDD. Outputs Vx and Vy are differential, enhancing noise immunity.\nFigure 4.3 Impact of supply noise on (a) a single-ended circuit and (b) a differential circuit.\n\nThus far, we've highlighted the importance of using differential paths for sensitive signals (\"victims\"). Similarly, employing differential distribution for noisy lines (\"aggressors\") is advantageous. For example, if the clock signal in Fig. 4.2 is distributed differentially across two lines (Fig. 4.4), perfect symmetry ensures that the components coupled from $C K$ and $\\overline{C K}$ to the signal line cancel each other out.\nimage_name:Figure 4.4\ndescription:\n[\nname: M1, type: NMOS, ports: {S: GND, D: Vx, G: Vin}\nname: LOAD, type: Resistor, value: LOAD, ports: {N1: Vx, N2: CK}\nname: L1, type: Inverter, ports: {In: Vx, Out: L1_out}\nname: L2, type: Inverter, ports: {In: CK, Out: L2_out}\nname: L3, type: Inverter, ports: {In: CK, Out: L3_out}\n]\nextrainfo:The circuit diagram demonstrates a differential clock distribution to mitigate coupled noise, utilizing inverters and an NMOS transistor. The clock signal is distributed on both CK and \\overline{CK} lines with inverters L2 and L3.\nimage_name:Figure 4.4\ndescription:Figure 4.4 shows a differential circuit configuration with both differential victims and aggressors. It consists of three main lines, L1, L2, and L3, connected to differential clock signals CK and \\( \\overline{CK} \\), fed through inverters.\n\n1. **Type of Graph and Function:**\n- The diagram is a schematic of an electronic circuit, focusing on differential signaling.\n\n2. **Axes Labels and Units:**\n- As a circuit schematic, it lacks typical graph axes or units, featuring components like transistors, capacitors, and inductors.\n\n3. **Overall Behavior and Trends:**\n- The circuit illustrates differential signaling, with differential aggressors (clock signals) surrounding differential victims (signal path), aiming to minimize noise coupling through symmetry.\n- The waveform representations on the right show expected signal shapes: square waves for clock signals and a sinusoidal waveform for the victim signal.\n\n4. **Key Features and Technical Details:**\n- **Transistor \\( M_1 \\):** A MOSFET connected to input voltage \\( V_{in} \\) and ground, controlling the signal path.\n- **Load Resistor \\( L_{\\text{OAP}} \\):** In series with the transistor, affecting the load.\n- **Inductors (L1, L2, L3):** Part of the differential paths, aiding symmetry and reducing noise coupling.\n- **Capacitors:** Used for filtering or coupling between lines.\n\n5. **Annotations and Specific Data Points:**\n- The waveforms illustrate the differential nature of the signals, with top and bottom waveforms as square waves (clock signals) and the middle waveform as a sinusoidal victim signal.\n- The differential signals demonstrate noise reduction through circuit symmetry.\n\n#### Example 4.1\n\nIf using differential victims or aggressors enhances overall noise immunity, can we opt for differential phases for both?\n\n#### Solution\n\nYes, we can. Consider the setup in Fig. 4.5(a), where differential victims are surrounded by differential aggressors. However, in this case, $V_{\\text {out }}^{+} - V_{\\text {out }}^{-}$ is corrupted due to opposite jumps in $V_{\\text {out }}^{+}$ and $V_{\\text {out }}^{-}$.\nimage_name:Figure 4.5(a)\ndescription:Figure 4.5(a) shows differential victims surrounded by differential aggressors, with outputs Vout+ and Vout- experiencing opposite voltage jumps, leading to differential output corruption.\nimage_name:Figure 4.5(b)\ndescription:The circuit employs twisted pair routing for noise cancellation, where Vout+ and Vout- are adjacent to CK and CK_bar for half the distance, then swapped for the remaining half, effectively canceling coupling from CK and CK_bar.\n\nNow, if we alter the routing as in Fig. 4.5(b), where $V_{\\text {out }}^{+} \\left(V_{\\text {out }}^{-}\\right)$ is adjacent to $C K \\left(\\overline{C K}\\right)$ for half the distance and to $\\overline{C K} \\left(C K\\right)$ for the other half, the couplings from $C K$ and $\\overline{C K}$ cancel each other. Consequently, $V_{\\text {out }}^{+}$ and $V_{\\text {out }}^{-}$ remain free from coupling, as does their difference. This layout exemplifies \"twisted pairs.\"\n\nAnother advantage of differential signaling is the increase in maximum achievable voltage swings. In Fig. 4.3's circuit, for instance, the maximum output swing at $X$ or $Y$ is $V_{D D} - \\left(V_{G S} - V_{T H}\\right)$, while for $V_{X} - V_{Y}$, the peak-to-peak swing is $2 \\left[V_{D D} - \\left(V_{G S} - V_{T H}\\right)\\right]$. Additional benefits of differential circuits over single-ended ones include simpler biasing and higher linearity (Chapter 14).\n\nAlthough differential circuits may occupy approximately twice the area of single-ended alternatives, this is a minor drawback. The numerous advantages of differential operation far outweigh the potential increase in area."
},
{
    "text": "A \"single-ended\" signal is characterized by being measured relative to a fixed potential, typically the ground [Fig. 4.1(a)]. Conversely, a differential signal is one that is measured between two nodes exhibiting equal but opposite signal deviations around a fixed potential [Fig. 4.1(b)]. In a strict sense, these two nodes must also present equal impedances to that potential. The \"center\" potential in differential signaling is termed the \"common-mode\" (CM) level, which can be viewed as the bias voltage of the signals, i.e., the voltage level in the absence of any signal.\n\nUnderstanding signal swings in a differential system can be perplexing. Assume each single-ended output in Fig. 4.1(b) has a peak amplitude of $V_{0}$. Consequently, the single-ended peak-to-peak swing is $2 V_{0}$, while the differential peak-to-peak swing is $4 V_{0}$. For instance, if the voltage at $X$ (relative to ground) is $V_{0} \\cos \\omega t + V_{CM}$ and at $Y$ is $-V_{0} \\cos \\omega t + V_{CM}$, then the peak-to-peak swing of $V_{X} - V_{Y}$ $\\left(= 2 V_{0} \\cos \\omega t\\right)$ is $4 V_{0}$. Thus, it is feasible for a circuit with a 1 V supply voltage to achieve a peak-to-peak differential swing of 1.6 V.\n\nA significant benefit of differential operation over single-ended signaling is its enhanced resistance to \"environmental\" noise. Consider the scenario in Fig. 4.2, where two adjacent lines in a circuit carry a small, sensitive signal and a large clock waveform. Due to capacitive coupling, transitions on line $L_{2}$ distort the signal on line $L_{1}$. Now, if the sensitive signal is distributed as two equal but opposite phases, as shown in Fig. 4.2(b), and the clock line is placed midway between them, the transitions affect the differential phases equally, preserving the difference. Although the common-mode level of the phases is disturbed, the differential output remains uncorrupted, demonstrating the arrangement's ability to \"reject\" common-mode noise. ${ }^{1}$\n\nimage_name:(a)\ndescription:The circuit in Figure 4.1(a) illustrates a single-ended signal with a resistor Zs connected to a capacitor X2, driven by a voltage source Vin. The NMOS M1 is linked to a load resistor and driven by a signal g1. This setup demonstrates signal corruption due to line coupling.\nimage_name:(b)\ndescription:The circuit diagram depicts a differential signaling configuration with common-mode noise rejection. It features NMOS transistors M1 and M2 with a clock line positioned between two signal lines. Resistors labeled LOAD are connected to a power supply VDD, and capacitors L1, L2, and L3 are used for signal coupling and decoupling. An inverter CK drives the clock line.\n\nFigure 4.2 (a) Signal corruption due to coupling; (b) reduction of coupling through differential operation.\n\nAnother instance of common-mode rejection is observed with noisy supply voltages. In the CS stage of Fig. 4.3(a), if $V_{DD}$ varies by $\\Delta V$, then $V_{\\text{out}}$ changes by roughly the same amount, indicating high susceptibility to noise on $V_{DD}$. In contrast, the circuit in Fig. 4.3(b), if symmetric, experiences noise on $V_{DD}$ affecting $V_{X}$ and $V_{Y}$, but not $V_{X} - V_{Y} = V_{\\text{out}}$. Thus, the Fig. 4.3(b) circuit is more resilient to supply noise.\nimage_name:(a)\ndescription:\n[\nname: M1, type: NMOS, ports: {S: GND, D: Vout, G: Vin}\nname: RD, type: Resistor, value: RD, ports: {N1: VDD, N2: Vout}\n]\nextrainfo:The circuit is a common-source amplifier with a resistive load, vulnerable to noise on the supply voltage VDD. It amplifies the input voltage Vin to generate the output voltage Vout.\nimage_name:(b)\ndescription:\n[\nname: M1, type: NMOS, ports: {S: GND, D: X, G: Vip}\nname: M2, type: NMOS, ports: {S: GND, D: Y, G: Vin}\nname: RD, type: Resistor, value: RD, ports: {N1: VDD, N2: X}\nname: RD, type: Resistor, value: RD, ports: {N1: VDD, N2: Y}\n]\nextrainfo:The circuit is a differential amplifier with NMOS transistors M1 and M2, designed to reject common-mode noise on VDD. The outputs Vx and Vy are differential, enhancing noise immunity.\nFigure 4.3 Impact of supply noise on (a) a single-ended circuit and (b) a differential circuit.\n\nSo far, we have highlighted the importance of using differential paths for sensitive signals (\"victims\"). It is also advantageous to use differential distribution for noisy lines (\"aggressors\"). For example, if the clock signal in Fig. 4.2 is distributed differentially across two lines (Fig. 4.4), perfect symmetry ensures that the coupled components from $CK$ and $\\overline{CK}$ to the signal line cancel each other out.\nimage_name:Figure 4.4\ndescription:\n[\nname: M1, type: NMOS, ports: {S: GND, D: Vx, G: Vin}\nname: LOAD, type: Resistor, value: LOAD, ports: {N1: Vx, N2: CK}\nname: L1, type: Inverter, ports: {In: Vx, Out: L1_out}\nname: L2, type: Inverter, ports: {In: CK, Out: L2_out}\nname: L3, type: Inverter, ports: {In: CK, Out: L3_out}\n]\nextrainfo:The circuit diagram shows a differential clock distribution to minimize coupled noise, using inverters and an NMOS transistor. The clock signal is distributed on both CK and \\overline{CK} lines with inverters L2 and L3.\nimage_name:Figure 4.4\ndescription:The diagram in Figure 4.4 presents a differential circuit configuration involving both differential victims and aggressors. It consists of three main lines labeled L1, L2, and L3, connected to differential clock signals CK and \\( \\overline{CK} \\). These clock signals pass through inverters before reaching the lines.\n\n1. **Type of Graph and Function:**\n- The diagram is a schematic of an electronic circuit, focusing on differential signaling.\n\n2. **Axes Labels and Units:**\n- As a circuit schematic, it lacks typical graph axes or units. Instead, it includes components like transistors, capacitors, and inductors.\n\n3. **Overall Behavior and Trends:**\n- The circuit is designed to illustrate differential signaling, where differential aggressors (clock signals) surround differential victims (signal path), aiming to minimize noise coupling through symmetry.\n- The waveform representations on the right show expected signal shapes: square waves for clock signals and a sinusoidal waveform for the victim signal.\n\n4. **Key Features and Technical Details:**\n- **Transistor \\( M_1 \\):** A MOSFET connected to the input voltage \\( V_{in} \\) and ground, controlling the signal path.\n- **Load Resistor \\( L_{\\text{OAP}} \\):** Connected in series with the transistor, affecting the load.\n- **Inductors (L1, L2, L3):** Part of the differential paths, aiding in symmetry and noise reduction.\n- **Capacitors:** Used for filtering or coupling between lines.\n\n5. **Annotations and Specific Data Points:**\n- The waveforms illustrate the differential nature of the signals. The top and bottom waveforms are square waves (differential clock signals), and the middle waveform is sinusoidal (victim signal).\n- The differential signals demonstrate how symmetry in the circuit design can reduce noise.\n\n#### Example 4.1\n\nIf using differential victims or aggressors enhances overall noise immunity, can we opt for differential phases for both victims and aggressors?\n\n#### Solution\n\nYes, we can. Consider the setup in Fig. 4.5(a), where differential victims are surrounded by differential aggressors. However, in this case, $V_{\\text{out}}^{+} - V_{\\text{out}}^{-}$ is corrupted due to opposite voltage jumps experienced by $V_{\\text{out}}^{+}$ and $V_{\\text{out}}^{-}$.\nimage_name:Figure 4.5(a)\ndescription:The circuit in Figure 4.5(a) shows differential victims surrounded by differential aggressors, leading to corruption in the differential output due to opposite voltage jumps at Vout+ and Vout-.\nimage_name:Figure 4.5(b)\ndescription:The circuit employs twisted pair routing for noise cancellation, where Vout+ and Vout- are adjacent to CK and CK_bar for half the distance, then swapped for the remaining half, effectively canceling out coupling from CK and CK_bar.\n\nNow, if we alter the routing as shown in Fig. 4.5(b), where $V_{\\text{out}}^{+} (V_{\\text{out}}^{-})$ is adjacent to $CK (\\overline{CK})$ for half the distance and to $\\overline{CK} (CK)$ for the other half, the couplings from $CK$ and $\\overline{CK}$ cancel each other. Consequently, $V_{\\text{out}}^{+}$ and $V_{\\text{out}}^{-}$ remain free from coupling, as does their difference. This layout exemplifies \"twisted pairs.\"\n\nAnother advantage of differential signaling is the increase in maximum achievable voltage swings. In the Fig. 4.3 circuit, for instance, the maximum output swing at $X$ or $Y$ is $V_{DD} - (V_{GS} - V_{TH})$, while for $V_{X} - V_{Y}$, the peak-to-peak swing is $2[V_{DD} - (V_{GS} - V_{TH})]$. Additional benefits of differential circuits over single-ended ones include simpler biasing and higher linearity (Chapter 14).\n\nAlthough differential circuits may occupy approximately twice the area of single-ended alternatives, this is a minor drawback. The numerous advantages of differential operation significantly outweigh the potential increase in area."
},
{
    "text": "A \"single-ended\" signal is characterized by being measured relative to a fixed potential, typically the ground [Fig. 4.1(a)]. Conversely, a differential signal is defined as one measured between two nodes that exhibit equal but opposite signal deviations around a fixed potential [Fig. 4.1(b)]. In a strict sense, these two nodes must also present equal impedances to that potential. The \"center\" potential in differential signaling is termed the \"common-mode\" (CM) level, which can be viewed as the bias voltage of the signals, i.e., the voltage level in the absence of any signal.\n\nUnderstanding signal swings in a differential system can be perplexing. Assume each single-ended output in Fig. 4.1(b) has a peak amplitude of $V_{0}$. Consequently, the single-ended peak-to-peak swing is $2 V_{0}$, while the differential peak-to-peak swing is $4 V_{0}$. For instance, if the voltage at $X$ (relative to ground) is $V_{0} \\cos \\omega t + V_{CM}$ and at $Y$ is $-V_{0} \\cos \\omega t + V_{CM}$, then the peak-to-peak swing of $V_{X} - V_{Y}$ $\\left(= 2 V_{0} \\cos \\omega t\\right)$ is $4 V_{0}$. Thus, it's feasible for a circuit with a 1 V supply voltage to achieve a peak-to-peak differential swing of 1.6 V.\n\nA significant benefit of differential operation over single-ended signaling is its superior resistance to \"environmental\" noise. Consider the scenario in Fig. 4.2, where two adjacent lines in a circuit carry a small, sensitive signal and a large clock waveform. Due to capacitive coupling, transitions on line $L_{2}$ distort the signal on line $L_{1}$. However, if the sensitive signal is split into two equal but opposite phases, as shown in Fig. 4.2(b), and the clock line is placed midway between them, the transitions affect the differential phases equally, preserving the difference. Although the common-mode level of the phases is disturbed, the differential output remains uncorrupted, demonstrating the arrangement's ability to \"reject\" common-mode noise. ${ }^{1}$\n\nimage_name:(a)\ndescription:The circuit in Figure 4.1(a) illustrates a single-ended signal with a resistor Zs connected to a capacitor X2, driven by a voltage source Vin. The NMOS M1 is linked to a load resistor and driven by a signal g1. This setup demonstrates signal corruption due to line coupling.\nimage_name:(b)\ndescription:The circuit diagram depicts a differential signaling configuration with common-mode noise rejection, featuring NMOS transistors M1 and M2 and a clock line placed between two signal lines. Resistors labeled LOAD connect to a power supply VDD, with capacitors L1, L2, and L3 used for signal coupling and decoupling. An inverter CK drives the clock line.\n\nFigure 4.2 (a) Signal corruption due to coupling; (b) coupling reduction via differential operation.\n\nAnother instance of common-mode rejection occurs with noisy supply voltages. In the CS stage of Fig. 4.3(a), if $V_{DD}$ varies by $\\Delta V$, then $V_{\\text{out}}$ changes by roughly the same amount, indicating high susceptibility to noise on $V_{DD}$. In contrast, the circuit in Fig. 4.3(b), if symmetric, experiences noise on $V_{DD}$ affecting $V_{X}$ and $V_{Y}$, but not $V_{X} - V_{Y} = V_{\\text{out}}$. Thus, Fig. 4.3(b)'s circuit is more resilient against supply noise.\nimage_name:(a)\ndescription:\n[\nname: M1, type: NMOS, ports: {S: GND, D: Vout, G: Vin}\nname: RD, type: Resistor, value: RD, ports: {N1: VDD, N2: Vout}\n]\nextrainfo:The circuit is a common-source amplifier with a resistive load, prone to noise on the supply voltage VDD. It amplifies input voltage Vin to generate output voltage Vout.\nimage_name:(b)\ndescription:\n[\nname: M1, type: NMOS, ports: {S: GND, D: X, G: Vip}\nname: M2, type: NMOS, ports: {S: GND, D: Y, G: Vin}\nname: RD, type: Resistor, value: RD, ports: {N1: VDD, N2: X}\nname: RD, type: Resistor, value: RD, ports: {N1: VDD, N2: Y}\n]\nextrainfo:The circuit is a differential amplifier with NMOS transistors M1 and M2, designed to reject common-mode noise on VDD. Outputs Vx and Vy are differential, enhancing noise immunity.\nFigure 4.3 Impact of supply noise on (a) a single-ended circuit and (b) a differential circuit.\n\nSo far, we've highlighted the importance of using differential paths for sensitive signals (\"victims\"). Similarly, employing differential distribution for noisy lines (\"aggressors\") is advantageous. For example, if the clock signal in Fig. 4.2 is distributed differentially across two lines (Fig. 4.4), perfect symmetry ensures that the coupled components from $CK$ and $\\overline{CK}$ to the signal line cancel each other out.\nimage_name:Figure 4.4\ndescription:\n[\nname: M1, type: NMOS, ports: {S: GND, D: Vx, G: Vin}\nname: LOAD, type: Resistor, value: LOAD, ports: {N1: Vx, N2: CK}\nname: L1, type: Inverter, ports: {In: Vx, Out: L1_out}\nname: L2, type: Inverter, ports: {In: CK, Out: L2_out}\nname: L3, type: Inverter, ports: {In: CK, Out: L3_out}\n]\nextrainfo:The circuit diagram shows a differential clock distribution to minimize coupled noise, using inverters and an NMOS transistor. The clock signal is distributed on both CK and \\overline{CK} lines with inverters L2 and L3.\nimage_name:Figure 4.4\ndescription:The diagram in Figure 4.4 presents a differential circuit setup involving both differential victims and aggressors. It comprises three main lines labeled L1, L2, and L3, connected to differential clock signals CK and \\( \\overline{CK} \\). These clock signals pass through inverters before reaching the lines.\n\n1. **Type of Graph and Function:**\n- The diagram is a schematic of an electronic circuit, specifically highlighting differential signaling.\n\n2. **Axes Labels and Units:**\n- As a circuit schematic, it lacks typical graph axes or units. Instead, it includes components like transistors, capacitors, and inductors.\n\n3. **Overall Behavior and Trends:**\n- The circuit demonstrates differential signaling, with differential aggressors (clock signals) surrounding differential victims (signal path), aiming to minimize noise coupling through symmetry.\n- The waveform representations on the right show expected signal shapes: square waves for clock signals and a sinusoidal waveform for the victim signal.\n\n4. **Key Features and Technical Details:**\n- **Transistor \\( M_1 \\):** A MOSFET connected to input voltage \\( V_{in} \\) and ground, controlling the signal path.\n- **Load Resistor \\( L_{\\text{OAP}} \\):** In series with the transistor, affecting the load it sees.\n- **Inductors (L1, L2, L3):** Part of the differential paths, aiding symmetry and reducing noise coupling.\n- **Capacitors:** Positioned between lines for filtering or coupling.\n\n5. **Annotations and Specific Data Points:**\n- The waveforms illustrate the differential nature of the signals. The top and bottom waveforms are square waves (differential clock signals), while the middle waveform is sinusoidal (victim signal).\n- The differential design aims to show how symmetry in the circuit can reduce noise, as suggested by the context.\n\n#### Example 4.1\n\nIf using differential victims or aggressors enhances overall noise immunity, can we opt for differential phases for both?\n\n#### Solution\n\nYes, we can. Consider the setup in Fig. 4.5(a), where differential victims are surrounded by differential aggressors. However, in this case, $V_{\\text{out}}^{+} - V_{\\text{out}}^{-}$ is corrupted due to opposite jumps experienced by $V_{\\text{out}}^{+}$ and $V_{\\text{out}}^{-}$.\nimage_name:Figure 4.5(a)\ndescription:The circuit in Figure 4.5(a) shows differential victims surrounded by differential aggressors, with outputs Vout+ and Vout- experiencing opposite voltage jumps, leading to differential output corruption.\nimage_name:Figure 4.5(b)\ndescription:The circuit employs twisted pair routing for noise cancellation, where Vout+ and Vout- are adjacent to CK and CK_bar for half the distance, then swapped for the remaining half, effectively canceling out coupling from CK and CK_bar.\n\nNow, if we alter the routing as in Fig. 4.5(b), where $V_{\\text{out}}^{+} \\left(V_{\\text{out}}^{-}\\right)$ is adjacent to $CK \\left(\\overline{CK}\\right)$ for half the distance and to $\\overline{CK} \\left(CK\\right)$ for the other half, the couplings from $CK$ and $\\overline{CK}$ cancel each other. Consequently, $V_{\\text{out}}^{+}$ and $V_{\\text{out}}^{-}$ remain free from coupling, as does their difference. This configuration exemplifies \"twisted pairs.\"\n\nAnother advantage of differential signaling is the increase in maximum achievable voltage swings. In Fig. 4.3's circuit, for instance, the maximum output swing at $X$ or $Y$ is $V_{DD} - \\left(V_{GS} - V_{TH}\\right)$, whereas for $V_{X} - V_{Y}$, the peak-to-peak swing is $2\\left[V_{DD} - \\left(V_{GS} - V_{TH}\\right)\\right]$. Additional benefits of differential circuits over single-ended ones include simpler biasing and higher linearity (Chapter 14).\n\nDespite differential circuits occupying roughly twice the area of single-ended alternatives, this drawback is minor. The numerous advantages of differential operation significantly outweigh any potential increase in area."
},
{
    "text": "A \"single-ended\" signal is characterized as one measured relative to a fixed potential, typically the ground [Fig. 4.1(a)]. Conversely, a differential signal is defined as one measured between two nodes that exhibit equal but opposite signal variations around a fixed potential [Fig. 4.1(b)]. Strictly speaking, these two nodes must also present equal impedances to that potential. The \"center\" potential in differential signaling is termed the \"common-mode\" (CM) level, which can be viewed as the bias voltage of the signals, i.e., the voltage level in the absence of any signal.\n\nSpecifying signal swings in a differential system can be perplexing. Assume each single-ended output in Fig. 4.1(b) has a peak amplitude of $V_{0}$. Consequently, the single-ended peak-to-peak swing is $2 V_{0}$, while the differential peak-to-peak swing is $4 V_{0}$. For instance, if the voltage at $X$ (relative to ground) is $V_{0} \\cos \\omega t + V_{CM}$ and at $Y$ is $-V_{0} \\cos \\omega t + V_{CM}$, then the peak-to-peak swing of $V_{X} - V_{Y}$ $\\left(= 2 V_{0} \\cos \\omega t\\right)$ is $4 V_{0}$. Thus, it is feasible for a circuit with a 1 V supply voltage to achieve a peak-to-peak differential swing of 1.6 V.\n\nA significant benefit of differential operation over single-ended signaling is its enhanced resistance to \"environmental\" noise. Consider the scenario in Fig. 4.2, where two adjacent lines in a circuit carry a small, sensitive signal and a large clock waveform. Due to capacitive coupling between the lines, transitions on line $L_{2}$ distort the signal on line $L_{1}$. Now, if the sensitive signal is distributed as two equal but opposite phases, as shown in Fig. 4.2(b), and the clock line is positioned midway between them, the transitions affect the differential phases equally, preserving the difference. Although the common-mode level of the two phases is disturbed, the differential output remains uncorrupted, demonstrating the arrangement's ability to \"reject\" common-mode noise. ${ }^{1}$\n\nimage_name:(a)\ndescription:The circuit in Figure 4.1(a) illustrates a single-ended signal with a resistor Zs connected to a capacitor X2, driven by a voltage source Vin. The NMOS M1 is linked to a load resistor and driven by a signal g1. This setup demonstrates signal corruption due to line coupling.\nimage_name:(b)\ndescription:The circuit diagram depicts a differential signaling configuration with common-mode noise rejection. It employs NMOS transistors M1 and M2 with a clock line placed between two signal lines. Resistors labeled LOAD are connected to a power supply VDD. Capacitors L1, L2, and L3 are used for signal coupling and decoupling. An inverter CK drives the clock line.\n\nFigure 4.2 (a) Signal corruption due to coupling; (b) reduction of coupling through differential operation.\n\nAnother instance of common-mode rejection occurs with noisy supply voltages. In the CS stage of Fig. 4.3(a), if $V_{DD}$ varies by $\\Delta V$, then $V_{\\text{out}}$ changes by roughly the same amount, indicating high susceptibility to noise on $V_{DD}$. In contrast, the circuit in Fig. 4.3(b), if symmetric, experiences noise on $V_{DD}$ affecting $V_{X}$ and $V_{Y}$, but not $V_{X} - V_{Y} = V_{\\text{out}}$. Hence, the Fig. 4.3(b) circuit is more resilient to supply noise.\nimage_name:(a)\ndescription:\n[\nname: M1, type: NMOS, ports: {S: GND, D: Vout, G: Vin}\nname: RD, type: Resistor, value: RD, ports: {N1: VDD, N2: Vout}\n]\nextrainfo:The circuit is a common-source amplifier with a resistive load, vulnerable to noise on the supply voltage VDD. It amplifies the input voltage Vin to generate the output voltage Vout.\nimage_name:(b)\ndescription:\n[\nname: M1, type: NMOS, ports: {S: GND, D: X, G: Vip}\nname: M2, type: NMOS, ports: {S: GND, D: Y, G: Vin}\nname: RD, type: Resistor, value: RD, ports: {N1: VDD, N2: X}\nname: RD, type: Resistor, value: RD, ports: {N1: VDD, N2: Y}\n]\nextrainfo:The circuit is a differential amplifier with NMOS transistors M1 and M2, designed to reject common-mode noise on VDD. The outputs Vx and Vy are differential, enhancing noise immunity.\nFigure 4.3 Impact of supply noise on (a) a single-ended circuit and (b) a differential circuit.\n\nThus far, we have highlighted the importance of using differential paths for sensitive signals (\"victims\"). It is also advantageous to use differential distribution for noisy lines (\"aggressors\"). For example, if the clock signal in Fig. 4.2 is distributed differentially across two lines (Fig. 4.4), perfect symmetry ensures that the components coupled from $CK$ and $\\overline{CK}$ to the signal line cancel each other out.\nimage_name:Figure 4.4\ndescription:\n[\nname: M1, type: NMOS, ports: {S: GND, D: Vx, G: Vin}\nname: LOAD, type: Resistor, value: LOAD, ports: {N1: Vx, N2: CK}\nname: L1, type: Inverter, ports: {In: Vx, Out: L1_out}\nname: L2, type: Inverter, ports: {In: CK, Out: L2_out}\nname: L3, type: Inverter, ports: {In: CK, Out: L3_out}\n]\nextrainfo:The circuit diagram shows a differential clock distribution to mitigate coupled noise, using inverters and an NMOS transistor. The clock signal is distributed on both CK and \\overline{CK} lines with inverters L2 and L3.\nimage_name:Figure 4.4\ndescription:The diagram in Figure 4.4 shows a differential circuit configuration with both differential victims and aggressors. It consists of three main lines labeled L1, L2, and L3, connected to differential clock signals CK and \\( \\overline{CK} \\). These clock signals pass through inverters before reaching the lines.\n\n1. **Type of Graph and Function:**\n- The diagram is a schematic of an electronic circuit, focusing on differential signaling.\n\n2. **Axes Labels and Units:**\n- As a circuit schematic, it lacks typical graph axes or units. Instead, it includes components like transistors, capacitors, and inductors.\n\n3. **Overall Behavior and Trends:**\n- The circuit demonstrates differential signaling, with differential aggressors (clock signals) surrounding differential victims (signal path), aiming to minimize noise coupling through symmetry.\n- The waveform representations on the right show expected signal shapes: square waves for clock signals and a sinusoidal waveform for the victim signal.\n\n4. **Key Features and Technical Details:**\n- **Transistor \\( M_1 \\):** A MOSFET connected to input voltage \\( V_{in} \\) and ground, controlling the signal path.\n- **Load Resistor \\( L_{\\text{OAP}} \\):** Connected in series with the transistor, affecting the load.\n- **Inductors (L1, L2, L3):** Part of the differential paths, aiding symmetry and reducing noise coupling.\n- **Capacitors:** Positioned between lines for filtering or coupling.\n\n5. **Annotations and Specific Data Points:**\n- The waveforms illustrate the differential nature of the signals. The top and bottom waveforms are square waves (differential clock signals), while the middle waveform is sinusoidal (victim signal).\n- The differential signals aim to show how symmetry in circuit design reduces noise.\n\n#### Example 4.1\n\nIf using differential victims or aggressors enhances overall noise immunity, can we opt for differential phases for both?\n\n#### Solution\n\nYes, we can. Consider the setup in Fig. 4.5(a), where differential victims are surrounded by differential aggressors. However, in this case, $V_{\\text{out}}^{+} - V_{\\text{out}}^{-}$ is corrupted due to opposite voltage jumps experienced by $V_{\\text{out}}^{+}$ and $V_{\\text{out}}^{-}$.\nimage_name:Figure 4.5(a)\ndescription:The circuit in Figure 4.5(a) shows differential victims surrounded by differential aggressors. Outputs Vout+ and Vout- experience opposite voltage jumps, leading to corruption in the differential output.\nimage_name:Figure 4.5(b)\ndescription:The circuit employs twisted pair routing for noise cancellation, where Vout+ and Vout- are adjacent to CK and CK_bar for half the distance, then swapped for the remaining half, effectively canceling out coupling from CK and CK_bar.\n\nNow, if we alter the routing as in Fig. 4.5(b), where $V_{\\text{out}}^{+} \\left(V_{\\text{out}}^{-}\\right)$ is adjacent to $CK \\left(\\overline{CK}\\right)$ for half the distance and to $\\overline{CK} \\left(CK\\right)$ for the other half, the couplings from $CK$ and $\\overline{CK}$ cancel each other. Consequently, $V_{\\text{out}}^{+}$ and $V_{\\text{out}}^{-}$ remain free from coupling, as does their difference. This layout exemplifies \"twisted pairs.\"\n\nAnother advantage of differential signaling is the increase in maximum achievable voltage swings. In the Fig. 4.3 circuit, for instance, the maximum output swing at $X$ or $Y$ is $V_{DD} - \\left(V_{GS} - V_{TH}\\right)$, while for $V_{X} - V_{Y}$, the peak-to-peak swing is $2\\left[V_{DD} - \\left(V_{GS} - V_{TH}\\right)\\right]$. Additional benefits of differential circuits over single-ended ones include simpler biasing and higher linearity (Chapter 14).\n\nAlthough differential circuits may occupy approximately twice the area of single-ended alternatives, this is a minor drawback. The numerous advantages of differential operation significantly outweigh the potential increase in area."
},
{
    "text": "A \"single-ended\" signal is characterized as one measured relative to a fixed potential, typically the ground [Fig. 4.1(a)]. Conversely, a differential signal is defined as one measured between two nodes that exhibit equal but opposite signal deviations around a fixed potential [Fig. 4.1(b)]. In a strict sense, these two nodes must also present equal impedances to that potential. The \"center\" potential in differential signaling is termed the \"common-mode\" (CM) level, which can be viewed as the bias voltage of the signals, i.e., the voltage level in the absence of signal activity.\n\nSpecifying signal swings in a differential system can be perplexing. Assume each single-ended output in Fig. 4.1(b) has a peak amplitude of $V_{0}$. Consequently, the single-ended peak-to-peak swing is $2 V_{0}$, while the differential peak-to-peak swing is $4 V_{0}$. For instance, if the voltage at $X$ (relative to ground) is $V_{0} \\cos \\omega t + V_{CM}$ and at $Y$ is $-V_{0} \\cos \\omega t + V_{CM}$, then the peak-to-peak swing of $V_{X} - V_{Y}$ $\\left(= 2 V_{0} \\cos \\omega t\\right)$ is $4 V_{0}$. Thus, it's feasible for a circuit with a 1 V supply voltage to achieve a peak-to-peak differential swing of 1.6 V.\n\nA significant benefit of differential operation over single-ended signaling is its enhanced resistance to \"environmental\" noise. Consider the scenario in Fig. 4.2, where two adjacent lines in a circuit carry a small, sensitive signal and a large clock waveform. Due to capacitive coupling, transitions on line $L_{2}$ distort the signal on line $L_{1}$. However, if the sensitive signal is distributed as two equal but opposite phases, as shown in Fig. 4.2(b), and the clock line is placed midway between them, the transitions affect the differential phases equally, preserving the difference. Although the common-mode level of the phases is disturbed, the differential output remains uncorrupted, demonstrating the arrangement's ability to \"reject\" common-mode noise. ${ }^{1}$\n\nimage_name:(a)\ndescription:The circuit in Figure 4.1(a) illustrates a single-ended signal with a resistor Zs connected to a capacitor X2, driven by a voltage source Vin. The NMOS M1 is linked to a load resistor and driven by a signal g1. This setup demonstrates signal corruption due to coupling between lines.\nimage_name:(b)\ndescription:The circuit diagram depicts a differential signaling configuration with common-mode noise rejection. It employs NMOS transistors M1 and M2 with a clock line situated between two signal lines. Resistors labeled LOAD are connected to a power supply VDD. Capacitors L1, L2, and L3 are utilized for coupling and decoupling signals. An inverter CK drives the clock line.\n\nFigure 4.2 (a) Signal corruption due to coupling; (b) reduction of coupling through differential operation.\n\nAnother instance of common-mode rejection occurs with noisy supply voltages. In the CS stage of Fig. 4.3(a), if $V_{DD}$ varies by $\\Delta V$, then $V_{\\text{out}}$ changes by roughly the same amount, indicating high susceptibility to noise on $V_{DD}$. In contrast, the circuit in Fig. 4.3(b), if symmetric, experiences noise on $V_{DD}$ affecting $V_{X}$ and $V_{Y}$, but not $V_{X} - V_{Y} = V_{\\text{out}}$. Thus, Fig. 4.3(b)'s circuit is more resilient against supply noise.\nimage_name:(a)\ndescription:\n[\nname: M1, type: NMOS, ports: {S: GND, D: Vout, G: Vin}\nname: RD, type: Resistor, value: RD, ports: {N1: VDD, N2: Vout}\n]\nextrainfo:The circuit is a common-source amplifier with a resistive load, prone to noise on the supply voltage VDD. It amplifies the input voltage Vin to generate the output voltage Vout.\nimage_name:(b)\ndescription:\n[\nname: M1, type: NMOS, ports: {S: GND, D: X, G: Vip}\nname: M2, type: NMOS, ports: {S: GND, D: Y, G: Vin}\nname: RD, type: Resistor, value: RD, ports: {N1: VDD, N2: X}\nname: RD, type: Resistor, value: RD, ports: {N1: VDD, N2: Y}\n]\nextrainfo:The circuit is a differential amplifier with NMOS transistors M1 and M2. It is designed to reject common-mode noise on VDD. The outputs Vx and Vy are differential, enhancing noise immunity.\nFigure 4.3 Impact of supply noise on (a) a single-ended circuit and (b) a differential circuit.\n\nThus far, we've highlighted the importance of using differential paths for sensitive signals (\"victims\"). It's also advantageous to use differential distribution for noisy lines (\"aggressors\"). For example, if the clock signal in Fig. 4.2 is distributed differentially across two lines (Fig. 4.4), perfect symmetry ensures that the coupled components from $CK$ and $\\overline{CK}$ cancel each other out.\nimage_name:Figure 4.4\ndescription:\n[\nname: M1, type: NMOS, ports: {S: GND, D: Vx, G: Vin}\nname: LOAD, type: Resistor, value: LOAD, ports: {N1: Vx, N2: CK}\nname: L1, type: Inverter, ports: {In: Vx, Out: L1_out}\nname: L2, type: Inverter, ports: {In: CK, Out: L2_out}\nname: L3, type: Inverter, ports: {In: CK, Out: L3_out}\n]\nextrainfo:The circuit diagram shows a differential clock distribution to mitigate coupled noise, using inverters and an NMOS transistor. The clock signal is distributed on both CK and \\overline{CK} lines with inverters L2 and L3.\nimage_name:Figure 4.4\ndescription:The diagram in Figure 4.4 presents a differential circuit setup involving both differential victims and aggressors. It comprises three main lines labeled L1, L2, and L3, connected to differential clock signals CK and \\( \\overline{CK} \\). These clock signals pass through inverters before reaching the lines.\n\n1. **Type of Graph and Function:**\n- The diagram is a schematic of an electronic circuit, focusing on differential signaling.\n\n2. **Axes Labels and Units:**\n- As a circuit schematic, it lacks typical graph axes or units. Instead, it features components like transistors, capacitors, and inductors.\n\n3. **Overall Behavior and Trends:**\n- The circuit illustrates differential signaling, where differential aggressors (clock signals) surround differential victims (signal path), aiming to minimize noise coupling through symmetry.\n- The waveform representations on the right show expected signal shapes: square waves for clock signals and a sinusoidal waveform for the victim signal.\n\n4. **Key Features and Technical Details:**\n- **Transistor \\( M_1 \\):** A MOSFET connected to input voltage \\( V_{in} \\) and ground, controlling the signal path.\n- **Load Resistor \\( L_{\\text{OAP}} \\):** Connected in series with the transistor, affecting the load.\n- **Inductors (L1, L2, L3):** Part of the differential paths, aiding symmetry and reducing noise coupling.\n- **Capacitors:** Positioned between lines for filtering or coupling.\n\n5. **Annotations and Specific Data Points:**\n- The waveforms on the right depict the differential nature of the signals. The top and bottom waveforms are square waves (differential clock signals), while the middle waveform is sinusoidal (victim signal).\n- The differential signals demonstrate how symmetry in the circuit design can reduce noise.\n\n#### Example 4.1\n\nIf using differential victims or aggressors enhances overall noise immunity, can we opt for differential phases for both?\n\n#### Solution\n\nYes, we can. Consider the setup in Fig. 4.5(a), where differential victims are surrounded by differential aggressors. However, in this case, $V_{\\text{out}}^{+} - V_{\\text{out}}^{-}$ is corrupted due to opposite voltage jumps experienced by $V_{\\text{out}}^{+}$ and $V_{\\text{out}}^{-}$.\nimage_name:Figure 4.5(a)\ndescription:The circuit in Figure 4.5(a) shows differential victims surrounded by differential aggressors. The outputs Vout+ and Vout- experience opposite voltage jumps, leading to corruption in the differential output.\nimage_name:Figure 4.5(b)\ndescription:The circuit employs twisted pair routing for noise cancellation, where Vout+ and Vout- are adjacent to CK and CK_bar for half the distance, then swapped for the remaining half, effectively canceling out coupling from CK and CK_bar.\n\nNow, if we alter the routing as shown in Fig. 4.5(b), where $V_{\\text{out}}^{+} (V_{\\text{out}}^{-})$ is adjacent to $CK (\\overline{CK})$ for half the distance and to $\\overline{CK} (CK)$ for the other half, the couplings from $CK$ and $\\overline{CK}$ cancel each other. Consequently, $V_{\\text{out}}^{+}$ and $V_{\\text{out}}^{-}$ remain free from coupling, as does their difference. This configuration exemplifies \"twisted pairs.\"\n\nAnother advantageous property of differential signaling is the increase in maximum achievable voltage swings. In the circuit of Fig. 4.3, for instance, the maximum output swing at $X$ or $Y$ is $V_{DD} - (V_{GS} - V_{TH})$, whereas for $V_{X} - V_{Y}$, the peak-to-peak swing is $2[V_{DD} - (V_{GS} - V_{TH})]$. Additional benefits of differential circuits over single-ended ones include simpler biasing and higher linearity (Chapter 14).\n\nWhile differential circuits may occupy approximately twice the area of single-ended alternatives, this is a minor drawback. The numerous advantages of differential operation significantly outweigh any potential increase in area."
},
{
    "text": "A \"single-ended\" signal is characterized by being measured relative to a constant potential, typically the ground [Fig. 4.1(a)]. Conversely, a differential signal is measured between two nodes that exhibit equal but opposite signal deviations around a fixed potential [Fig. 4.1(b)]. Strictly speaking, these nodes must also present equal impedances to that potential. The \"center\" potential in differential signaling is termed the \"common-mode\" (CM) level, which can be viewed as the bias voltage of the signals, i.e., the voltage level in the absence of signal activity.\n\nUnderstanding signal swings in a differential system can be perplexing. Assume each single-ended output in Fig. 4.1(b) has a peak amplitude of $V_{0}$. Consequently, the single-ended peak-to-peak swing is $2 V_{0}$, while the differential peak-to-peak swing is $4 V_{0}$. For instance, if the voltage at $X$ (relative to ground) is $V_{0} \\cos \\omega t + V_{C M}$ and at $Y$ is $-V_{0} \\cos \\omega t + V_{C M}$, then the peak-to-peak swing of $V_{X} - V_{Y}$ $\\left(= 2 V_{0} \\cos \\omega t\\right)$ is $4 V_{0}$. Thus, it's feasible for a circuit with a 1 V supply voltage to achieve a peak-to-peak differential swing of 1.6 V.\n\nA significant benefit of differential operation over single-ended signaling is its enhanced resistance to \"environmental\" noise. Consider the scenario in Fig. 4.2, where two adjacent lines in a circuit carry a small, sensitive signal and a large clock waveform. Due to capacitive coupling, transitions on line $L_{2}$ degrade the signal on line $L_{1}$. However, if the sensitive signal is distributed as two equal but opposite phases, as shown in Fig. 4.2(b), and the clock line is positioned midway between them, the transitions equally disturb the differential phases, preserving the difference. Since the common-mode level of the phases is affected but the differential output remains intact, this setup effectively \"rejects\" common-mode noise. ${ }^{1}$\n\nimage_name:(a)\ndescription:The circuit in Figure 4.1(a) depicts a single-ended signal with a resistor Zs connected to a capacitor X2, driven by a voltage source Vin. The NMOS M1 is linked to a load resistor and driven by a signal g1, demonstrating signal corruption due to line coupling.\nimage_name:(b)\ndescription:The circuit diagram illustrates a differential signaling setup with common-mode noise rejection, featuring NMOS transistors M1 and M2 and a clock line placed between two signal lines. Resistors labeled LOAD are connected to a power supply VDD, with capacitors L1, L2, and L3 used for signal coupling and decoupling, and an inverter CK driving the clock line.\n\nFigure 4.2 (a) Signal corruption due to coupling; (b) reduction of coupling through differential operation.\n\nAnother instance of common-mode rejection occurs with noisy supply voltages. In the CS stage of Fig. 4.3(a), if $V_{D D}$ varies by $\\Delta V$, then $V_{\\text {out }}$ changes by roughly the same amount, indicating high susceptibility to noise on $V_{D D}$. In contrast, the circuit in Fig. 4.3(b), if symmetric, experiences noise on $V_{D D}$ affecting $V_{X}$ and $V_{Y}$, but not $V_{X} - V_{Y} = V_{\\text {out }}$. Hence, Fig. 4.3(b)'s circuit is more resilient against supply noise.\nimage_name:(a)\ndescription:\n[\nname: M1, type: NMOS, ports: {S: GND, D: Vout, G: Vin}\nname: RD, type: Resistor, value: RD, ports: {N1: VDD, N2: Vout}\n]\nextrainfo:The circuit is a common-source amplifier with a resistive load, vulnerable to noise on the supply voltage VDD, amplifying input voltage Vin to produce output voltage Vout.\nimage_name:(b)\ndescription:\n[\nname: M1, type: NMOS, ports: {S: GND, D: X, G: Vip}\nname: M2, type: NMOS, ports: {S: GND, D: Y, G: Vin}\nname: RD, type: Resistor, value: RD, ports: {N1: VDD, N2: X}\nname: RD, type: Resistor, value: RD, ports: {N1: VDD, N2: Y}\n]\nextrainfo:The circuit is a differential amplifier with NMOS transistors M1 and M2, designed to reject common-mode noise on VDD. Outputs Vx and Vy are differential, enhancing noise immunity.\nFigure 4.3 Impact of supply noise on (a) a single-ended circuit and (b) a differential circuit.\n\nThus far, we've highlighted the importance of using differential paths for sensitive signals (\"victims\"). Similarly, employing differential distribution for noisy lines (\"aggressors\") is advantageous. For example, if the clock signal in Fig. 4.2 is distributed differentially across two lines (Fig. 4.4), perfect symmetry ensures that the coupled components from $C K$ and $\\overline{C K}$ to the signal line cancel each other out.\nimage_name:Figure 4.4\ndescription:\n[\nname: M1, type: NMOS, ports: {S: GND, D: Vx, G: Vin}\nname: LOAD, type: Resistor, value: LOAD, ports: {N1: Vx, N2: CK}\nname: L1, type: Inverter, ports: {In: Vx, Out: L1_out}\nname: L2, type: Inverter, ports: {In: CK, Out: L2_out}\nname: L3, type: Inverter, ports: {In: CK, Out: L3_out}\n]\nextrainfo:The circuit diagram shows a differential clock distribution to minimize coupled noise, using inverters and an NMOS transistor. The clock signal is distributed in both CK and \\overline{CK} lines with inverters L2 and L3.\nimage_name:Figure 4.4\ndescription:The diagram in Figure 4.4 shows a differential circuit configuration with both differential victims and aggressors. It consists of three main lines, L1, L2, and L3, connected to differential clock signals CK and \\( \\overline{CK} \\), fed through inverters.\n\n1. **Type of Graph and Function:**\n- The diagram is a schematic of an electronic circuit focusing on differential signaling.\n\n2. **Axes Labels and Units:**\n- As a circuit schematic, it lacks typical graph axes or units, featuring components like transistors, capacitors, and inductors.\n\n3. **Overall Behavior and Trends:**\n- The circuit illustrates differential signaling, with differential aggressors (clock signals) surrounding differential victims (signal path), aiming to minimize noise coupling through symmetry.\n- The waveform representations show expected signal shapes: square waves for clock signals and a sinusoidal waveform for the victim signal.\n\n4. **Key Features and Technical Details:**\n- **Transistor \\( M_1 \\):** A MOSFET connected to input voltage \\( V_{in} \\) and ground, controlling the signal path.\n- **Load Resistor \\( L_{\\text{OAP}} \\):** In series with the transistor, affecting the load.\n- **Inductors (L1, L2, L3):** Part of the differential paths, aiding symmetry and reducing noise coupling.\n- **Capacitors:** Used for filtering or coupling between lines.\n\n5. **Annotations and Specific Data Points:**\n- The waveforms illustrate the differential nature of the signals, with top and bottom waveforms as square waves (clock signals) and the middle waveform as a sinusoidal (victim signal), demonstrating noise reduction through circuit symmetry.\n\n#### Example 4.1\n\nCan we opt for differential phases for both victims and aggressors if it enhances overall noise immunity?\n\n#### Solution\n\nYes, we can. Consider the setup in Fig. 4.5(a), where differential victims are surrounded by differential aggressors. However, in this case, $V_{\\text {out }}^{+} - V_{\\text {out }}^{-}$ is corrupted due to opposite voltage jumps experienced by $V_{\\text {out }}^{+}$ and $V_{\\text {out }}^{-}$.\nimage_name:Figure 4.5(a)\ndescription:The circuit in Figure 4.5(a) shows differential victims surrounded by differential aggressors, with outputs Vout+ and Vout- experiencing opposite voltage jumps, leading to differential output corruption.\nimage_name:Figure 4.5(b)\ndescription:The circuit employs twisted pair routing for noise cancellation, where Vout+ and Vout- are adjacent to CK and CK_bar for half the distance, then swapped for the remaining half, effectively canceling out coupling from CK and CK_bar.\n\nNow, if we alter the routing as in Fig. 4.5(b), where $V_{\\text {out }}^{+}\\left(V_{\\text {out }}^{-}\\right)$ is adjacent to $C K(\\overline{C K})$ for half the distance and to $\\overline{C K}(C K)$ for the other half, the couplings from $C K$ and $\\overline{C K}$ cancel each other. Consequently, $V_{\\text {out }}^{+}$ and $V_{\\text {out }}^{-}$ remain free from coupling, as does their difference. This configuration exemplifies \"twisted pairs.\"\n\nAnother advantage of differential signaling is the increase in maximum achievable voltage swings. In Fig. 4.3's circuit, for instance, the maximum output swing at $X$ or $Y$ is $V_{D D} - \\left(V_{G S} - V_{T H}\\right)$, whereas for $V_{X} - V_{Y}$, the peak-to-peak swing is $2\\left[V_{D D} - \\left(V_{G S} - V_{T H}\\right)\\right]$. Additional benefits of differential circuits over single-ended ones include simpler biasing and higher linearity (Chapter 14).\n\nAlthough differential circuits may require approximately twice the area of single-ended alternatives, this is a minor drawback. The extensive advantages of differential operation significantly outweigh any potential increase in area."
},
{
    "text": "A \"single-ended\" signal is characterized by being measured relative to a fixed potential, typically the ground [Fig. 4.1(a)]. Conversely, a differential signal is defined as one measured between two nodes that exhibit equal but opposite signal deviations around a fixed potential [Fig. 4.1(b)]. In a strict sense, these nodes must also present equal impedances to that potential. The central potential in differential signaling is termed the \"common-mode\" (CM) level, which can be viewed as the bias voltage of the signals, i.e., the voltage level in the absence of any signal.\n\nUnderstanding signal swings in a differential system can be intricate. Assume each single-ended output in Fig. 4.1(b) has a peak amplitude of $V_{0}$. Consequently, the single-ended peak-to-peak swing is $2 V_{0}$, while the differential peak-to-peak swing is $4 V_{0}$. For instance, if the voltage at $X$ (relative to ground) is $V_{0} \\cos \\omega t + V_{CM}$ and at $Y$ is $-V_{0} \\cos \\omega t + V_{CM}$, then the peak-to-peak swing of $V_{X} - V_{Y}$ $\\left(= 2 V_{0} \\cos \\omega t\\right)$ amounts to $4 V_{0}$. Thus, it is feasible for a circuit with a 1 V supply voltage to achieve a peak-to-peak differential swing of 1.6 V.\n\nA significant benefit of differential operation over single-ended signaling is its enhanced resistance to \"environmental\" noise. Consider the scenario in Fig. 4.2, where two adjacent lines in a circuit carry a small, sensitive signal and a large clock waveform. Due to capacitive coupling, transitions on line $L_{2}$ distort the signal on line $L_{1}$. However, if the sensitive signal is distributed as two equal but opposite phases, as shown in Fig. 4.2(b), and the clock line is positioned midway between them, the transitions affect the differential phases equally, preserving the difference. Although the common-mode level of the phases is disturbed, the differential output remains uncorrupted, demonstrating the arrangement's ability to \"reject\" common-mode noise. ${ }^{1}$\n\nimage_name:(a)\ndescription:The circuit in Figure 4.1(a) depicts a single-ended signal with a resistor Zs connected to a capacitor X2, driven by a voltage source Vin. The NMOS M1 is linked to a load resistor and driven by a signal g1, illustrating signal corruption due to line coupling.\nimage_name:(b)\ndescription:The circuit diagram showcases a differential signaling setup with common-mode noise rejection, featuring NMOS transistors M1 and M2 and a clock line placed between two signal lines. Resistors labeled LOAD are connected to a power supply VDD, with capacitors L1, L2, and L3 used for signal coupling and decoupling, and an inverter CK driving the clock line.\n\nFigure 4.2 (a) Signal corruption due to coupling; (b) reduction of coupling through differential operation.\n\nAnother instance of common-mode rejection is observed with noisy supply voltages. In the CS stage of Fig. 4.3(a), if $V_{DD}$ varies by $\\Delta V$, then $V_{\\text{out}}$ changes by roughly the same amount, indicating high susceptibility to noise on $V_{DD}$. In contrast, the circuit in Fig. 4.3(b), if symmetric, experiences noise on $V_{DD}$ affecting $V_{X}$ and $V_{Y}$, but not $V_{X} - V_{Y} = V_{\\text{out}}$. Hence, the Fig. 4.3(b) circuit is more resilient against supply noise.\nimage_name:(a)\ndescription:\n[\nname: M1, type: NMOS, ports: {S: GND, D: Vout, G: Vin}\nname: RD, type: Resistor, value: RD, ports: {N1: VDD, N2: Vout}\n]\nextrainfo:The circuit is a common-source amplifier with a resistive load, vulnerable to noise on the supply voltage VDD, amplifying input voltage Vin to produce output voltage Vout.\nimage_name:(b)\ndescription:\n[\nname: M1, type: NMOS, ports: {S: GND, D: X, G: Vip}\nname: M2, type: NMOS, ports: {S: GND, D: Y, G: Vin}\nname: RD, type: Resistor, value: RD, ports: {N1: VDD, N2: X}\nname: RD, type: Resistor, value: RD, ports: {N1: VDD, N2: Y}\n]\nextrainfo:The circuit is a differential amplifier with NMOS transistors M1 and M2, designed to reject common-mode noise on VDD. Outputs Vx and Vy are differential, enhancing noise immunity.\nFigure 4.3 Impact of supply noise on (a) a single-ended circuit and (b) a differential circuit.\n\nThus far, we have highlighted the importance of using differential paths for sensitive signals (\"victims\"). Similarly, employing differential distribution for noisy lines (\"aggressors\") is advantageous. For example, if the clock signal in Fig. 4.2 is distributed differentially across two lines (Fig. 4.4), perfect symmetry ensures that the coupled components from $CK$ and $\\overline{CK}$ to the signal line cancel each other out.\nimage_name:Figure 4.4\ndescription:\n[\nname: M1, type: NMOS, ports: {S: GND, D: Vx, G: Vin}\nname: LOAD, type: Resistor, value: LOAD, ports: {N1: Vx, N2: CK}\nname: L1, type: Inverter, ports: {In: Vx, Out: L1_out}\nname: L2, type: Inverter, ports: {In: CK, Out: L2_out}\nname: L3, type: Inverter, ports: {In: CK, Out: L3_out}\n]\nextrainfo:The circuit diagram illustrates differential clock distribution to mitigate coupled noise, using inverters and an NMOS transistor. The clock signal is distributed in both CK and \\overline{CK} lines with inverters L2 and L3.\nimage_name:Figure 4.4\ndescription:The diagram in Figure 4.4 depicts a differential circuit configuration involving both differential victims and aggressors. It consists of three main lines labeled L1, L2, and L3, connected to differential clock signals CK and \\( \\overline{CK} \\), fed through inverters.\n\n1. **Type of Graph and Function:**\n- The diagram is a schematic of an electronic circuit, focusing on differential signaling.\n\n2. **Axes Labels and Units:**\n- As a circuit schematic, it lacks typical graph axes or units, featuring components like transistors, capacitors, and inductors.\n\n3. **Overall Behavior and Trends:**\n- The circuit demonstrates differential signaling, with differential aggressors (clock signals) surrounding differential victims (signal path), aiming to minimize noise coupling through symmetry.\n- The waveform representations show expected signal shapes: square waves for clock signals and a sinusoidal waveform for the victim signal.\n\n4. **Key Features and Technical Details:**\n- **Transistor \\( M_1 \\):** A MOSFET connected to input voltage \\( V_{in} \\) and ground, controlling the signal path.\n- **Load Resistor \\( L_{\\text{OAP}} \\):** In series with the transistor, affecting the load.\n- **Inductors (L1, L2, L3):** Part of the differential paths, aiding symmetry and reducing noise coupling.\n- **Capacitors:** Used for filtering or coupling between lines.\n\n5. **Annotations and Specific Data Points:**\n- The waveforms illustrate the differential nature of the signals, with top and bottom waveforms as square waves (clock signals) and the middle waveform as a sinusoidal (victim signal), demonstrating noise reduction through circuit symmetry.\n\n#### Example 4.1\n\nIf using differential victims or aggressors enhances overall noise immunity, can we opt for differential phases for both victims and aggressors?\n\n#### Solution\n\nYes, we can. Consider the setup in Fig. 4.5(a), where differential victims are surrounded by differential aggressors. However, in this case, $V_{\\text{out}}^{+} - V_{\\text{out}}^{-}$ is corrupted due to opposite voltage jumps experienced by $V_{\\text{out}}^{+}$ and $V_{\\text{out}}^{-}$.\nimage_name:Figure 4.5(a)\ndescription:The circuit in Figure 4.5(a) shows differential victims surrounded by differential aggressors, with outputs Vout+ and Vout- experiencing opposite voltage jumps, leading to differential output corruption.\nimage_name:Figure 4.5(b)\ndescription:The circuit employs twisted pair routing for noise cancellation, where Vout+ and Vout- are adjacent to CK and CK_bar for half the distance, then swapped for the remaining half, effectively canceling out coupling from CK and CK_bar.\n\nNow, if we alter the routing as in Fig. 4.5(b), where $V_{\\text{out}}^{+} \\left(V_{\\text{out}}^{-}\\right)$ is adjacent to $CK \\left(\\overline{CK}\\right)$ for half the distance and to $\\overline{CK} \\left(CK\\right)$ for the other half, the couplings from $CK$ and $\\overline{CK}$ cancel each other. Consequently, $V_{\\text{out}}^{+}$ and $V_{\\text{out}}^{-}$ remain free from coupling, as does their difference. This layout exemplifies \"twisted pairs.\"\n\nAnother advantage of differential signaling is the increase in maximum achievable voltage swings. In the Fig. 4.3 circuit, for instance, the maximum output swing at $X$ or $Y$ is $V_{DD} - \\left(V_{GS} - V_{TH}\\right)$, while for $V_{X} - V_{Y}$, the peak-to-peak swing is $2\\left[V_{DD} - \\left(V_{GS} - V_{TH}\\right)\\right]$. Additional benefits of differential circuits over single-ended ones include simpler biasing and higher linearity (Chapter 14).\n\nAlthough differential circuits may require approximately twice the area of single-ended alternatives, this drawback is minor in practice. The numerous advantages of differential operation significantly outweigh the potential increase in area."
},
{
    "text": "To amplify a differential signal, we can utilize two identical single-ended signal paths to handle the two phases, as indicated by the insights from the preceding section [Fig. 4.6(a)]. Here, two differential inputs, $V_{i n 1}$ and $V_{i n 2}$, with a specific common-mode (CM) level, $V_{i n, C M}$, are applied to the gates. The outputs are also differential and oscillate around the output CM level, $V_{\\text {out }, C M}$. This circuit indeed provides several benefits of differential signaling, such as high supply noise rejection and increased output swings. However, what occurs if $V_{i n 1}$ and $V_{i n 2}$ encounter a significant common-mode disturbance or lack a well-defined common-mode dc level? As the input CM level, $V_{i n, C M}$, varies, so do the bias currents of $M_{1}$ and $M_{2}$, thereby altering both the devices' transconductance and the output CM level. This change in transconductance results in a variation in the small-signal gain, while the deviation of the output CM level from its ideal value reduces the maximum permissible output swings. For instance, as depicted in Fig. 4.6(b), if the input CM level is excessively low, the minimum values of $V_{i n 1}$ and $V_{i n 2}$ might turn off $M_{1}$ and $M_{2}$, causing severe output clipping. Therefore, it is crucial that the devices' bias currents have minimal reliance on the input CM level.\n\nimage_name:(a)\ndescription:\n[\nname: RD1, type: Resistor, value: RD, ports: {N1: VDD, N2: X}\nname: RD2, type: Resistor, value: RD, ports: {N1: VDD, N2: Y}\nname: M1, type: NMOS, ports: {S: GND, D: X, G: Vin1}\nname: M2, type: NMOS, ports: {S: GND, D: Y, G: Vin2}\nname: VDD, type: VoltageSource, value: VDD, ports: {Np: VDD, Nn: GND}\n]\nextrainfo:The circuit is a differential pair with NMOS transistors M1 and M2. It exhibits sensitivity to the input common-mode level, which can result in clipping if the input CM level is too low. The circuit outputs are Vout1 and Vout2, influenced by the input signals Vin1 and Vin2.\n\nimage_name:(b)\ndescription:The diagram labeled \"(b)\" demonstrates the sensitivity of a differential pair circuit to the input common-mode (CM) level. It comprises two main sections: a circuit diagram on the left and a set of waveforms on the right.\n\nCircuit Diagram:\n- **Components:**\n- Two MOSFETs labeled \\(M_1\\) and \\(M_2\\) with their gates connected to inputs \\(V_{in1}\\) and \\(V_{in2}\\), respectively.\n- Two resistors labeled \\(R_D\\) connected to the drains of \\(M_1\\) and \\(M_2\\), leading to output nodes \\(V_{out1}\\) and \\(V_{out2}\\).\n- The sources of \\(M_1\\) and \\(M_2\\) are grounded.\n- The circuit is powered by a supply voltage \\(V_{DD}\\).\n\nWaveforms:\n- **Input Waveforms:**\n- \\(V_{in1}\\) and \\(V_{in2}\\) are depicted as sinusoidal signals around a common-mode level \\(V_{in,CM}\\). The signals are in anti-phase, meaning when one peaks, the other troughs.\n- **Output Waveforms:**\n- \\(V_{out1}\\) and \\(V_{out2}\\) are shown as sinusoidal signals around a common-mode level \\(V_{out,CM}\\).\n- \\(V_{out1}\\) and \\(V_{out2}\\) maintain their sinusoidal shape but are subject to clipping due to the input CM level.\n\nBehavior and Sensitivity:\n- The waveforms highlight the effect of the input CM level on the MOSFETs' operation.\n- If the input CM level is too low, \\(M_1\\) and \\(M_2\\) can turn off, resulting in output clipping. This is shown by the areas where the waveforms flatten at the bottom.\n- Clipping occurs when the input signal amplitude is too high relative to the CM level, causing the transistors to turn off during part of the cycle.\n\nKey Features:\n- The diagram underscores the importance of maintaining an appropriate input CM level to avoid output signal distortion.\n- Annotations indicate where \\(M_1\\) and \\(M_2\\) turn off, emphasizing the sensitivity to low CM levels.\n\nFigure 4.6 (a) Simple differential circuit; (b) illustration of sensitivity to the input common-mode level.\n\nimage_name:Figure 4.7 Basic differential pair.\ndescription:\n[\nname: RD1, type: Resistor, value: RD, ports: {N1: VDD, N2: X}\nname: RD2, type: Resistor, value: RD, ports: {N1: VDD, N2: Y}\nname: M1, type: NMOS, ports: {S: P, D: X, G: Vin1}\nname: M2, type: NMOS, ports: {S: P, D: Y, G: Vin2}\nname: ISS, type: CurrentSource, value: ISS, ports: {Np: P, Nn: GND}\n]\nextrainfo:The depicted circuit is a basic differential pair with a current source ISS. It ensures constant current through the differential pair regardless of the input common-mode voltage. The resistors RD1 and RD2 are equal, providing symmetrical operation. The output nodes are Vout1 and Vout2. The circuit aims to stabilize the output common-mode level and is less sensitive to variations in the input common-mode level.\n\nA straightforward modification can address the aforementioned issue. As shown in Fig. 4.7, the \"differential pair\" ${ }^{2}$ uses a current source $I_{S S}$ to make $I_{D 1}+I_{D 2}$ independent of $V_{i n, C M}$. Thus, if $V_{i n 1}=V_{i n 2}$, the bias current for each transistor equals $I_{S S} / 2$, and the output common-mode level is $V_{D D}-R_{D} I_{S S} / 2$. It is beneficial to examine the large-signal behavior of the circuit for both differential and common-mode input variations. In this large-signal analysis, we disregard channel-length modulation and the body effect."
},
{
    "text": "How can we amplify a differential signal? Based on the insights from the previous section, we can use two identical single-ended signal paths to handle the two phases [Fig. 4.6(a)]. Here, two differential inputs, $V_{i n 1}$ and $V_{i n 2}$, with a certain common-mode (CM) level, $V_{i n, C M}$, are applied to the gates. The outputs are also differential and oscillate around the output CM level, $V_{\\text {out }, C M}$. This circuit indeed provides some benefits of differential signaling, such as high supply noise rejection and greater output swings. However, what if $V_{i n 1}$ and $V_{i n 2}$ encounter a significant common-mode disturbance or lack a well-defined common-mode dc level? As the input CM level, $V_{i n, C M}$, varies, so do the bias currents of $M_{1}$ and $M_{2}$, thereby altering both the devices' transconductance and the output CM level. The change in transconductance results in a variation in the small-signal gain, while the deviation of the output CM level from its ideal value reduces the maximum permissible output swings. For instance, as depicted in Fig. 4.6(b), if the input CM level is too low, the minimum values of $V_{i n 1}$ and $V_{i n 2}$ might turn off $M_{1}$ and $M_{2}$, causing severe output clipping. Therefore, it is crucial that the devices' bias currents have minimal reliance on the input CM level.\n\n**Image Description (a):**\n- **Components:**\n  - **RD1:** Resistor, value: RD, ports: {N1: VDD, N2: X}\n  - **RD2:** Resistor, value: RD, ports: {N1: VDD, N2: Y}\n  - **M1:** NMOS, ports: {S: GND, D: X, G: Vin1}\n  - **M2:** NMOS, ports: {S: GND, D: Y, G: Vin2}\n  - **VDD:** VoltageSource, value: VDD, ports: {Np: VDD, Nn: GND}\n  \n- **Additional Info:** The circuit is a differential pair with NMOS transistors M1 and M2. It is sensitive to the input common-mode level, which can cause clipping if the input CM level is too low. The outputs are Vout1 and Vout2, influenced by the input signals Vin1 and Vin2.\n\n**Image Description (b):**\nThe diagram labeled \"(b)\" demonstrates the sensitivity of a differential pair circuit to the input common-mode (CM) level. It consists of two main sections: a circuit diagram on the left and a set of waveforms on the right.\n\n- **Circuit Diagram:**\n  - **Components:**\n    - Two MOSFETs, \\(M_1\\) and \\(M_2\\), with gates connected to inputs \\(V_{in1}\\) and \\(V_{in2}\\), respectively.\n    - Two resistors, \\(R_D\\), connected to the drains of \\(M_1\\) and \\(M_2\\), leading to output nodes \\(V_{out1}\\) and \\(V_{out2}\\).\n    - The sources of \\(M_1\\) and \\(M_2\\) are grounded.\n    - The circuit is powered by a supply voltage \\(V_{DD}\\).\n\n- **Waveforms:**\n  - **Input Waveforms:**\n    - \\(V_{in1}\\) and \\(V_{in2}\\) are sinusoidal signals around a common-mode level \\(V_{in,CM}\\), in anti-phase.\n  - **Output Waveforms:**\n    - \\(V_{out1}\\) and \\(V_{out2}\\) are sinusoidal signals around a common-mode level \\(V_{out,CM}\\), affected by clipping due to the input CM level.\n\n- **Behavior and Sensitivity:**\n  - The waveforms show the impact of the input CM level on the MOSFETs' operation.\n  - If the input CM level is too low, \\(M_1\\) and \\(M_2\\) may turn off, causing output clipping, depicted by flattened areas in the waveforms.\n  - Clipping occurs when the input signal amplitude is too high relative to the CM level, turning off the transistors during part of the cycle.\n\n- **Key Features:**\n  - The diagram highlights the importance of maintaining an appropriate input CM level to avoid output distortion.\n  - Annotations indicate where \\(M_1\\) and \\(M_2\\) turn off, emphasizing sensitivity to low CM levels.\n\n**Figure 4.6:** (a) Simple differential circuit; (b) illustration of sensitivity to the input common-mode level.\n\n**Image Description (Figure 4.7 Basic differential pair):**\n- **Components:**\n  - **RD1:** Resistor, value: RD, ports: {N1: VDD, N2: X}\n  - **RD2:** Resistor, value: RD, ports: {N1: VDD, N2: Y}\n  - **M1:** NMOS, ports: {S: P, D: X, G: Vin1}\n  - **M2:** NMOS, ports: {S: P, D: Y, G: Vin2}\n  - **ISS:** CurrentSource, value: ISS, ports: {Np: P, Nn: GND}\n  \n- **Additional Info:** The circuit is a basic differential pair with a current source ISS, maintaining constant current through the pair regardless of the input common-mode voltage. The resistors RD1 and RD2 are equal, ensuring symmetrical operation. The output nodes are Vout1 and Vout2. The circuit aims to stabilize the output common-mode level and is less sensitive to input common-mode level variations.\n\nA straightforward modification can address the aforementioned issue. As shown in Fig. 4.7, the \"differential pair\" ${ }^{2}$ uses a current source $I_{S S}$ to make $I_{D 1}+I_{D 2}$ independent of $V_{i n, C M}$. Thus, if $V_{i n 1}=V_{i n 2}$, the bias current for each transistor equals $I_{S S} / 2$, and the output common-mode level is $V_{D D}-R_{D} I_{S S} / 2$. It is insightful to examine the large-signal behavior of the circuit for both differential and common-mode input variations, neglecting channel-length modulation and body effect in this study."
},
{
    "text": "How can we amplify a differential signal? Based on the insights from the preceding section, we can use two identical single-ended signal paths to handle the two phases [Fig. 4.6(a)]. Here, two differential inputs, $V_{i n 1}$ and $V_{i n 2}$, with a specific common-mode (CM) level, $V_{i n, C M}$, are applied to the gates. The outputs are also differential and fluctuate around the output CM level, $V_{\\text {out }, C M}$. This circuit indeed provides several benefits of differential signaling, such as strong rejection of supply noise and higher output swings. However, what if $V_{i n 1}$ and $V_{i n 2}$ encounter a significant common-mode disturbance or lack a well-defined common-mode dc level? As the input CM level, $V_{i n, C M}$, varies, so do the bias currents of $M_{1}$ and $M_{2}$, thereby altering both the devices' transconductance and the output CM level. The change in transconductance results in a variation in the small-signal gain, while the deviation of the output CM level from its ideal value reduces the maximum permissible output swings. For instance, as depicted in Fig. 4.6(b), if the input CM level is too low, the minimum values of $V_{i n 1}$ and $V_{i n 2}$ might turn off $M_{1}$ and $M_{2}$, causing severe output clipping. Therefore, it is crucial that the devices' bias currents have minimal reliance on the input CM level.\n\nimage_name:(a)\ndescription:\n[\nname: RD1, type: Resistor, value: RD, ports: {N1: VDD, N2: X}\nname: RD2, type: Resistor, value: RD, ports: {N1: VDD, N2: Y}\nname: M1, type: NMOS, ports: {S: GND, D: X, G: Vin1}\nname: M2, type: NMOS, ports: {S: GND, D: Y, G: Vin2}\nname: VDD, type: VoltageSource, value: VDD, ports: {Np: VDD, Nn: GND}\n]\nextrainfo:The circuit is a differential pair with NMOS transistors M1 and M2. It shows sensitivity to the input common-mode level, which can lead to clipping if the input CM level is too low. The circuit outputs are Vout1 and Vout2, which are affected by the input signals Vin1 and Vin2.\n\nimage_name:(b)\ndescription:The diagram labeled \"(b)\" illustrates the sensitivity of a differential pair circuit to the input common-mode (CM) level. It consists of two main sections: a circuit diagram on the left and a set of waveforms on the right.\n\nCircuit Diagram:\n- **Components:**\n- Two MOSFETs labeled \\(M_1\\) and \\(M_2\\) with their gates connected to inputs \\(V_{in1}\\) and \\(V_{in2}\\), respectively.\n- Two resistors labeled \\(R_D\\) connected to the drains of \\(M_1\\) and \\(M_2\\), leading to output nodes \\(V_{out1}\\) and \\(V_{out2}\\).\n- The sources of \\(M_1\\) and \\(M_2\\) are grounded.\n- The circuit is powered by a supply voltage \\(V_{DD}\\).\n\nWaveforms:\n- **Input Waveforms:**\n- \\(V_{in1}\\) and \\(V_{in2}\\) are shown as sinusoidal signals around a common-mode level \\(V_{in,CM}\\). The signals are in anti-phase, meaning when one is at its peak, the other is at its trough.\n- **Output Waveforms:**\n- \\(V_{out1}\\) and \\(V_{out2}\\) are shown as sinusoidal signals around a common-mode level \\(V_{out,CM}\\).\n- \\(V_{out1}\\) and \\(V_{out2}\\) maintain their sinusoidal shape but are affected by clipping due to the input CM level.\n\nBehavior and Sensitivity:\n- The waveforms illustrate the impact of the input CM level on the operation of the MOSFETs.\n- If the input CM level is too low, \\(M_1\\) and \\(M_2\\) can turn off, leading to output clipping. This is depicted by the areas where the waveforms flatten at the bottom.\n- Clipping occurs when the input signal amplitude is too high relative to the CM level, causing the transistors to turn off during part of the cycle.\n\nKey Features:\n- The diagram emphasizes the importance of maintaining an appropriate input CM level to prevent distortion in the output signals.\n- Annotations indicate where \\(M_1\\) and \\(M_2\\) turn off, highlighting the sensitivity to low CM levels.\n\nFigure 4.6 (a) Simple differential circuit; (b) illustration of sensitivity to the input common-mode level.\n\nimage_name:Figure 4.7 Basic differential pair.\ndescription:\n[\nname: RD1, type: Resistor, value: RD, ports: {N1: VDD, N2: X}\nname: RD2, type: Resistor, value: RD, ports: {N1: VDD, N2: Y}\nname: M1, type: NMOS, ports: {S: P, D: X, G: Vin1}\nname: M2, type: NMOS, ports: {S: P, D: Y, G: Vin2}\nname: ISS, type: CurrentSource, value: ISS, ports: {Np: P, Nn: GND}\n]\nextrainfo:The circuit shown is a basic differential pair with a current source ISS. It maintains constant current through the differential pair regardless of the input common-mode voltage. The resistors RD1 and RD2 are equal, ensuring symmetrical operation. The output nodes are Vout1 and Vout2. The circuit aims to stabilize the output common-mode level and is less sensitive to variations in input common-mode level.\n\nA straightforward modification can address the aforementioned issue. As shown in Fig. 4.7, the \"differential pair\" ${ }^{2}$ uses a current source $I_{S S}$ to make $I_{D 1}+I_{D 2}$ independent of $V_{i n, C M}$. Thus, if $V_{i n 1}=V_{i n 2}$, the bias current for each transistor equals $I_{S S} / 2$ and the output common-mode level is $V_{D D}-R_{D} I_{S S} / 2$. It is instructive to analyze the large-signal behavior of the circuit for both differential and common-mode input variations. In this large-signal analysis, we disregard channel-length modulation and the body effect."
},
{
    "text": "How can we amplify a differential signal? Based on the insights from the previous section, we can use two identical single-ended signal paths to handle the two phases [Fig. 4.6(a)]. Here, two differential inputs, $V_{i n 1}$ and $V_{i n 2}$, with a certain common-mode (CM) level, $V_{i n, C M}$, are applied to the gates. The outputs are also differential and oscillate around the output CM level, $V_{\\text {out }, C M}$. This circuit indeed provides some benefits of differential signaling, such as high rejection of supply noise and higher output swings. However, what if $V_{i n 1}$ and $V_{i n 2}$ encounter a significant common-mode disturbance or lack a well-defined common-mode dc level? As the input CM level, $V_{i n, C M}$, varies, so do the bias currents of $M_{1}$ and $M_{2}$, thereby altering both the devices' transconductance and the output CM level. The change in transconductance results in a variation in the small-signal gain, while the deviation of the output CM level from its ideal value reduces the maximum allowable output swings. For instance, as depicted in Fig. 4.6(b), if the input CM level is too low, the minimum values of $V_{i n 1}$ and $V_{i n 2}$ might turn off $M_{1}$ and $M_{2}$, causing severe output clipping. Therefore, it is crucial that the bias currents of the devices have minimal reliance on the input CM level.\n\nimage_name:(a)\ndescription:\n[\nname: RD1, type: Resistor, value: RD, ports: {N1: VDD, N2: X}\nname: RD2, type: Resistor, value: RD, ports: {N1: VDD, N2: Y}\nname: M1, type: NMOS, ports: {S: GND, D: X, G: Vin1}\nname: M2, type: NMOS, ports: {S: GND, D: Y, G: Vin2}\nname: VDD, type: VoltageSource, value: VDD, ports: {Np: VDD, Nn: GND}\n]\nextrainfo:The circuit is a differential pair with NMOS transistors M1 and M2. It shows sensitivity to the input common-mode level, which can lead to clipping if the input CM level is too low. The circuit outputs are Vout1 and Vout2, which are affected by the input signals Vin1 and Vin2.\n\nimage_name:(b)\ndescription:The diagram labeled \"(b)\" illustrates the sensitivity of a differential pair circuit to the input common-mode (CM) level. It consists of two main sections: a circuit diagram on the left and a set of waveforms on the right.\n\nCircuit Diagram:\n- **Components:**\n- Two MOSFETs labeled \\(M_1\\) and \\(M_2\\) with their gates connected to inputs \\(V_{in1}\\) and \\(V_{in2}\\), respectively.\n- Two resistors labeled \\(R_D\\) connected to the drains of \\(M_1\\) and \\(M_2\\), leading to output nodes \\(V_{out1}\\) and \\(V_{out2}\\).\n- The sources of \\(M_1\\) and \\(M_2\\) are grounded.\n- The circuit is powered by a supply voltage \\(V_{DD}\\).\n\nWaveforms:\n- **Input Waveforms:**\n- \\(V_{in1}\\) and \\(V_{in2}\\) are shown as sinusoidal signals around a common-mode level \\(V_{in,CM}\\). The signals are in anti-phase, meaning when one is at its peak, the other is at its trough.\n- **Output Waveforms:**\n- \\(V_{out1}\\) and \\(V_{out2}\\) are shown as sinusoidal signals around a common-mode level \\(V_{out,CM}\\).\n- \\(V_{out1}\\) and \\(V_{out2}\\) maintain their sinusoidal shape but are affected by clipping due to the input CM level.\n\nBehavior and Sensitivity:\n- The waveforms illustrate the impact of the input CM level on the operation of the MOSFETs.\n- If the input CM level is too low, \\(M_1\\) and \\(M_2\\) can turn off, leading to output clipping. This is depicted by the areas where the waveforms flatten at the bottom.\n- Clipping occurs when the input signal amplitude is too high relative to the CM level, causing the transistors to turn off during part of the cycle.\n\nKey Features:\n- The diagram emphasizes the importance of maintaining an appropriate input CM level to prevent distortion in the output signals.\n- Annotations indicate where \\(M_1\\) and \\(M_2\\) turn off, highlighting the sensitivity to low CM levels.\n\nFigure 4.6 (a) Simple differential circuit; (b) illustration of sensitivity to the input common-mode level.\n\nimage_name:Figure 4.7 Basic differential pair.\ndescription:\n[\nname: RD1, type: Resistor, value: RD, ports: {N1: VDD, N2: X}\nname: RD2, type: Resistor, value: RD, ports: {N1: VDD, N2: Y}\nname: M1, type: NMOS, ports: {S: P, D: X, G: Vin1}\nname: M2, type: NMOS, ports: {S: P, D: Y, G: Vin2}\nname: ISS, type: CurrentSource, value: ISS, ports: {Np: P, Nn: GND}\n]\nextrainfo:The circuit shown is a basic differential pair with a current source ISS. It maintains constant current through the differential pair regardless of the input common-mode voltage. The resistors RD1 and RD2 are equal, ensuring symmetrical operation. The output nodes are Vout1 and Vout2. The circuit aims to stabilize the output common-mode level and is less sensitive to variations in input common-mode level.\n\nA simple modification can address the aforementioned issue. As shown in Fig. 4.7, the \"differential pair\" ${ }^{2}$ uses a current source $I_{S S}$ to make $I_{D 1}+I_{D 2}$ independent of $V_{i n, C M}$. Thus, if $V_{i n 1}=V_{i n 2}$, the bias current of each transistor equals $I_{S S} / 2$ and the output common-mode level is $V_{D D}-R_{D} I_{S S} / 2$. It is instructive to analyze the large-signal behavior of the circuit for both differential and common-mode input variations. In this large-signal analysis, we disregard channel-length modulation and the body effect."
},
{
    "text": "How can we amplify a differential signal? Based on insights from the previous section, we can use two identical single-ended signal paths to process the two phases [Fig. 4.6(a)]. Here, two differential inputs, $V_{i n 1}$ and $V_{i n 2}$, with a specific common-mode (CM) level, $V_{i n, C M}$, are applied to the gates. The outputs are also differential and fluctuate around the output CM level, $V_{\\text {out }, C M}$. This circuit indeed provides several benefits of differential signaling, such as high supply noise rejection and increased output swings. However, what if $V_{i n 1}$ and $V_{i n 2}$ encounter a significant common-mode disturbance or lack a well-defined common-mode dc level? As the input CM level, $V_{i n, C M}$, varies, so do the bias currents of $M_{1}$ and $M_{2}$, altering both the devices' transconductance and the output CM level. This transconductance variation results in changes to the small-signal gain, while deviations in the output CM level from its ideal value reduce the maximum allowable output swings. For instance, as depicted in Fig. 4.6(b), if the input CM level is too low, the minimum values of $V_{i n 1}$ and $V_{i n 2}$ might turn off $M_{1}$ and $M_{2}$, causing severe output clipping. Therefore, it is crucial that the devices' bias currents have minimal reliance on the input CM level.\n\nimage_name:(a)\ndescription:\n[\nname: RD1, type: Resistor, value: RD, ports: {N1: VDD, N2: X}\nname: RD2, type: Resistor, value: RD, ports: {N1: VDD, N2: Y}\nname: M1, type: NMOS, ports: {S: GND, D: X, G: Vin1}\nname: M2, type: NMOS, ports: {S: GND, D: Y, G: Vin2}\nname: VDD, type: VoltageSource, value: VDD, ports: {Np: VDD, Nn: GND}\n]\nextrainfo:The circuit is a differential pair with NMOS transistors M1 and M2. It shows sensitivity to the input common-mode level, which can lead to clipping if the input CM level is too low. The circuit outputs are Vout1 and Vout2, which are affected by the input signals Vin1 and Vin2.\n\nimage_name:(b)\ndescription:The diagram labeled \"(b)\" illustrates the sensitivity of a differential pair circuit to the input common-mode (CM) level. It consists of two main sections: a circuit diagram on the left and a set of waveforms on the right.\n\nCircuit Diagram:\n- **Components:**\n- Two MOSFETs labeled \\(M_1\\) and \\(M_2\\) with their gates connected to inputs \\(V_{in1}\\) and \\(V_{in2}\\), respectively.\n- Two resistors labeled \\(R_D\\) connected to the drains of \\(M_1\\) and \\(M_2\\), leading to output nodes \\(V_{out1}\\) and \\(V_{out2}\\).\n- The sources of \\(M_1\\) and \\(M_2\\) are grounded.\n- The circuit is powered by a supply voltage \\(V_{DD}\\).\n\nWaveforms:\n- **Input Waveforms:**\n- \\(V_{in1}\\) and \\(V_{in2}\\) are shown as sinusoidal signals around a common-mode level \\(V_{in,CM}\\). The signals are in anti-phase, meaning when one is at its peak, the other is at its trough.\n- **Output Waveforms:**\n- \\(V_{out1}\\) and \\(V_{out2}\\) are shown as sinusoidal signals around a common-mode level \\(V_{out,CM}\\).\n- \\(V_{out1}\\) and \\(V_{out2}\\) maintain their sinusoidal shape but are affected by clipping due to the input CM level.\n\nBehavior and Sensitivity:\n- The waveforms illustrate the impact of the input CM level on the operation of the MOSFETs.\n- If the input CM level is too low, \\(M_1\\) and \\(M_2\\) can turn off, leading to output clipping. This is depicted by the areas where the waveforms flatten at the bottom.\n- Clipping occurs when the input signal amplitude is too high relative to the CM level, causing the transistors to turn off during part of the cycle.\n\nKey Features:\n- The diagram emphasizes the importance of maintaining an appropriate input CM level to prevent distortion in the output signals.\n- Annotations indicate where \\(M_1\\) and \\(M_2\\) turn off, highlighting the sensitivity to low CM levels.\n\nFigure 4.6 (a) Simple differential circuit; (b) illustration of sensitivity to the input common-mode level.\n\nimage_name:Figure 4.7 Basic differential pair.\ndescription:\n[\nname: RD1, type: Resistor, value: RD, ports: {N1: VDD, N2: X}\nname: RD2, type: Resistor, value: RD, ports: {N1: VDD, N2: Y}\nname: M1, type: NMOS, ports: {S: P, D: X, G: Vin1}\nname: M2, type: NMOS, ports: {S: P, D: Y, G: Vin2}\nname: ISS, type: CurrentSource, value: ISS, ports: {Np: P, Nn: GND}\n]\nextrainfo:The circuit shown is a basic differential pair with a current source ISS. It maintains constant current through the differential pair regardless of the input common-mode voltage. The resistors RD1 and RD2 are equal, ensuring symmetrical operation. The output nodes are Vout1 and Vout2. The circuit aims to stabilize the output common-mode level and is less sensitive to variations in input common-mode level.\n\nA straightforward modification can address the aforementioned issue. As shown in Fig. 4.7, the \"differential pair\" ${ }^{2}$ utilizes a current source $I_{S S}$ to make $I_{D 1}+I_{D 2}$ independent of $V_{i n, C M}$. Thus, if $V_{i n 1}=V_{i n 2}$, the bias current for each transistor equals $I_{S S} / 2$, and the output common-mode level is $V_{D D}-R_{D} I_{S S} / 2$. It is instructive to analyze the large-signal behavior of the circuit for both differential and common-mode input variations. In this large-signal analysis, we disregard channel-length modulation and the body effect."
},
{
    "text": "How can a differential signal be amplified? Based on the insights from the preceding section, we can utilize two identical single-ended signal paths to handle the two phases [Fig. 4.6(a)]. In this setup, two differential inputs, $V_{i n 1}$ and $V_{i n 2}$, with a specific common-mode (CM) level, $V_{i n, C M}$, are applied to the gates. The outputs are also differential and fluctuate around the output CM level, $V_{\\text {out }, C M}$. This circuit indeed provides several benefits of differential signaling, such as strong rejection of supply noise and higher output swings. However, what occurs if $V_{i n 1}$ and $V_{i n 2}$ encounter a significant common-mode disturbance or lack a well-defined common-mode dc level? As the input CM level, $V_{i n, C M}$, varies, so do the bias currents of $M_{1}$ and $M_{2}$, thereby altering both the devices' transconductance and the output CM level. This change in transconductance results in a variation in the small-signal gain, while the deviation of the output CM level from its ideal value reduces the maximum permissible output swings. For instance, as depicted in Fig. 4.6(b), if the input CM level is excessively low, the minimum values of $V_{i n 1}$ and $V_{i n 2}$ might turn off $M_{1}$ and $M_{2}$, causing severe output clipping. Therefore, it is crucial that the devices' bias currents have minimal reliance on the input CM level.\n\nimage_name:(a)\ndescription:\n[\nname: RD1, type: Resistor, value: RD, ports: {N1: VDD, N2: X}\nname: RD2, type: Resistor, value: RD, ports: {N1: VDD, N2: Y}\nname: M1, type: NMOS, ports: {S: GND, D: X, G: Vin1}\nname: M2, type: NMOS, ports: {S: GND, D: Y, G: Vin2}\nname: VDD, type: VoltageSource, value: VDD, ports: {Np: VDD, Nn: GND}\n]\nextrainfo:The circuit is a differential pair with NMOS transistors M1 and M2. It shows sensitivity to the input common-mode level, which can lead to clipping if the input CM level is too low. The circuit outputs are Vout1 and Vout2, which are affected by the input signals Vin1 and Vin2.\n\nimage_name:(b)\ndescription:The diagram labeled \"(b)\" illustrates the sensitivity of a differential pair circuit to the input common-mode (CM) level. It consists of two main sections: a circuit diagram on the left and a set of waveforms on the right.\n\nCircuit Diagram:\n- **Components:**\n- Two MOSFETs labeled \\(M_1\\) and \\(M_2\\) with their gates connected to inputs \\(V_{in1}\\) and \\(V_{in2}\\), respectively.\n- Two resistors labeled \\(R_D\\) connected to the drains of \\(M_1\\) and \\(M_2\\), leading to output nodes \\(V_{out1}\\) and \\(V_{out2}\\).\n- The sources of \\(M_1\\) and \\(M_2\\) are grounded.\n- The circuit is powered by a supply voltage \\(V_{DD}\\).\n\nWaveforms:\n- **Input Waveforms:**\n- \\(V_{in1}\\) and \\(V_{in2}\\) are shown as sinusoidal signals around a common-mode level \\(V_{in,CM}\\). The signals are in anti-phase, meaning when one is at its peak, the other is at its trough.\n- **Output Waveforms:**\n- \\(V_{out1}\\) and \\(V_{out2}\\) are shown as sinusoidal signals around a common-mode level \\(V_{out,CM}\\).\n- \\(V_{out1}\\) and \\(V_{out2}\\) maintain their sinusoidal shape but are affected by clipping due to the input CM level.\n\nBehavior and Sensitivity:\n- The waveforms illustrate the impact of the input CM level on the operation of the MOSFETs.\n- If the input CM level is too low, \\(M_1\\) and \\(M_2\\) can turn off, leading to output clipping. This is depicted by the areas where the waveforms flatten at the bottom.\n- Clipping occurs when the input signal amplitude is too high relative to the CM level, causing the transistors to turn off during part of the cycle.\n\nKey Features:\n- The diagram emphasizes the importance of maintaining an appropriate input CM level to prevent distortion in the output signals.\n- Annotations indicate where \\(M_1\\) and \\(M_2\\) turn off, highlighting the sensitivity to low CM levels.\n\nFigure 4.6 (a) Simple differential circuit; (b) illustration of sensitivity to the input common-mode level.\n\nimage_name:Figure 4.7 Basic differential pair.\ndescription:\n[\nname: RD1, type: Resistor, value: RD, ports: {N1: VDD, N2: X}\nname: RD2, type: Resistor, value: RD, ports: {N1: VDD, N2: Y}\nname: M1, type: NMOS, ports: {S: P, D: X, G: Vin1}\nname: M2, type: NMOS, ports: {S: P, D: Y, G: Vin2}\nname: ISS, type: CurrentSource, value: ISS, ports: {Np: P, Nn: GND}\n]\nextrainfo:The circuit shown is a basic differential pair with a current source ISS. It maintains constant current through the differential pair regardless of the input common-mode voltage. The resistors RD1 and RD2 are equal, ensuring symmetrical operation. The output nodes are Vout1 and Vout2. The circuit aims to stabilize the output common-mode level and is less sensitive to variations in input common-mode level.\n\nA straightforward modification can address the aforementioned issue. As shown in Fig. 4.7, the \"differential pair\" ${ }^{2}$ uses a current source $I_{S S}$ to make $I_{D 1}+I_{D 2}$ independent of $V_{i n, C M}$. Thus, if $V_{i n 1}=V_{i n 2}$, the bias current for each transistor equals $I_{S S} / 2$ and the output common-mode level is $V_{D D}-R_{D} I_{S S} / 2$. It is insightful to examine the large-signal behavior of the circuit for both differential and common-mode input variations. In this large-signal analysis, we disregard channel-length modulation and the body effect."
},
{
    "text": "To amplify a differential signal, we can utilize two identical single-ended signal paths to process the two phases, as indicated by previous observations [Fig. 4.6(a)]. Here, two differential inputs, $V_{i n 1}$ and $V_{i n 2}$, with a specific common-mode (CM) level, $V_{i n, C M}$, are applied to the gates. The outputs are also differential and oscillate around the output CM level, $V_{\\text {out }, C M}$. This circuit indeed provides several benefits of differential signaling, such as high rejection of supply noise and increased output swings. However, what if $V_{i n 1}$ and $V_{i n 2}$ encounter a substantial common-mode disturbance or lack a well-defined common-mode dc level? As the input CM level, $V_{i n, C M}$, varies, so do the bias currents of $M_{1}$ and $M_{2}$, thereby altering both the devices' transconductance and the output CM level. The change in transconductance results in a variation in the small-signal gain, while the deviation of the output CM level from its ideal value reduces the maximum permissible output swings. For instance, as depicted in Fig. 4.6(b), if the input CM level is excessively low, the minimum values of $V_{i n 1}$ and $V_{i n 2}$ might turn off $M_{1}$ and $M_{2}$, causing severe output clipping. Hence, it is crucial that the devices' bias currents exhibit minimal dependence on the input CM level.\n\n**Image Description (a):**\n- **Components:**\n  - **RD1:** Resistor, value: RD, ports: {N1: VDD, N2: X}\n  - **RD2:** Resistor, value: RD, ports: {N1: VDD, N2: Y}\n  - **M1:** NMOS, ports: {S: GND, D: X, G: Vin1}\n  - **M2:** NMOS, ports: {S: GND, D: Y, G: Vin2}\n  - **VDD:** VoltageSource, value: VDD, ports: {Np: VDD, Nn: GND}\n\n**Extra Info:** The circuit is a differential pair with NMOS transistors M1 and M2. It is sensitive to the input common-mode level, which can cause clipping if the input CM level is too low. The outputs are Vout1 and Vout2, influenced by the input signals Vin1 and Vin2.\n\n**Image Description (b):**\nThe diagram labeled \"(b)\" demonstrates the sensitivity of a differential pair circuit to the input common-mode (CM) level. It consists of two main sections: a circuit diagram on the left and a set of waveforms on the right.\n\n**Circuit Diagram:**\n- **Components:**\n  - Two MOSFETs, \\(M_1\\) and \\(M_2\\), with gates connected to inputs \\(V_{in1}\\) and \\(V_{in2}\\), respectively.\n  - Two resistors, \\(R_D\\), connected to the drains of \\(M_1\\) and \\(M_2\\), leading to output nodes \\(V_{out1}\\) and \\(V_{out2}\\).\n  - The sources of \\(M_1\\) and \\(M_2\\) are grounded.\n  - The circuit is powered by a supply voltage \\(V_{DD}\\).\n\n**Waveforms:**\n- **Input Waveforms:**\n  - \\(V_{in1}\\) and \\(V_{in2}\\) are sinusoidal signals around a common-mode level \\(V_{in,CM}\\), in anti-phase.\n- **Output Waveforms:**\n  - \\(V_{out1}\\) and \\(V_{out2}\\) are sinusoidal signals around a common-mode level \\(V_{out,CM}\\), affected by clipping due to the input CM level.\n\n**Behavior and Sensitivity:**\n- The waveforms show the impact of the input CM level on the MOSFETs' operation.\n- If the input CM level is too low, \\(M_1\\) and \\(M_2\\) can turn off, causing output clipping, depicted by flattened waveform areas.\n- Clipping occurs when the input signal amplitude is too high relative to the CM level, turning off the transistors during part of the cycle.\n\n**Key Features:**\n- The diagram highlights the importance of maintaining an appropriate input CM level to avoid output distortion.\n- Annotations indicate where \\(M_1\\) and \\(M_2\\) turn off, emphasizing sensitivity to low CM levels.\n\n**Figure 4.6:** (a) Simple differential circuit; (b) illustration of sensitivity to the input common-mode level.\n\n**Image Description (Figure 4.7):**\n- **Components:**\n  - **RD1:** Resistor, value: RD, ports: {N1: VDD, N2: X}\n  - **RD2:** Resistor, value: RD, ports: {N1: VDD, N2: Y}\n  - **M1:** NMOS, ports: {S: P, D: X, G: Vin1}\n  - **M2:** NMOS, ports: {S: P, D: Y, G: Vin2}\n  - **ISS:** CurrentSource, value: ISS, ports: {Np: P, Nn: GND}\n\n**Extra Info:** The circuit is a basic differential pair with a current source ISS, maintaining constant current through the pair regardless of the input common-mode voltage. The resistors RD1 and RD2 ensure symmetrical operation. The output nodes are Vout1 and Vout2. The circuit aims to stabilize the output common-mode level and is less sensitive to input common-mode level variations.\n\nA straightforward modification can address the aforementioned issue. As shown in Fig. 4.7, the \"differential pair\" employs a current source $I_{S S}$ to make $I_{D 1}+I_{D 2}$ independent of $V_{i n, C M}$. Thus, if $V_{i n 1}=V_{i n 2}$, the bias current of each transistor equals $I_{S S} / 2$, and the output common-mode level is $V_{D D}-R_{D} I_{S S} / 2$. It is insightful to examine the large-signal behavior of the circuit for both differential and common-mode input variations, neglecting channel-length modulation and body effect in the large-signal study."
},
{
    "text": "How can we amplify a differential signal? Based on the insights from the preceding section, we can utilize two identical single-ended signal paths to handle the two phases [Fig. 4.6(a)]. In this setup, two differential inputs, $V_{i n 1}$ and $V_{i n 2}$, with a specific common-mode (CM) level, $V_{i n, C M}$, are applied to the gates. The outputs are also differential and oscillate around the output CM level, $V_{\\text {out }, C M}$. This circuit indeed provides some benefits of differential signaling, such as high suppression of supply noise and greater output swings. However, what occurs if $V_{i n 1}$ and $V_{i n 2}$ encounter a substantial common-mode disturbance or lack a well-defined common-mode dc level? As the input CM level, $V_{i n, C M}$, shifts, so do the bias currents of $M_{1}$ and $M_{2}$, thereby altering both the devices' transconductance and the output CM level. This change in transconductance results in a variation in the small-signal gain, while the deviation of the output CM level from its ideal value reduces the maximum permissible output swings. For instance, as depicted in Fig. 4.6(b), if the input CM level is excessively low, the minimum values of $V_{i n 1}$ and $V_{i n 2}$ might turn off $M_{1}$ and $M_{2}$, causing severe output clipping. Therefore, it is crucial that the devices' bias currents have minimal reliance on the input CM level.\n\n**Image Description (a):**\n- **Components:**\n  - **RD1:** Resistor, value: RD, ports: {N1: VDD, N2: X}\n  - **RD2:** Resistor, value: RD, ports: {N1: VDD, N2: Y}\n  - **M1:** NMOS, ports: {S: GND, D: X, G: Vin1}\n  - **M2:** NMOS, ports: {S: GND, D: Y, G: Vin2}\n  - **VDD:** VoltageSource, value: VDD, ports: {Np: VDD, Nn: GND}\n\n- **Extra Info:**\n  - The circuit is a differential pair with NMOS transistors M1 and M2.\n  - It shows sensitivity to the input common-mode level, which can cause clipping if the input CM level is too low.\n  - The circuit outputs are Vout1 and Vout2, influenced by the input signals Vin1 and Vin2.\n\n**Image Description (b):**\n- **Overview:**\n  - The diagram labeled \"(b)\" demonstrates the sensitivity of a differential pair circuit to the input common-mode (CM) level.\n  - It consists of two main sections: a circuit diagram on the left and a set of waveforms on the right.\n\n- **Circuit Diagram:**\n  - **Components:**\n    - Two MOSFETs, \\(M_1\\) and \\(M_2\\), with gates connected to inputs \\(V_{in1}\\) and \\(V_{in2}\\), respectively.\n    - Two resistors, \\(R_D\\), connected to the drains of \\(M_1\\) and \\(M_2\\), leading to output nodes \\(V_{out1}\\) and \\(V_{out2}\\).\n    - The sources of \\(M_1\\) and \\(M_2\\) are grounded.\n    - The circuit is powered by a supply voltage \\(V_{DD}\\).\n\n- **Waveforms:**\n  - **Input Waveforms:**\n    - \\(V_{in1}\\) and \\(V_{in2}\\) are sinusoidal signals around a common-mode level \\(V_{in,CM}\\), in anti-phase.\n  - **Output Waveforms:**\n    - \\(V_{out1}\\) and \\(V_{out2}\\) are sinusoidal signals around a common-mode level \\(V_{out,CM}\\), affected by clipping due to the input CM level.\n\n- **Behavior and Sensitivity:**\n  - The waveforms show the impact of the input CM level on the MOSFETs' operation.\n  - Low input CM levels can turn off \\(M_1\\) and \\(M_2\\), leading to output clipping, depicted by flattened waveform areas.\n  - Clipping occurs when the input signal amplitude is too high relative to the CM level, causing the transistors to turn off during part of the cycle.\n\n- **Key Features:**\n  - The diagram highlights the importance of maintaining an appropriate input CM level to avoid output distortion.\n  - Annotations indicate where \\(M_1\\) and \\(M_2\\) turn off, emphasizing sensitivity to low CM levels.\n\n**Figure 4.6:**\n- (a) Simple differential circuit.\n- (b) Illustration of sensitivity to the input common-mode level.\n\n**Image Description (Figure 4.7):**\n- **Components:**\n  - **RD1:** Resistor, value: RD, ports: {N1: VDD, N2: X}\n  - **RD2:** Resistor, value: RD, ports: {N1: VDD, N2: Y}\n  - **M1:** NMOS, ports: {S: P, D: X, G: Vin1}\n  - **M2:** NMOS, ports: {S: P, D: Y, G: Vin2}\n  - **ISS:** CurrentSource, value: ISS, ports: {Np: P, Nn: GND}\n\n- **Extra Info:**\n  - The circuit is a basic differential pair with a current source ISS.\n  - It maintains constant current through the differential pair regardless of the input common-mode voltage.\n  - Resistors RD1 and RD2 are equal, ensuring symmetrical operation.\n  - The output nodes are Vout1 and Vout2.\n  - The circuit aims to stabilize the output common-mode level and is less sensitive to input common-mode level variations.\n\nA straightforward modification can address the aforementioned issue. As shown in Fig. 4.7, the \"differential pair\" ${ }^{2}$ uses a current source $I_{S S}$ to make $I_{D 1}+I_{D 2}$ independent of $V_{i n, C M}$. Thus, if $V_{i n 1}=V_{i n 2}$, the bias current for each transistor equals $I_{S S} / 2$, and the output common-mode level is $V_{D D}-R_{D} I_{S S} / 2$. It is beneficial to examine the large-signal behavior of the circuit for both differential and common-mode input variations. In this large-signal analysis, we disregard channel-length modulation and the body effect."
},
{
    "text": "In Figure 4.7, consider the scenario where the voltage difference between $V_{in1}$ and $V_{in2}$ spans from negative infinity to positive infinity. When $V_{in1}$ is significantly more negative than $V_{in2}$, transistor $M_{1}$ is turned off, while $M_{2}$ is activated, and the drain current $I_{D2}$ equals $I_{S S}$. Consequently, the output voltage $V_{out1}$ equals the supply voltage $V_{D D}$, and $V_{out2}$ is $V_{D D}$ minus $R_{D} I_{S S}$. As $V_{in1}$ approaches $V_{in2}$, $M_{1}$ begins to turn on, diverting a portion of $I_{S S}$ from $R_{D 1}$, thereby reducing $V_{out1}$. Because the sum of $I_{D1}$ and $I_{D2}$ equals $I_{S S}$, the drain current of $M_{2}$ decreases, causing $V_{out2}$ to increase. As depicted in Figure 4.8(a), when $V_{in1}$ equals $V_{in2}$, both $V_{out1}$ and $V_{out2}$ equal $V_{D D}$ minus half of $R_{D} I_{S S}$, which represents the common-mode output level. When $V_{in1}$ becomes more positive than $V_{in2}$, $M_{1}$ conducts more current than $M_{2}$, causing $V_{out1}$ to fall below $V_{out2}$. For a sufficiently large $V_{in1}-V_{in2}$, $M_{1}$ monopolizes all of $I_{S S}$, switching $M_{2}$ off. Consequently, $V_{out1}$ becomes $V_{D D}$ minus $R_{D} I_{S S}$, and $V_{out2}$ equals $V_{D D}$. Figure 4.8 also graphs the difference between $V_{out1}$ and $V_{out2}$ against the difference between $V_{in1}$ and $V_{in2}$. The is important to note that the circuit involves three differential parameters: $V_{in1}-V_{in2}$, $V_{out1}-V_{out2}$, and $I_{D1}-I_{D2}$.\n\nThe\nThe textual text has already detailed explanation of the operation of a differential pair circuit, To describes how the output voltages change in response to variations differential voltage difference and Here text also includes\nIn provided text is a detailed explanation of the operation of a differential pair circuit. It describes how the output voltages change in response to the input voltage differences. The text also"
},
{
    "text": "Assuming that in Figure 4.7, the voltage difference between $V_{in1}$ and $V_{in2}$ ranges from negative infinity to positive infinity, the behavior of the circuit can be described as follows: When $V_{in1}$ is significantly more negative than $V_{in2}$, transistor $M_{1}$ is turned off, while $M_{2}$ is turned on, resulting in a drain current $I_{D2}$ equal to the tail current $I_{SS}$. Consequently, the output voltage $V_{out1}$ equals the supply voltage $V_{DD}$, and $V_{out2}$ is reduced by the voltage drop across resistor $R_{D}$ due to the tail current, becoming $V_{DD} - R_{D} I_{SS}$. As $V_{in1}$ approaches $V_{in2}$, $M_{1}$ starts to conduct, diverting a portion of $I_{SS}$ from $R_{D1}$, which in turn decreases $V_{out1}$. Because the sum of $I_{D1}$ and $I_{D2}$ equals $I_{SS}$, the decrease in $I_{D2}$ leads to an increase in $V_{out2}$. Figure 4.8(a) demonstrates that when $V_{in1}$ equals $V_{in2}$, both $V_{out1}$ and $V_{out2}$ settle at $V_{DD} - \\frac{R_{D} I_{SS}}{2}$, defining the common-mode output level. If $V_{in1}$ becomes more positive than $V_{in2}$, $M_{1}$ conducts more current than $M_{2}$, causing $V_{out1}$ to drop below $V_{out2}$. For a large enough $V_{in1} - V_{in2}$, $M_{1}$ takes almost all of $I_{SS}$, effectively turning off $M_{2}$. Consequently, $V_{out1}$ equals $V_{DD} - R_{D} I_{SS}$, and $V_{out2}$ returns to $V_{DD}$. Figure 4.8 also presents a plot of the difference between output voltages $V_{out1} - V_{out2}$ against the input voltage difference $V_{in1} - V_{in2}$. The circuit exhibits three differential parameters: $V_{in1} - V_{in2}$, $V_{out1} - V_{out2}$, and $I_{D1} - I_{D2}$.\n\nThe graphs in Figures 4.8 and 4.9 depict the differential input-output characteristics of a differential pair, illustrating the voltage transfer characteristics. The horizontal axis of these graphs represents the differential input voltage, while the vertical axis represents the output voltages. The plots show that as the input differential voltage varies, the output voltages exhibit a linear and symmetrical response around the common-mode point. The maximum and minimum output voltage levels are clearly defined and independent of the input common-mode level. Additionally, the small-signal gain, which is the slope of the output voltage difference against the input voltage difference, is maximized when the input voltages are equal and decreases as the input voltage swing increases.\n\nIn analyzing the common-mode behavior of the circuit, it is noted that the tail current source serves to minimize the impact of input common-mode level variations on the operation of $M_{1}$ and $M_{2}$ and the output level. The input common-mode voltage $V_{in,CM}$ cannot be arbitrarily low or high. If $V_{in,CM}$ is too low, both $M_{1}$ and $M_{2}$ are turned off, preventing signal amplification. As $V_{in,CM}$ increases, $M_{1}$ and $M_{2}$ turn on, and the circuit operates as a source follower, with the output voltage tracking the input voltage. For proper operation, $V_{in,CM}$ must be greater than or equal to $V_{GS1} + (V_{GS3} - V_{TH3})$. The allowable range of $V_{in,CM}$ is thus bounded by these conditions.\n\nThe small-signal differential gain of a differential pair as a function of the input common-mode voltage is shown in Figure 4.10. The gain increases with $V_{in,CM}$ until the tail current source enters saturation, after which the gain remains relatively constant. However, if $V_{in,CM}$ is too high, causing the input transistors to enter the triode region, the gain begins to decrease.\n\nThe maximum output voltage swings of a differential pair can be analyzed by considering the circuit biased with specific input and output common-mode levels. The output can swing between $V_{DD}$ and approximately $V_{in,CM} - V_{TH}$, depending on the input common-mode level. A lower input common-mode level allows for larger output swings. The comparison with a CS stage shows that a differential pair can provide significantly larger output swings, especially when properly biased.\n\nThese descriptions effectively rephrase the original text while maintaining the technical accuracy and context of the information provided."
},
{
    "text": "Suppose in Fig. 4.7, the voltage difference between $V_{in1}$ and $V_{in2}$ spans from negative infinity to positive infinity. When $V_{in1}$ is significantly more negative than $V_{in2}$, transistor $M_{1}$ is off, $M_{2}$ is on, and the drain current $I_{D2}$ equals $I_{SS}$. Consequently, the output voltage $V_{out1}$ equals\n equals that in Figure 4.7 the voltage difference $V_{in1} - V_{in2}$ ranges from negative infinity to positive infinity, consider the scenario where $V_{in1}$ is substantially more negative than $V_{in2}$. In this case, transistor $M_{1}$ is non-conducting, $M_{2}$ is conducting, and the drain current $I_{D2}$ is equal to the tail current $I_{SS}$. As a result, the output voltage $V_{out1}$ is equal to the supply voltage $V_{DD}$, and $V_{out2}$ is $V_{DD}$ minus the voltage drop across resistor $R_{D}$ due to the tail current, which is $V_{DD} - R_{D} I_{SS}$. When $V_{in1}$ is made less negative and approaches $V_{in2}$, $M_{1}$ starts to turn on, diverting a portion of $I_{SS}$ from $R_{D1}$, thereby reducing $V_{out1}$. Because the sum of $I_{D1}$ and $I_{D2}$ equals $I_{SS}$, the drain current of $M_{2}$ decreases, causing $V_{out2}$ to increase. As depicted in Figure 4.8(a), when $V_{in1}$ equals $V_{in2}$, both output voltages $V_{out1}$ and $V_{out2}$ are equal to $V_{DD} - R_{D} I_{SS} / 2$, representing the common-mode output level. When $V_{in1}$ becomes more positive than $V_{in2}$, $M_{1}$ conducts more current than $M_{2}$, and $V_{out1}$ falls below $V_{out2}$. For a sufficiently large voltage difference $V_{in1} - V_{in2}$, $M_{1}$ takes almost all of $I_{SS}$, turning off $M_{2}$. Consequently, $V_{out1}$ equals $V_{DD} - R_{D} I_{SS}$, and $V_{out2}$ is equal to $V_{DD}$. Figure 4.8 also graphs the voltage difference $V_{out1} - V_{out2}$ against the voltage difference $V_{in1} - V_{in2}$. It is important to note that the circuit involves three differential parameters: the voltage difference $V_{in1} - V_{in2}$, the voltage difference $V_{out1} - V_{out2}$, and the current difference $I_{D1} - I_{D2}$."
},
{
    "text": "---[Attention]---\nDescriptive Imagery: Textual equivalents for visuals referenced within the [Context Provided] area have been crafted. Furthermore, a reworded rendition of the original text is required to preserve the intended message and length.\n---[Task]---\nTransform the content presented in the [Context Provided] Section into a new version while maintaining the original essence and length.\n---[Context Provided]---\nThe text to be rephrased:\n\n```\nLet us assume that in Fig. 4.7, $V_{i n 1}-V_{i n 2}$ varies from $-\\infty$ to $+\\infty$. If $V_{i n 1}$ is much more negative than $V_{\\text {in2 }}, M_{1}$ is off, $M_{2}$ is on, and $I_{D 2}=I_{S S}$. Thus, $V_{\\text {out } 1}=V_{D D}$ and $V_{\\text {out } 2}=V_{D D}-R_{D} I_{S S}$. As $V_{i n 1}$ is brought closer to $V_{i n 2}, M_{1}$ gradually turns on, drawing a fraction of $I_{S S}$ from $R_{D 1}$ and hence lowering $V_{\\text {out } 1}$. Since $I_{D 1}+I_{D 2}=I_{S S}$, the drain current of $M_{2}$ falls and $V_{\\text {out } 2}$ rises. As shown in Fig. 4.8(a), for $V_{\\text {in } 1}=V_{\\text {in } 2}$, we have $V_{\\text {out } 1}=V_{\\text {out } 2}=V_{D D}-R_{D} I_{S S} / 2$, which is the output CM level. As $V_{\\text {in } 1}$ becomes more positive than $V_{\\text {in2 }}, M_{1}$ carries a greater current than does $M_{2}$ and $V_{\\text {out } 1}$ drops below $V_{\\text {out } 2}$. For sufficiently large $V_{i n 1}-V_{i n 2}, M_{1}$ \"hogs\" all of $I_{S S}$, turning $M_{2}$ off. As a result, $V_{\\text {out } 1}=V_{D D}-R_{D} I_{S S}$ and $V_{\\text {out } 2}=V_{D D}$. Figure 4.8 also plots $V_{\\text {out } 1}-V_{\\text {out } 2}$ versus $V_{\\text {in } 1}-V_{\\text {in } 2}$. Note that the circuit contains three differential quantities: $V_{i n 1}-V_{\\text {in } 2}, V_{\\text {out } 1}-V_{\\text {out } 2}$, and $I_{D 1}-I_{D 2}$.\n```\n\nRephrased text:\n\n```\nConsider the scenario depicted in Fig. 4.7, where the difference $V_{i n 1}-V_{i n 2}$ spans from negative to positive infinity. When $V_{i n 1}$ is significantly more negative than $V_{\\text {in2 }}, M_{1}$ is inactive, M_{2}$ is active, and the drain current $I_{D 2}$ equals $I_{S S}$. Consequently, $V_{\\text {out } 1}$ equals $V_{D D}$ and $V_{\\text {out } 2}$ is equal to $V_{D D}-R_{D} I_{S S}$. As $V_{i n 1}$ approaches $V_{i n 2}, M_{1}$ begins to activate, siphoning off a portion of $I_{S S}$ from $R_{D 1}$, leading to a decrease in $V_{\\text {out } 1}$. Given that the sum of $I_{D 1}$ and $I_{D 2}$ is $I_{S S}$, the drain current of $M_{2}$ decreases, causing $V_{\\text {out } 2}$ to increase. Figure 4.8(a) illustrates that when $V_{\\text {in } 1}$ is equal to $V_{\\text {in } 2}$, both $V_{\\text {out } 1}$ and $V_{\\text {out } 2}$ equal $V_{D D}-\\frac{R_{D} I_{S S}}{2}$, representing the common-mode output voltage. As $V_{\\text {in } 1}$ becomes increasingly positive compared to $V_{\\text {in2 }}, M_{1}$ conducts more current than M_{2}$, causing $V_{\\text {out } 1}$ to fall below $V_{\\text {out } 2}$. When $V_{i n 1}-V_{i n 2}$ is sufficiently large, M_{1}$ consumes the entire $I_{S S}$, deactivating M_{2}$. Consequently, $V_{\\text {out } 1}$ becomes $V_{D D}-R_{D} I_{S S}$ and $V_{\\text {out } 2}$ equals $V_{D D}$. Additionally, Figure 4.8 displays $V_{\\text {out } 1}-V_{\\text {out } 2}$ plotted against $V_{\\text {in } 1}-V_{\\text {in } 2}$. Note that the circuit involves three differential parameters: $V_{i n 1}-V_{\\text {in } 2}$, $V_{\\text {out } 1}-V_{\\text {out } 2}$, and $I_{D 1}-I_{D 2}$.\n```"
},
{
    "text": "Referring to Fig. 4.7, consider the scenario where the voltage difference $V_{in1}-V_{in2}$ spans from negative infinity to positive infinity. When $V_{in1}$ is significantly more negative than $V_{in2}$, transistor $M_{1}$ is turned off, $M_{2}$ is turned on, and the current $I_{D2}$ equals $I_{S S}$. Consequently, the output voltage $V_{out1}$ equals $V_{D D}$, and $V_{out2}$ equals $V_{D D}-R_{D} I_{S S}$. As $V_{in1}$ approaches $V_{in2}$, $M_{1}$ begins to turn on, drawing a portion of $I_{S S}$ from $R_{D 1}$, thereby reducing $V_{out1}$. Since the sum of $I_{D1}$ and $I_{D2}$ equals $I_{S S}$, the drain current of $M_{2}$ decreases, causing $V_{out2}$ to increase. As depicted in Fig. 4.8(a), when $V_{in1}$ equals $V_{in2}$, both $V_{out1}$ and $V_{out2}$ equal $V_{D D}-R_{D} I_{S S} / 2$, which represents the common-mode output level. When $V_{in1}$ becomes more positive than $V_{in2}$, $M_{1}$ conducts more current than $M_{2}$, causing $V_{out1}$ to drop below $V_{out2}$. For a sufficiently large $V_{in1}-V_{in2}$, $M_{1}$ \"claims\" the entire $I_{S S}$, switching $M_{2}$ off. Consequently, $V_{out1}$ equals $V_{D D}-R_{D} I_{S S}$, and $V_{out2}$ equals $V_{D D}$. Figure 4.8 also illustrates the plot of $V_{out1}-V_{out2}$ against $V_{in1}-V_{in2}$. The circuit involves three differential parameters: $V_{in1}-V_{in2}$, $V_{out1}-V_{out2}$, and $I_{D1}-I_{D2}$.\n\nThe graph labeled \"(a)\" in Figure 4.8 exhibits the differential input-output characteristics of a differential pair. This graph is a voltage transfer characteristic curve.\n\nAxes Labels and Units:\n- **Horizontal Axis (X-axis):** Represents the differential input voltage \\( V_{in1} - V_{in2} \\), generally understood to be in volts.\n- **Vertical Axis (Y-axis):** Represents the output voltages \\( V_{out1} \\) and \\( V_{out2} \\), also in volts.\n\nOverall Behavior and Trends:\n- The graph presents two curves demonstrating the behavior of \\( V_{out1} \\) and \\( V_{out2} \\) as \\( V_{in1} - V_{in2} \\) varies.\n- The curve for \\( V_{out1} \\) commences at \\( V_{DD} - R_D I_{SS} \\) for large negative \\( V_{in1} - V_{in2} \\) and ascends to \\( V_{DD} \\) for large positive \\( V_{in1} - V_{in2} \\).\n- Conversely, the curve for \\( V_{out2} \\) begins at \\( V_{DD} \\) for large negative \\( V_{in1} - V_{in2} \\) and descends to \\( V_{DD} - R_D I_{SS} \\) for large positive \\( V_{in1} - V_{in2} \\).\n- Both curves exhibit symmetry around the center point \\( V_{out,CM} = V_{DD} - \\frac{R_D I_{SS}}{2} \\), which is the common-mode output voltage.\n\nKey Features and Technical Details:\n- The maximum output voltage for \\( V_{out1} \\) is \\( V_{DD} \\), and the minimum is \\( V_{DD} - R_D I_{SS} \\).\n- The crossover point, where \\( V_{in1} = V_{in2} \\), is at \\( V_{out,CM} = V_{DD} - \\frac{R_D I_{SS}}{2} \\).\n- The graph illustrates that the output voltages \\( V_{out1} \\) and \\( V_{out2} \\) are inversely related as the input differential voltage varies.\n\nAnnotations and Specific Data Points:\n- The graph includes annotations for critical values such as \\( V_{DD} \\), \\( V_{out,CM} \\), and \\( V_{DD} - R_D I_{SS} \\), providing reference points for understanding the voltage levels.\n- The symmetry of the curves around the common-mode voltage emphasizes the balanced nature of the differential pairs operation.\n\nThis graph effectively illustrates the relationship between differential input voltage and the resulting differential output voltages in a differential pair circuit, highlighting the linear and symmetrical response around the common-mode point.\n\nThe graph labeled \"(b)\" in Figure 4.8 is a plot depicting the differential input-output characteristics of a differential pair. This specific graph is a voltage transfer characteristic curve, showcasing the relationship between the differential output voltage \\( V_{out1} - V_{out2} \\) and the differential input voltage \\( V_{in1} - V_{in2} \\).\n\nAxes Labels and Units:\n- **Horizontal Axis (X-axis):** Represents the differential input voltage \\( V_{in1} - V_{in2} \\).\n- **Vertical Axis (Y-axis):** Represents the differential output voltage \\( V_{out1} - V_{out2} \\).\n- The units for both axes are typically in volts (V), although specific units are not marked on the diagram.\n\nOverall Behavior and Trends:\n- The curve is S-shaped, indicating a nonlinear relationship between the input and output differential voltages.\n- As \\( V_{in1} - V_{in2} \\) increases from negative to positive values, the differential output voltage \\( V_{out1} - V_{out2} \\) transitions from \\( -R_D I_{SS} \\) to \\( +R_D I_{SS} \\).\n- When \\( V_{in1} = V_{in2} \\), the differential output is zero, indicating symmetry around this point.\n\nKey Features and Technical Details:\n- The graph shows saturation regions where the output voltage levels off at \\( +R_D I_{SS} \\) and \\( -R_D I_{SS} \\).\n- The slope of the curve is steepest around the origin, indicating maximum small-signal gain at \\( V_{in1} = V_{in2} \\).\n\nAnnotations and Specific Data Points:\n- The curve is centered around the origin, with the zero crossing at \\( V_{in1} = V_{in2} \\).\n- The saturation points are marked at \\( +R_D I_{SS} \\) and \\( -R_D I_{SS} \\), representing the limits of the differential output voltage.\n\nThe analysis reveals two important attributes of the differential pair. First, the maximum and minimum levels at the output are well-defined ( $V_{D D}$ and $V_{D D}-R_{D} I_{S S}$, respectively) and independent of the input CM level. Second, as demonstrated later, the small-signal gain (the slope of $V_{out1}-V_{out2}$ versus $V_{in1}-V_{in2}$ ) is maximum for $V_{in1}=V_{in2}$, gradually falling\nRe text text provided seems to be a technical explanation of a behavior and characteristics of a differential pair circuit in electronics, along the explanations of voltage levels, transistor states, and graphical distributions\nCertainly original provided describes a intricate-depth examination of a differential pair circuit's operational characteristics. It begins by hypothesizing a scenario where the voltage difference between two input terminals, $V_{in1}$ and $V_{in2}$, spans the entire spectrum from negative to positive infinity. In this context, the behavior of the transistors $M_{1}$ and $M_{2}$, as well as the resulting output voltages $V_{out1}$ and $V_{out2}$, are meticulously described.\n\nWhen $V_{in1}$ is significantly more negative than $V_{in2}$, transistor $M_{1}$ is in an off state, while $M_{2}$ is on, leading to $I_{D2}$ equalling the static current $I_{S S}$. This results in $V_{out1}$ being equal to the power supply voltage $V_{D D}$, and $V_{out2}$ being slightly less due to the voltage drop across the resistor $R_{D}$ caused by $I_{S S}$. As the voltage of $V_{in1}$ approaches that of $V_{in2}$, $M_{1}$ starts to conduct,$I_{S S}$, thereby reducing $V_{out1}$. The conservation of current dictates that the decrease in $I_{D2}$ leads to an increase in $V_{out2}$. When the input voltages are equal, the output voltages settle at a midpoint, reflecting the common-mode output level.\n\nThe text goes on to describe the behavior when $V_{in1}$ exceeds $V_{in2}$, leading to $M_{1}$ conducting more current than $M_{2}$, and thus causing $V_{out1}$ to drop below $V_{out2}$. For a substantial difference between the input voltages, $M_{1}$ can dominate the current, effectively turning off $M_{2}$, which leads to specific output voltage levels for $V_{out1}$ and $V_{out2}$.\n\nThe provided graphs, Figure 4.8(a) and (b), are described as voltage transfer characteristic plots, illustrating the differential input-output characteristics. These graphs show how the output voltages respond to changes in the differential input voltage, highlighting key operational features such as symmetry, saturation regions, and the maximum small-signal gain at the equilibrium point where $V_{in1} = V_{in2}$.\n\nThe analysis underscores the well-defined output voltage levels and the independence of these levels from the input common-mode level. Additionally, it points out that the small-signal gain is maximized when the input voltages are equal and decreases as the voltage difference increases, indicating a more nonlinear response with larger input swings.\n\nThe text further delves into the common-mode behavior of the circuit, emphasizing the role of the tail current source in maintaining stable operation of the differential pair despite variations in the common-mode input level. It discusses the limitations on the common-mode input voltage, both from the lower bound set by the threshold voltage and the upper bound dictated by the need to keep the transistors in saturation.\n\nFinally, the text touches upon the comparison of output voltage swings between a common-source (CS) stage and a differential pair, noting that the differential pair can provide substantially larger swings, especially when properly biased.\n\nThis rephrased text aims to maintain the original meaning and technical precision of the electronic circuit description while offering a clearer and more structured explanation of the differential pair's behavior and characteristics."
},
{
    "text": "Suppose in Fig. 4.7, the voltage difference $V_{in1}-V_{in2}$ spans from negative infinity to positive infinity. When $V_{in1}$ is substantially more negative than $V_{in2}$, transistor $M_1$ is off, while $M_2$ is on, and the drain current $I_{D2}$ equals the saturation current $I_{SS}$. Consequently, the output voltage $V_{out1}$ equals the supply voltage $V_{DD}$, and $V_{out2}$ is $V_{DD} - R_D I_{SS}$. As $V_{in1}$ approaches $V_{in2}$, $M_1$ gradually turns on, diverting a portion of $I_{SS}$ from $R_D1$, thereby reducing $V_{out1}$. Since the sum of $I_{D1}$ and $I_{D2}$ equals $I_{SS}$, the drain current of $M_2$ decreases, causing $V_{out2}$ to rise. As depicted in Fig. 4.8(a), when $V_{in1}$ equals $V_{in2}$, both output voltages $V_{out1}$ and $V_{out2}$ equal $V_{DD} - \\frac{R_D I_{SS}}{2}$, which represents the common-mode output level. Should $V_{in1}$ become more positive than $V_{in2}$, $M_1$ conducts more current than $M_2$, leading to $V_{out1}$ dropping below $V_{out2}$. For a sufficiently large $V_{in1}-V_{in2}$, $M_1$ monopolizes all of $I_{SS}$, switching $M_2$ off. Consequently, $V_{out1}$ becomes $V_{DD} - R_D I_{SS}$, and $V_{out2}$ equals $V_{DD}$. Figure 4.8 also illustrates the variation of $V_{out1}-V_{out2}$ against $V_{in1}-V_{in2}$. It is worth noting that the circuit involves three differential parameters: $V_{in1}-V_{in2}$, $V_{out1}-V_{out2}$, and $I_{D1}-I_{D2}$.\n\nThe graphical representation in Fig. 4.8(a) exhibits the differential input-output characteristics of a differential pair. This graph, a type of voltage transfer characteristic, illustrates the relationship between the differential input voltage and the resulting output voltages.\n\nThe horizontal axis of the graph represents the differential input voltage $V_{in1} - V_{in2}$, typically measured in volts, while the vertical axis depicts the output voltages $V_{out1}$ and $V_{out2}$, also in volts. The graph displays two curves, each showing how $V_{out1}$ and $V_{out2}$ behave as $V_{in1} - V_{in2}$ changes. The curve for $V_{out1}$ commences at $V_{DD} - R_D I_{SS}$ for significantly negative $V_{in1} - V_{in2}$ and ascends to $V_{DD}$ for significantly positive $V_{in1} - V_{in2}$. Conversely, the curve for $V_{out2}$ starts at $V_{DD}$ for significantly negative $V_{in1} - V_{in2}$ and descends to $V_{DD} - R_D I_{SS}$ for significantly positive $V_{in1} - V_{in2}$. Both curves exhibit symmetry around the midpoint $V_{out,CM} = V_{DD} - \\frac{R_D I_{SS}}{2}$, which is the common-mode output voltage.\n\nKey features of the graph include the maximum output voltage for $V_{out1}$ being $V_{DD}$ and the minimum being $V_{DD} - R_D I_{SS}$. The crossover point, where $V_{in1} = V_{in2}$, is at $V_{out,CM} = V_{DD} - \\frac{R_D I_{SS}}{2}$. The graph demonstrates the inverse relationship between the output voltages $V_{out1}$ and $V_{out2}$ as the input differential voltage varies.\n\nAnnotations on the graph provide reference points for critical values such as $V_{DD}$, $V_{out,CM}$, and $V_{DD} - R_D I_{SS}$, aiding in the understanding of voltage levels. The symmetry of the curves around the common-mode voltage underscores the balanced operation of the differential pairs.\n\nThis graph effectively conveys the relationship between differential input voltage and the resulting differential output voltages in a differential pair circuit, emphasizing the linear and symmetrical response centered around the common-mode point.\n\nThe graph in Fig. 4.8(b) is a plot that shows the differential input-output characteristics of a differential pair. It is a voltage transfer characteristic curve that illustrates the relationship between the differential output voltage $V_{out1} - V_{out2}$ and the differential input voltage $V_{in1} - V_{in2}$.\n\nThe horizontal axis represents the differential input voltage $V_{in1} - V_{in2}$, and the vertical axis represents the differential output voltage $V_{out1} - V_{out2}$. Both axes are typically measured in volts, although specific units are not indicated on the diagram.\n\nThe curve in this graph is S-shaped, indicating a nonlinear relationship between the input and output differential voltages. As $V_{in1} - V_{in2}$ increases from negative to positive values, the differential output voltage $V_{out1} - V_{out2}$ transitions from $-R_D I_{SS}$ to $+R_D I_{SS}$. When $V_{in1} = V_{in2}$, the differential output is zero, signifying symmetry around this point.\n\nKey features of this graph include the saturation regions where the output voltage levels off at $+R_D I_{SS}$ and $-R_D I_{SS}$. The curve's slope is steepest around the origin, indicating maximum small-signal gain at $V_{in1} = V_{in2}$.\n\nAnnotations on the curve include the zero crossing at $V_{in1} = V_{in2}$ and the saturation points marked at $+R_D I_{SS}$ and $-R_D I_{SS}$, representing the limits of the differential output voltage.\n\nThese analyses reveal two significant attributes of the differential pair. First, the maximum and minimum output levels are well-defined and independent of the input common-mode level. Second, the small-signal gain (the slope of $V_{out1}-V_{out2}$ versus $V_{in1}-V_{in2}$) is maximum at $V_{in1}=V_{in2}$, decreasing to zero as the magnitude of $V_{in1}-V_{in2}$ increases. In other words, the circuit exhibits increased nonlinearity with increasing input voltage swing. At $V_{in1}=V_{in2}$, the circuit is said to be in \"equilibrium.\"\n\nNext, consider the common-mode behavior of the circuit. The role of the tail current source is to mitigate the impact of input common-mode level fluctuations on the operation of $M_1$ and $M_2$ and the output level. However, this does not imply that the common-mode input voltage $V_{in,CM}$ can assume arbitrarily low or high values. To address this, we set $V_{in1}=V_{in2}=V_{in,CM}$ and vary $V_{in,CM}$ from 0 to $V_{DD}$. Figure 4.9(a) depicts the circuit with $I_{SS}$ provided by an NFET. It is noted that the symmetry of the pair necessitates $V_{out1}=V_{out2}$.\n\nWhen $V_{in,CM}=0$, both $M_1$ and $M_2$ are off since their gate potential is not more positive than their source potential, resulting in $I_{D3}=0$. This indicates that $M_3$ operates in the deep triode region because the voltage $V_b$ is sufficient to create an inversion layer in the transistor. With $I_{D1}=I_{D2}=0$, the circuit is incapable of signal amplification, and both $V_{out1}$ and $V_{out2}$ equal $V_{DD}$, with $V_P=0$.\n\nAs $V_{in,CM}$ becomes more positive, modeling $M_3$ as a resistor as in Fig. 4.9(b), we observe that $M_1$ and $M_2$ turn on if $V_{in,CM} \\geq V_{TH}$. Beyond this point, $I_{D1}$ and $I_{D2}$ continue to increase, and $V_P$ also rises [Fig. 4.9(c)]. In a sense, $M_1$ and $M_2$ act as a source follower, forcing $V_P$ to track $V_{in,CM}$. For a sufficiently high $V_{in,CM}$, the drain-source voltage of $M_3$ exceeds $V_{GS3}-V_{TH3}$, allowing the device to operate in saturation. The total current through $M_1$ and $M_2$ then remains constant. We conclude that for proper operation, $V_{in,CM} \\geq V_{GS1}+(V_{GS3}-V_{TH3})$.\n\nThe graph in Fig. 4.9(c) consists of three separate plots, each depicting different characteristics related to the common-mode input voltage $V_{in,CM}$.\n\n1. The first plot (left) is a current versus voltage graph showing the behavior of the drain currents $I_{D1}$ and $I_{D2}$ as $V_{in,CM}$ increases. The plot shows an initial increase in the drain currents as $V_{in,CM}$ rises, starting from zero and increasing sharply after a threshold voltage $V_{TH1}$. The current then plateaus, indicating saturation. A vertical dashed line marks the threshold voltage $V_{GS1} + V_{GS3} - V_{TH3}$, indicating where the device transitions to saturation.\n\n2. The second plot (middle) is a voltage versus voltage graph showing the relationship between $V_{in,CM}$ and $V_P$. The plot shows a linear relationship, with $V_P$ increasing linearly as $V_{in,CM}$ increases. The line starts from a point just after $V_{TH1}$, indicating the beginning of the linear tracking of $V_P$ with $V_{in,CM}$.\n\n3. The third plot (right) is a voltage versus voltage graph showing the behavior of the output voltages $V_{out1}$ and $V_{out2}$ as $V_{in,CM}$ varies. The plot shows a constant output voltage $V_{DD}$ initially, which then decreases sharply after $V_{TH1}$, and stabilizes to a lower constant value $V_{DD} - \\frac{I_{SS}}{2}R_D$. Two vertical dashed lines mark the critical voltages $V_{TH1}$ and $V_{GS1} + V_{GS3} - V_{TH3}$, indicating transitions in the output behavior.\n\nThese plots illustrate the behavior of the differential pair as it responds to changes in the common-mode input voltage, showing how the currents and voltages adjust with respect to the input.\n\nFigure 4.9 (a) shows a differential pair sensing an input common-mode change; (b) presents an equivalent circuit if $M_3$ operates in the deep triode region; (c) depicts the common-mode input-output characteristics.\n\nIf $V_{in,CM}$ increases further, since $V_{out1}$ and $V_{out2}$ are relatively constant, we expect that $M_1$ and $M_2$ enter the triode region if $V_{in,CM} > V_{out1} + V_{TH} = V_{DD} - R_D I_{SS} / 2 + V_{TH}$. This sets an upper limit on the input common-mode level. In summary, the allowable value of $V_{in,CM}$ is bounded as follows:\n\n$$\nV_{GS1} + (V_{GS3} - V_{TH3}) \\leq V_{in,CM} \\leq \\min[V_{DD} - R_D \\frac{I_{SS}}{2} + V_{TH}, V_{DD}]\n$$\n\nBeyond the upper bound, the common-mode characteristics of Fig. 4.9(c) do not change, but the differential gain decreases.\n\n#### Example 4.2\n\nSketch the small-signal differential gain of a differential pair as a function of the input common-mode level.\n\nThe graph in Figure 4.10 shows the small-signal differential gain $A_V$ of a differential pair as a function of the input common-mode voltage $V_{in,CM}$. The graph is a typical representation of gain behavior against varying input common-mode levels.\n\nThe horizontal axis represents the input common-mode voltage $V_{in,CM}$, and the vertical axis represents the absolute value of the differential gain $|A_V|$. The gain $A_V$ begins to increase as $V_{in,CM}$ exceeds a threshold voltage $V_{TH}$. After the tail current source enters saturation ($V_{in,CM} = V_1$), the gain remains relatively constant. Finally, if $V_{in,CM}$ is so high that the input transistors enter the triode region ($V_{in,CM} = V_2$), the gain begins to fall.\n\nKey points on the graph include the threshold voltage $V_{TH}$, the saturation point $V_1$, and the triode region entry $V_2$. These points are annotated on the graph with dashed vertical lines, highlighting key transitions in the gain behavior.\n\nThis graph effectively illustrates how the differential gain of a pair varies with changes in the common-mode input voltage, showing distinct regions of operation: initial increase, constant gain, and eventual decrease.\n\n#### Solution\n\nAs shown in Fig. 4.10, the gain starts to increase as $V_{in,CM}$ exceeds $V_{TH}$. After the tail current source enters saturation ($V_{in,CM} = V_1$), the gain remains relatively constant. Finally, if $V_{in,CM}$ is so high that the input transistors enter the triode region ($V_{in,CM} = V_2$), the gain begins to decline.\n\nWith an understanding of the differential and common-mode behavior of the differential pair, we can now address another important question: How large can the output voltage swings of a differential pair be? Suppose the circuit is biased with input and output bias levels $V_{in,CM}$ and $V_{out,CM}$, respectively, and $V_{in,CM} < V_{out,CM}$. Also, assume that the voltage gain is high, meaning the input swing is much less than the output swing. As illustrated in Fig. 4.11, for $M_1$ and $M_2$ to be saturated, each output can go as high as $V_{DD}$ but as low as approximately $V_{in,CM} - V_{TH}$. In other words, the higher the input CM level, the smaller the allowable output swings. For this reason, it is desirable to choose a relatively low $V_{in,CM}$, but no less than $V_{GS1} + (V_{GS3} - V_{TH3})$. Such a choice affords a single-ended peak-to-peak output swing of $V_{DD} - (V_{GS1} - V_{TH1}) - (V_{GS3} - V_{TH3})$ (why?). The reader is encouraged to repeat this analysis if the voltage gain is around unity.\n\nThe circuit in Fig. 4.11 is a differential pair with NMOS transistors $M_1$, $M_2$, and a current source $M_3$. The resistors $RD$ are used as load resistors. The input signals are $Vin1$ and $Vin2$, and the bias voltage is $Vb$. The circuit is designed to analyze the maximum allowable output swings in a differential pair.\n\nThe graph labeled \"Vin1 Vin2\" represents a time-domain waveform illustrating the behavior of a differential pair circuit. The graph is divided into two main sections: the schematic of the differential pair on the left and the waveform on the right.\n\nThe graph is a time-domain waveform that shows the input and output voltages of a differential pair circuit. The horizontal axis represents time (t), though the specific units are not labeled, and the vertical axis represents voltage, with specific units not provided. It shows the common-mode input voltage (Vin,CM), input voltages (Vin1 and Vin2), and output voltages (Vout,CM, Vx, Vy).\n\nThe input voltages Vin1 and Vin2 are shown as sinusoidal waveforms that are 180 degrees out of phase with each other, indicating a differential input signal. The output voltages Vx and Vy also exhibit sinusoidal behavior, with Vx being in phase with Vin1 and Vy being in phase with Vin2. The common-mode output voltage (Vout,CM) is depicted as a reference level between Vx and Vy.\n\nThe graph shows the maximum allowable output swings with reference to the threshold voltage VTH1. The output voltages Vx and Vy oscillate around the common-mode output voltage, with the peak-to-peak amplitude limited by the threshold voltage. The waveform suggests that the differential pair is operating within its linear region, as the output swings are symmetric around the common-mode level.\n\nAnnotations on the graph include the threshold voltage VTH1, marked as a vertical distance between the common-mode level and the peak of the output waveform. The graph emphasizes the relationship between the input common-mode voltage and the allowable output swings, aligning with the context provided about maximizing output swings while maintaining a low input common-mode voltage.\n\nThe graph titled \"Vout,CM\" is a time-domain waveform that illustrates the behavior of output voltages in a differential pair circuit. The x-axis represents time \\(t\\), while the y-axis represents voltage levels, specifically the common-mode output voltage \\(V_{out,CM}\\) along with individual output voltages \\(V_X\\) and \\(V_Y\\).\n\nThe graph shows two sinusoidal waveforms, \\(V_X\\) and \\(V_Y\\), which are 180 degrees out of phase with each other. These waveforms represent the differential output voltages of the circuit. The common-mode voltage \\(V_{out,CM}\\) is depicted as a horizontal dashed line, indicating a constant voltage level around which the sinusoidal waveforms oscillate.\n\nKey features of the graph include the sinusoidal waveforms \\(V_X\\) and \\(V_Y\\) oscillating symmetrically around the common-mode voltage \\(V_{out,CM}\\). Both \\("
},
{
    "text": "Considering Figure 4.7, assume the voltage difference between $V_{in1}$ and $V_{in2}$ ranges from negative infinity to positive infinity. When $V_{in1}$ is significantly more negative than $V_{in2}$, transistor $M_1$ is off, while $M_2$ is on, and the current $I_{D2}$ equals the saturation current $I_{SS}$. Consequently, the output voltage $V_{out1}$ equals the supply voltage $V_{DD}$, and $V_{out2}$ is $V_{DD}$ minus the product of the resistor $R_D$ and $I_{SS}$. As $V_{in1}$ approaches $V_{in2}$, $M_1$ gradually turns on, diverting a portion of $I_{SS}$ from $R_{D1}$, which in turn reduces $V_{out1}$. Since the sum of $I_{D1}$ and $I_{D2}$ is constant at $I_{SS}$, the decrease in $I_{D2}$ leads to an increase in $V_{out2}$. As depicted in Figure 4.8(a), when $V_{in1}$ equals $V_{in2}$, both output voltages $V_{out1}$ and $V_{out2}$ are $V_{DD}$ minus half the product of $R_D$ and $I_{SS}$, representing the common-mode output level. When $V_{in1}$ becomes more positive than $V_{in2}$, $M_1$ conducts more current than $M_2$, causing $V_{out1}$ to drop below $V_{out2}$. For a large enough $V_{in1}-V_{in2}$, $M_1$ takes all of $I_{SS}$, switching $M_2$ off. Consequently, $V_{out1}$ equals $V_{DD}$ minus the product of $R_D$ and $I_{SS}$, and $V_{out2}$ equals $V_{DD}$. Figure 4.8 also shows the plot of the voltage difference $V_{out1}-V_{out2}$ against the input voltage difference $V_{in1}-V_{in2}$. The circuit involves three differential parameters: $V_{in1}-V_{in2}$, $V_{out1}-V_{out2}$, and $I_{D1}-I_{D2}$.\n\nThe graph labeled \"(a)\" in Figure 4.8 illustrates the differential input-output characteristics of a differential pair. This graph is a type of voltage transfer characteristic graph. The horizontal axis represents the differential input voltage $V_{in1} - V_{in2}$, and the vertical axis represents the output voltages $V_{out1}$ and $V_{out2}$, both typically in volts. The graph displays two curves indicating the behavior of $V_{out1}$ and $V_{out2}$ as $V_{in1} - V_{in2}$ changes. The curve for $V_{out1}$ starts at $V_{DD} - R_D I_{SS}$ for large negative $V_{in1} - V_{in2}$ and rises to $V_{DD}$ for large positive $V_{in1} - V_{in2}$. Conversely, the curve for $V_{out2}$ starts at $V_{DD}$ for large negative $V_{in1} - V_{in2}$ and falls to $V_{DD} - R_D I_{SS}$ for large positive $V_{in1} - V_{in2}$. Both curves are symmetric about the center point $V_{out,CM} = V_{DD} - \\frac{R_D I_{SS}}{2}$, which is the common-mode output voltage. The graph effectively illustrates the relationship between differential input voltage and the resulting differential output voltages in a differential pair circuit, highlighting the linear and symmetrical response around the common-mode point.\n\nThe graph labeled \"(b)\" in Figure 4.8 is a plot illustrating the differential input-output characteristics of a differential pair. This specific graph is a voltage transfer characteristic curve, showing the relationship between the differential output voltage $V_{out1} - V_{out2}$ and the differential input voltage $V_{in1} - V_{in2}$. The horizontal axis represents the differential input voltage $V_{in1} - V_{in2}$, and the vertical axis represents the differential output voltage $V_{out1} - V_{out2}$, both typically in volts. The curve is S-shaped, indicating a nonlinear relationship between the input and output differential voltages. As $V_{in1} - V_{in2}$ increases from negative to positive values, the differential output voltage $V_{out1} - V_{out2}$ transitions from $-R_D I_{SS}$ to $+R_D I_{SS}$. When $V_{in1} = V_{in2}$, the differential output is zero, indicating symmetry around this point. The graph shows saturation regions where the output voltage levels off at $+R_D I_{SS}$ and $-R_D I_{SS}$. The slope of the curve is steepest around the origin, indicating maximum small-signal gain at $V_{in1} = V_{in2}$. The curve is centered around the origin, with the zero crossing at $V_{in1} = V_{in2}$. The saturation points are marked at $+R_D I_{SS}$ and $-R_D I_{SS}$, representing the limits of the differential output voltage. The graph reveals two important attributes of the differential pair. First, the maximum and minimum levels at the output are well-defined and independent of the input CM level. Second, the small-signal gain is maximum for $V_{in1} = V_{in2}$, gradually falling to zero as $\\left|V_{in1}-V_{in2}\\right|$ increases. In other words, the circuit becomes more nonlinear as the input voltage swing increases. For $V_{in1} = V_{in2}$, the circuit is in \"equilibrium.\"\n\nNow let us consider the common-mode behavior of the circuit. As mentioned earlier, the role of the tail current source is to suppress the effect of input CM level variations on the operation of $M_1$ and $M_2$ and the output level. Does this mean that $V_{in,CM}$ can assume arbitrarily low or high values? To answer this question, we set $V_{in1} = V_{in2} = V_{in,CM}$ and vary $V_{in,CM}$ from 0 to $V_{DD}$. Figure 4.9(a) shows the circuit with $I_{SS}$ implemented by an NFET. Note that the symmetry of the pair requires that $V_{out1} = V_{out2}$.\n\nWhat happens if $V_{in,CM} = 0$? Since the gate potential of $M_1$ and $M_2$ is not more positive than their source potential, both devices are off, yielding $I_{D3} = 0$. This indicates that $M_3$ operates in the deep triode region because $V_b$ is high enough to create an inversion layer in the transistor. With $I_{D1} = I_{D2} = 0$, the circuit is incapable of signal amplification, $V_{out1} = V_{out2} = V_{DD}$, and $V_P = 0$.\n\nNow suppose $V_{in,CM}$ becomes more positive. Modeling $M_3$ by a resistor as in Figure 4.9(b), we note that $M_1$ and $M_2$ turn on if $V_{in,CM} \\geq V_{TH}$. Beyond this point, $I_{D1}$ and $I_{D2}$ continue to increase, and $V_P$ also rises [Figure 4.9(c)]. In a sense, $M_1$ and $M_2$ constitute a source follower, forcing $V_P$ to track $V_{in,CM}$. For a sufficiently high $V_{in,CM}$, the drain-source voltage of $M_3$ exceeds $V_{GS3} - V_{TH3}$, allowing the device to operate in saturation. The total current through $M_1$ and $M_2$ then remains constant. We conclude that for proper operation, $V_{in,CM} \\geq V_{GS1} + (V_{GS3} - V_{TH3})$.\n\nThe circuit is a differential pair sensing an input common-mode change. $M_1$ and $M_2$ form a source follower configuration. $M_3$ operates in saturation to maintain constant current through $M_1$ and $M_2$ for proper operation. The circuit behavior is influenced by $V_{in,CM}$, $V_{out1}$, $V_{out2}$, and $V_b$. The circuit diagram (b) is a differential pair with NMOS transistors $M_1$ and $M_2$, and a common-mode feedback transistor $M_3$. The resistors $RD$ are connected to $V_{DD}$, providing load resistance for the drains of $M_1$ and $M_2$. The resistor $Ron3$ is connected between the common source node of $M_1$ and $M_2$ and ground, modeling the on-resistance of $M_3$ in the triode region.\n\nThe graph in Figure 4.9(c) consists of three separate plots, each depicting different characteristics related to the common-mode input voltage, $V_{in,CM}$.\n\n1. **First Plot (Left):**\n   - **Type:** Current vs. Voltage Graph\n   - **Axes:**\n     - **X-axis:** $V_{in,CM}$ (Common-mode input voltage)\n     - **Y-axis:** $I_{D1}, I_{D2}$ (Drain currents of transistors $M_1$ and $M_2$)\n   - **Behavior:**\n     - The plot shows an initial increase in the drain currents as $V_{in,CM}$ rises, starting from zero and increasing sharply after a threshold voltage $V_{TH1}$.\n     - The current then plateaus, indicating saturation.\n   - **Key Features:**\n     - A vertical dashed line marks the threshold voltage $V_{GS1} + V_{GS3} - V_{TH3}$, indicating where the device transitions to saturation.\n\n2. **Second Plot (Middle):**\n   - **Type:** Voltage vs. Voltage Graph\n   - **Axes:**\n     - **X-axis:** $V_{in,CM}$ (Common-mode input voltage)\n     - **Y-axis:** $V_P$ (Voltage at node P)\n   - **Behavior:**\n     - The plot shows a linear relationship, with $V_P$ increasing linearly as $V_{in,CM}$ increases.\n   - **Key Features:**\n     - The line starts from a point just after $V_{TH1}$, indicating the beginning of the linear tracking of $V_P$ with $V_{in,CM}$.\n\n3. **Third Plot (Right):**\n   - **Type:** Voltage vs. Voltage Graph\n   - **Axes:**\n     - **X-axis:** $V_{in,CM}$ (Common-mode input voltage)\n     - **Y-axis:** $V_{out1}, V_{out2}$ (Output voltages)\n   - **Behavior:**\n     - The plot shows a constant output voltage $V_{DD}$ initially, which then decreases sharply after $V_{TH1}$, and stabilizes to a lower constant value $V_{DD} - \\frac{I_{SS}}{2}R_D$.\n   - **Key Features:**\n     - Two vertical dashed lines mark the critical voltages $V_{TH1}$ and $V_{GS1} + V_{GS3} - V_{TH3}$, indicating transitions in the output behavior.\n\nOverall, these plots illustrate the behavior of the differential pair as it responds to changes in the common-mode input voltage, showing how the currents and voltages adjust with respect to the input.\n\nFigure 4.9 (a) Differential pair sensing an input common-mode change; (b) equivalent circuit if $M_3$ operates in the deep triode region; (c) common-mode input-output characteristics.\n\nWhat happens if $V_{in,CM}$ rises further? Since $V_{out1}$ and $V_{out2}$ are relatively constant, we expect that $M_1$ and $M_2$ enter the triode region if $V_{in,CM} > V_{out1} + V_{TH} = V_{DD} - R_D I_{SS} / 2 + V_{TH}$. This sets an upper limit on the input CM level. In summary, the allowable value of $V_{in,CM}$ is bounded as follows:\n\n$$\nV_{GS1} + (V_{GS3} - V_{TH3}) \\leq V_{in,CM} \\leq \\min [V_{DD} - R_D \\frac{I_{SS}}{2} + V_{TH}, V_{DD}]\n$$\n\nBeyond the upper bound, the CM characteristics of Figure 4.9(c) do not change, but the differential gain drops.\n\n#### Example 4.2\n\nSketch the small-signal differential gain of a differential pair as a function of the input CM level.\n\n#### Solution\n\nAs shown in Figure 4.10, the gain begins to increase as $V_{in,CM}$ exceeds $V_{TH}$. After the tail current source enters saturation ($V_{in,CM} = V_1$), the gain remains relatively constant. Finally, if $V_{in,CM}$ is so high that the input transistors enter the triode region ($V_{in,CM} = V_2$), the gain begins to fall.\n\nWith our understanding of the differential and common-mode behavior of the differential pair, we can now answer another important question: How large can the output voltage swings of a differential pair be? Suppose the circuit is biased with input and output bias levels $V_{in,CM}$ and $V_{out,CM}$, respectively, and $V_{in,CM} < V_{out,CM}$. Also, assume that the voltage gain is high, that is, the input swing is much less than the output swing. As illustrated in Figure 4.11, for $M_1$ and $M_2$ to be saturated, each output can go as high as $V_{DD}$ but as low as approximately $V_{in,CM} - V_{TH}$. In other words, the higher the input CM level, the smaller the allowable output swings. For this reason, it is desirable to choose a relatively low $V_{in,CM}$, but, of course, no less than $V_{GS1} + (V_{GS3} - V_{TH3})$. Such a choice affords a single-ended peak-to-peak output swing of $V_{DD} - (V_{GS1} - V_{TH1}) - (V_{GS3} - V_{TH3})$ (why?). The reader is encouraged to repeat this analysis if the voltage gain is around unity.\n\n#### Example 4.3\n\nCompare the maximum output voltage swings provided by a CS stage and a differential pair.\n\n#### Solution\n\nRecall from Chapter 3 that a CS stage (with resistive load) allows an output swing of $V_{DD}$ minus one overdrive ($V_{DD} - V_{D,sat}$). As seen above, with proper choice of the input CM level, a differential pair provides a maximum output swing of $V_{DD}$ minus two overdrives (single-ended) or $2 V_{DD}$ minus four overdrives (differential) ($2 V_{DD} - 4 V_{D,sat}$), which is typically quite a lot larger than $V_{DD} - V_{D,sat}$."
},
{
    "text": "In Figure 4.7, consider the scenario where the voltage difference between $V_{in1}$ and $V_{in2}$ ranges from negative infinity to positive infinity. When $V_{in1}$ is significantly more negative than $V_{in2}$, transistor $M_{1}$ is turned off, while $M_{2}$ is turned on, causing the drain current $I_{D2}$ to equal the tail current $I_{S S}$. Consequently, the output voltage $V_{out1}$ equals the supply voltage $V_{D D}$, and $V_{out2}$ is $V_{D D}$ minus the voltage drop across the resistor $R_{D}$ due to the tail current, which is $V_{D D} - R_{D} I_{S S}$. As $V_{in1}$ approaches $V_{in2}$, $M_{1}$ begins to turn on gradually, diverting a portion of $I_{S S}$ through $R_{D1}$, thereby reducing $V_{out1}$. Because the sum of $I_{D1}$ and $I_{D2}$ equals $I_{S S}$, the decrease in $I_{D2}$ leads to an increase in $V_{out2}$. As depicted in Figure 4.8(a), when $V_{in1}$ equals $V_{in2}$, both output voltages $V_{out1}$ and $V_{out2}$ become $V_{D D} - R_{D} I_{S S} / 2$, representing the common-mode output level. If $V_{in1}$ becomes more positive than $V_{in2}$, $M_{1}$ conducts more current than $M_{2}$, causing $V_{out1}$ to decrease below $V_{out2}$. For a sufficiently large voltage difference between $V_{in1}$ and $V_{in2}$, $M_{1}$ dominates the current, turning $M_{2}$ off completely. This results in $V_{out1}$ being $V_{D D} - R_{D} I_{S S}$ and $V_{out2}$ being $V_{D D}$. Figure 4.8 also illustrates the plot of $V_{out1} - V_{out2}$ against $V_{in1} - V_{in2}$. It is noteworthy that the circuit involves three differential parameters: $V_{in1} - V_{in2}$, $V_{out1} - V_{out2}$, and $I_{D1} - I_{D2}$.\n\nFigure 4.8(a) portrays the differential input-output characteristics of a differential pair. The graph is a voltage transfer characteristic curve that shows how the output voltages $V_{out1}$ and $V_{out2}$ vary with the differential input voltage $V_{in1} - V_{in2}$. The horizontal axis represents the differential input voltage, and the vertical axis represents the output voltages, both typically in volts. The graph exhibits two curves indicating the behavior of $V_{out1}$ and $V_{out2}$ as the input voltage difference changes. The curve for $V_{out1}$ starts at $V_{D D} - R_{D} I_{S S}$ for large negative input voltages and rises to $V_{D D}$ for large positive input voltages. Conversely, the curve for $V_{out2}$ starts at $V_{D D}$ for large negative input voltages and falls to $V_{D D} - R_{D} I_{S S}$ for large positive input voltages. Both curves are symmetric around the center point $V_{out,CM} = V_{D D} - R_{D} I_{S S} / 2$, which is the common-mode output voltage. The graph includes annotations for critical values such as $V_{D D}$, $V_{out,CM}$, and $V_{D D} - R_{D} I_{S S}$, providing reference points for understanding the voltage levels. The symmetry of the curves around the common-mode voltage highlights the balanced nature of the differential pairs operation.\n\nFigure 4.8(b) is another plot illustrating the differential input-output characteristics of a differential pair. This graph is a voltage transfer characteristic curve showing the relationship between the differential output voltage $V_{out1} - V_{out2}$ and the differential input voltage $V_{in1} - V_{in2}$. The horizontal axis represents the differential input voltage, and the vertical axis represents the differential output voltage, both typically in volts. The curve is S-shaped, indicating a nonlinear relationship between the input and output differential voltages. As $V_{in1} - V_{in2}$ increases from negative to positive values, the differential output voltage $V_{out1} - V_{out2}$ transitions from $-R_{D} I_{S S}$ to $+R_{D} I_{S S}$. When $V_{in1} = V_{in2}$, the differential output is zero, indicating symmetry around this point. The graph shows saturation regions where the output voltage levels off at $+R_{D} I_{S S}$ and $-R_{D} I_{S S}$. The slope of the curve is steepest around the origin, indicating maximum small-signal gain at $V_{in1} = V_{in2}$. The curve is centered around the origin, with the zero crossing at $V_{in1} = V_{in2}$. The saturation points are marked at $+R_{D} I_{S S}$ and $-R_{D} I_{S S}$, representing the limits of the differential output voltage.\n\nThe analysis reveals two important attributes of the differential pair. First, the maximum and minimum levels at the output are well-defined ($V_{D D}$ and $V_{D D} - R_{D} I_{S S}$, respectively) and independent of the input CM level. Second, the small-signal gain (the slope of $V_{out1} - V_{out2}$ versus $V_{in1} - V_{in2}$) is maximum for $V_{in1} = V_{in2}$, gradually falling to zero as $|V_{in1} - V_{in2}|$ increases. In other words, the circuit becomes more nonlinear as the input voltage swing increases. For $V_{in1} = V_{in2}$, the circuit is said to be in \"equilibrium.\"\n\nNow let us consider the common-mode behavior of the circuit. As mentioned earlier, the role of the tail current source is to suppress the effect of input CM level variations on the operation of $M_{1}$ and $M_{2}$ and the output level. This does not mean that $V_{in,CM}$ can assume arbitrarily low or high values. To answer this question, we set $V_{in1} = V_{in2} = V_{in,CM}$ and vary $V_{in,CM}$ from 0 to $V_{D D}$. Figure 4.9(a) shows the circuit with $I_{S S}$ implemented by an NFET. Note that the symmetry of the pair requires that $V_{out1} = V_{out2}$.\n\nWhat happens if $V_{in,CM} = 0$? Since the gate potential of $M_{1}$ and $M_{2}$ is not more positive than their source potential, both devices are off, yielding $I_{D3} = 0$. This indicates that $M_{3}$ operates in the deep triode region because $V_{b}$ is high enough to create an inversion layer in the transistor. With $I_{D1} = I_{D2} = 0$, the circuit is incapable of signal amplification, $V_{out1} = V_{out2} = V_{D D}$, and $V_{P} = 0$.\n\nNow suppose $V_{in,CM}$ becomes more positive. Modeling $M_{3}$ by a resistor as in Figure 4.9(b), we note that $M_{1}$ and $M_{2}$ turn on if $V_{in,CM} \\geq V_{T H}$. Beyond this point, $I_{D1}$ and $I_{D2}$ continue to increase, and $V_{P}$ also rises [Figure 4.9(c)]. In a sense, $M_{1}$ and $M_{2}$ constitute a source follower, forcing $V_{P}$ to track $V_{in,CM}$. For a sufficiently high $V_{in,CM}$, the drain-source voltage of $M_{3}$ exceeds $V_{G S3} - V_{T H3}$, allowing the device to operate in saturation. The total current through $M_{1}$ and $M_{2}$ then remains constant. We conclude that for proper operation, $V_{in,CM} \\geq V_{G S1} + (V_{G S3} - V_{T H3})$.\n\nFigure 4.9(a) depicts a differential pair sensing an input common-mode change; (b) shows the equivalent circuit if $M_{3}$ operates in the deep triode region; (c) presents the common-mode input-output characteristics.\n\nWhat happens if $V_{in,CM}$ rises further? Since $V_{out1}$ and $V_{out2}$ are relatively constant, we expect that $M_{1}$ and $M_{2}$ enter the triode region if $V_{in,CM} > V_{out1} + V_{T H} = V_{D D} - R_{D} I_{S S} / 2 + V_{T H}$. This sets an upper limit on the input CM level. In summary, the allowable value of $V_{in,CM}$ is bounded as follows:\n\n$$\nV_{G S1} + (V_{G S3} - V_{T H3}) \\leq V_{in,CM} \\leq \\min [V_{D D} - R_{D} \\frac{I_{S S}}{2} + V_{T H}, V_{D D}]\n$$\n\nBeyond the upper bound, the CM characteristics of Figure 4.9(c) do not change, but the differential gain drops.\n\n#### Example 4.2\n\nSketch the small-signal differential gain of a differential pair as a function of the input CM level.\n\nFigure 4.10 shows the small-signal differential gain $A_V$ of a differential pair as a function of the input common-mode voltage $V_{in,CM}$. The graph is a typical representation of gain behavior against varying input common-mode levels. The horizontal axis represents the input common-mode voltage, and the vertical axis represents the absolute value of the differential gain. The gain $A_V$ begins to increase as $V_{in,CM}$ exceeds a threshold voltage $V_{T H}$. After the tail current source enters saturation ($V_{in,CM} = V_{1}$), the gain remains relatively constant. Finally, if $V_{in,CM}$ is so high that the input transistors enter the triode region ($V_{in,CM} = V_{2}$), the gain begins to fall.\n\nWith our understanding of the differential and common-mode behavior of the differential pair, we can now answer another important question: How large can the output voltage swings of a differential pair be? Suppose the circuit is biased with input and output bias levels $V_{in,CM}$ and $V_{out,CM}$, respectively, and $V_{in,CM} < V_{out,CM}$. Also, assume that the voltage gain is high, meaning the input swing is much less than the output swing. As illustrated in Figure 4.11, for $M_{1}$ and $M_{2}$ to be saturated, each output can go as high as $V_{D D}$ but as low as approximately $V_{in,CM} - V_{T H}$. In other words, the higher the input CM level, the smaller the allowable output swings. For this reason, it is desirable to choose a relatively low $V_{in,CM}$, but no less than $V_{G S1} + (V_{G S3} - V_{T H3})$. Such a choice affords a single-ended peak-to-peak output swing of $V_{D D} - (V_{G S1} - V_{T H1}) - (V_{G S3} - V_{T H3})$. The reader is encouraged to repeat this analysis if the voltage gain is around unity.\n\nFigure 4.11 shows the maximum allowable output swings in a differential pair.\n\n#### Example 4.3\n\nCompare the maximum output voltage swings provided by a CS stage and a differential pair.\n\nRecall from Chapter 3 that a CS stage (with resistive load) allows an output swing of $V_{D D}$ minus one overdrive ($V_{D D} - V_{D,sat}$). As seen above, with a proper choice of the input CM level, a differential pair provides a maximum output swing of $V_{D D}$ minus two overdrives (single-ended) or $2 V_{D D}$ minus four overdrives (differential) ($2 V_{D D} - 4 V_{D,sat}$), which is typically quite a lot larger than $V_{D D} - V_{D,sat}$."
},
{
    "text": "In this section, we analyze the large-signal and small-signal properties of MOS differential pairs. We start by examining the large-signal characteristics to derive expressions for the plots depicted in Fig. 4.8.\n\nWe focus on the large-signal behavior of the differential pair shown in Fig. 4.12. Our goal is to express the output voltage difference, $V_{\\text {out } 1}-V_{\\text {out } 2}$, as a function of the input voltage difference, $V_{\\text {in } 1}-V_{\\text {in } 2}$. We have $V_{\\text {out } 1}=V_{D D}-R_{D 1} I_{D 1}$ and $V_{\\text {out } 2}=V_{D D}-R_{D 2} I_{D 2}$, which leads to $V_{\\text {out } 1}-V_{\\text {out } 2}=R_{D 2} I_{D 2}-R_{D 1} I_{D 1}=R_{D}(I_{D 2}-I_{D 1})$ if $R_{D 1}=R_{D 2}=R_{D}$. Therefore, we need to calculate $I_{D 1}$ and $I_{D 2}$ in terms of $V_{i n 1}$ and $V_{i n 2}$, assuming the circuit is symmetric, $M_{1}$ and $M_{2}$ are in saturation, and $\\lambda=0$. Since the voltage at node $P$ is equal to $V_{i n 1}-V_{G S 1}$ and $V_{i n 2}-V_{G S 2}$,\n\n$$\n\\begin{equation*}\nV_{i n 1}-V_{i n 2}=V_{G S 1}-V_{G S 2} \\tag{4.2}\n\\end{equation*}\n$$\n\nThis is a differential pair circuit with two NMOS transistors M1 and M2. The current source Iss provides the bias current. The resistors RD1 and RD2 are connected to the drains of M1 and M2, respectively, and the power supply VDD is connected to the top of these resistors. The circuit is designed to amplify the difference between Vin1 and Vin2, producing outputs Vout1 and Vout2.\n\nFor a square-law device, we have\n\n$$\n\\begin{equation*}\n\\left(V_{G S}-V_{T H}\\right)^{2}=\\frac{I_{D}}{\\frac{1}{2} \\mu_{n} C_{o x} \\frac{W}{L}} \\tag{4.3}\n\\end{equation*}\n$$\n\nand, therefore,\n\n$$\n\\begin{equation*}\nV_{G S}=\\sqrt{\\frac{2 I_{D}}{\\mu_{n} C_{o x} \\frac{W}{L}}}+V_{T H} \\tag{4.4}\n\\end{equation*}\n$$\n\nIt follows from (4.2) and (4.4) that\n\n$$\n\\begin{equation*}\nV_{i n 1}-V_{i n 2}=\\sqrt{\\frac{2 I_{D 1}}{\\mu_{n} C_{o x} \\frac{W}{L}}}-\\sqrt{\\frac{2 I_{D 2}}{\\mu_{n} C_{o x} \\frac{W}{L}}} \\tag{4.5}\n\\end{equation*}\n$$\n\nWe wish to calculate the differential output current, $I_{D 1}-I_{D 2}$. Squaring the two sides of (4.5) and recognizing that $I_{D 1}+I_{D 2}=I_{S S}$, we obtain\n\n$$\n\\begin{equation*}\n\\left(V_{i n 1}-V_{i n 2}\\right)^{2}=\\frac{2}{\\mu_{n} C_{o x} \\frac{W}{L}}\\left(I_{S S}-2 \\sqrt{I_{D 1} I_{D 2}}\\right) \\tag{4.6}\n\\end{equation*}\n$$\n\nThat is,\n\n$$\n\\begin{equation*}\n\\frac{1}{2} \\mu_{n} C_{o x} \\frac{W}{L}\\left(V_{i n 1}-V_{i n 2}\\right)^{2}-I_{S S}=-2 \\sqrt{I_{D 1} I_{D 2}} \\tag{4.7}\n\\end{equation*}\n$$\n\nSquaring the two sides again and noting that $4 I_{D 1} I_{D 2}=\\left(I_{D 1}+I_{D 2}\\right)^{2}-\\left(I_{D 1}-I_{D 2}\\right)^{2}=I_{S S}^{2}-\\left(I_{D 1}-I_{D 2}\\right)^{2}$, we arrive at\n\n$$\n\\begin{equation*}\n\\left(I_{D 1}-I_{D 2}\\right)^{2}=-\\frac{1}{4}\\left(\\mu_{n} C_{o x} \\frac{W}{L}\\right)^{2}\\left(V_{i n 1}-V_{i n 2}\\right)^{4}+I_{S S} \\mu_{n} C_{o x} \\frac{W}{L}\\left(V_{i n 1}-V_{i n 2}\\right)^{2} \\tag{4.8}\n\\end{equation*}\n$$\n\nThus,\n\n$$\n\\begin{align*}\nI_{D 1}-I_{D 2} & =\\frac{1}{2} \\mu_{n} C_{o x} \\frac{W}{L}\\left(V_{i n 1}-V_{i n 2}\\right) \\sqrt{\\frac{4 I_{S S}}{\\mu_{n} C_{o x} \\frac{W}{L}}-\\left(V_{i n 1}-V_{i n 2}\\right)^{2}}  \\tag{4.9}\\\\\n& =\\sqrt{\\mu_{n} C_{o x} \\frac{W}{L} I_{S S}\\left(V_{i n 1}-V_{i n 2}\\right) \\sqrt{1-\\frac{\\mu_{n} C_{o x}(W / L)}{4 I_{S S}}\\left(V_{i n 1}-V_{i n 2}\\right)^{2}}} \\tag{4.10}\n\\end{align*}\n$$\n\nWe can say that $M_{1}, M_{2}$, and the tail operate as a voltage-dependent current source producing $I_{D 1}-I_{D 2}$ according to the above large-signal characteristics. As expected, $I_{D 1}-I_{D 2}$ is an odd function of $V_{i n 1}-V_{i n 2}$, falling to zero for $V_{i n 1}=V_{i n 2}$. As $\\left|V_{i n 1}-V_{i n 2}\\right|$ increases from zero, $\\left|I_{D 1}-I_{D 2}\\right|$ increases because the factor preceding the square root rises more rapidly than the argument in the square root drops. ${ }^{4}$\n\nBefore examining (4.9) further, it is instructive to calculate the slope of the characteristic, i.e., the equivalent $G_{m}$ of $M_{1}$ and $M_{2}$. Denoting the differential quantities $I_{D 1}-I_{D 2}$ and $V_{i n 1}-V_{i n 2}$ by $\\Delta I_{D}$ and $\\Delta V_{i n}$, respectively, the reader can show that\n\n$$\n\\begin{equation*}\n\\frac{\\partial \\Delta I_{D}}{\\partial \\Delta V_{i n}}=\\frac{1}{2} \\mu_{n} C_{o x} \\frac{W}{L} \\frac{\\frac{4 I_{S S}}{\\mu_{n} C_{o x} W / L}-2 \\Delta V_{i n}^{2}}{\\sqrt{\\frac{4 I_{S S}}{\\mu_{n} C_{o x} W / L}-\\Delta V_{i n}^{2}}} \\tag{4.11}\n\\end{equation*}\n$$\n\nFor $\\Delta V_{i n}=0, G_{m}$ is maximum (why?) and equal to $\\sqrt{\\mu_{n} C_{o x}(W / L) I_{S S}}$. Moreover, since $V_{\\text {out } 1}-V_{\\text {out } 2}=$ $R_{D} \\Delta I=-R_{D} G_{m} \\Delta V_{i n}$, we can write the small-signal differential voltage gain of the circuit in the equilibrium condition as\n\n$$\n\\begin{equation*}\n\\left|A_{v}\\right|=\\sqrt{\\mu_{n} C_{o x} \\frac{W}{L} I_{S S}} R_{D} \\tag{4.12}\n\\end{equation*}\n$$\n\nSince each transistor carries a bias current of $I_{S S} / 2$ in this condition, the factor $\\sqrt{\\mu_{m} C_{o x}(W / L) I_{S S}}$ is in fact the same as the transconductance of each device, that is, $\\left|A_{v}\\right|=g_{m} R_{D}$. Equation (4.11) also suggests that $G_{m}$ falls to zero for $\\Delta V_{i n}=\\sqrt{2 I_{S S} /\\left(\\mu_{n} C_{o x} W / L\\right)}$. As we will see below, this value of $\\Delta V_{i n}$ plays an important role in the operation of the circuit.\n\nLet us now examine Eq. (4.9) more closely. If $\\left(V_{i n 1}-V_{i n 2}\\right)^{2} \\ll 4 I_{S S} /\\left[\\mu_{n} C_{o x}(W / L)\\right]$, then\n\n$$\n\\begin{equation*}\nI_{D 1}-I_{D 2}=\\sqrt{\\mu_{n} C_{o x} \\frac{W}{L} I_{S S}}\\left(V_{i n 1}-V_{i n 2}\\right) \\tag{4.13}\n\\end{equation*}\n$$\n\nwhich yields the same equilibrium $G_{m}$ as that obtained above. But what happens for larger values of $\\left|V_{i n 1}-V_{i n 2}\\right|$ ? It appears that the argument in the square root drops to zero for $\\Delta V_{i n}=\\sqrt{4 I_{S S} /\\left(\\mu_{n} C_{o x} W / L\\right)}$ and $\\Delta I_{D}$ crosses zero at two different values of $\\Delta V_{i n}$, an effect not predicted by our qualitative analysis in Fig. 4.8. This conclusion, however, is incorrect. To understand why, recall that (4.9) was derived with the assumption that both $M_{1}$ and $M_{2}$ are on. In reality, as $\\Delta V_{i n}$ exceeds a limit, one transistor carries the entire $I_{S S}$, turning off the other. ${ }^{5}$ Denoting this value by $\\Delta V_{i n 1}$, we have $I_{D 1}=I_{S S}$ and $\\Delta V_{i n 1}=V_{G S 1}-V_{T H}$ because $M_{2}$ is nearly off. It follows that\n\n$$\n\\begin{equation*}\n\\Delta V_{i n 1}=\\sqrt{\\frac{2 I_{S S}}{\\mu_{n} C_{o x} \\frac{W}{L}}} \\tag{4.14}\n\\end{equation*}\n$$\n\nFor $\\Delta V_{i n}>\\Delta V_{i n 1}, M_{2}$ is off and (4.9) and (4.10) do not hold. As mentioned above, $G_{m}$ falls to zero for $\\Delta V_{i n}=\\Delta V_{i n 1}$. Figure 4.13 plots the behavior.\n\n#### Example 4.4\n\nPlot the output currents of a differential pair versus $\\Delta V_{i n}$ as the device width and the tail current vary.\n\n#### Solution\n\nConsider the characteristic shown in Fig. 4.14(a). As $W / L$ increases, $\\Delta V_{i n 1}$ decreases, narrowing the input range across which both devices are on [Fig. 4.14(b)]. As $I_{S S}$ increases, both the input range and the output current swing increase [Fig. 4.14(c)]. Intuitively, we expect the circuit to become more linear as $I_{S S}$ increases or $W / L$ decreases.\n\nimage_name:(a)\ndescription:The graph labeled \"(a)\" is a plot of drain currents \\(I_{D1}\\) and \\(I_{D2}\\) versus the differential input voltage \\(\\Delta V_{in}\\) for a differential pair. The x-axis represents the differential input voltage \\(\\Delta V_{in}\\), marked with key points \\(-\\Delta V_{in1}\\) and \\(+\\Delta V_{in1}\\), while the y-axis represents the drain currents \\(I_{D1}\\) and \\(I_{D2}\\).\n\n**Type of Graph and Function:**\n- The graph is a characteristic curve showing the relationship between input voltage and output currents in a differential pair circuit.\n\n**Axes Labels and Units:**\n- X-axis: \\(\\Delta V_{in}\\) (differential input voltage)\n- Y-axis: \\(I_{D1}\\) and \\(I_{D2}\\) (drain currents)\n\n**Overall Behavior and Trends:**\n- As the input voltage \\(\\Delta V_{in}\\) increases from negative to positive, the current \\(I_{D1}\\) increases while \\(I_{D2}\\) decreases symmetrically.\n- The graph shows a crossover point at \\(\\Delta V_{in} = 0\\), where both currents are equal.\n- The curves are S-shaped, indicating a smooth transition between states.\n\n**Key Features and Technical Details:**\n- The currents \\(I_{D1}\\) and \\(I_{D2}\\) are equal at \\(\\Delta V_{in} = 0\\), which is the point of symmetry for the differential pair.\n- The input voltage range \\([-\\Delta V_{in1}, +\\Delta V_{in1}]\\) defines the region where both transistors are active.\n\n**Annotations and Specific Data Points:**\n- The graph is annotated with \\(-\\Delta V_{in1}\\) and \\(+\\Delta V_{in1}\\) to indicate the input voltage limits where the differential pair begins to turn one side off completely.\n\nThis graph is critical for understanding how the differential pair responds to changes in input voltage, showing the linearity and the range of operation of the circuit.\nimage_name:(b)\ndescription:The graph labeled \"(b)\" is a plot of transconductance \\( G_m \\) versus differential input voltage \\( \\Delta V_{in} \\). It is a typical bell-shaped curve, commonly seen in the analysis of differential pairs.\n\n1. **Type of Graph and Function:**\n- This is a plot of transconductance, which is a measure of the gain of a differential pair, as a function of the differential input voltage.\n\n2. **Axes Labels and Units:**\n- The horizontal axis represents the differential input voltage \\( \\Delta V_{in} \\), with units likely in volts (V).\n- The vertical axis represents the transconductance \\( G_m \\), which is typically measured in siemens (S).\n\n3. **Overall Behavior and Trends:**\n- The graph shows a peak in transconductance at the center, where \\( \\Delta V_{in} \\) is zero, indicating maximum gain at this point.\n- As \\( \\Delta V_{in} \\) moves away from zero in either direction (positive or negative), the transconductance decreases, showing a symmetrical drop on both sides of the peak.\n- This behavior suggests that the differential pair is most linear and has the highest gain when the input voltage difference is minimal.\n\n4. **Key Features and Technical Details:**\n- The peak of the curve corresponds to the maximum transconductance, which occurs at \\( \\Delta V_{in} = 0 \\).\n- The curve is symmetrical about the vertical axis, indicating balanced behavior for both positive and negative input differences.\n- The width of the curve at the base indicates the range of \\( \\Delta V_{in} \\) over which the transconductance is significant.\n\n5. **Annotations and Specific Data Points:**\n- The graph does not show specific numerical annotations or markers, but the peak and symmetry are key qualitative features.\n- The points labeled \\( -\\Delta V_{in1} \\) and \\( +\\Delta V_{in1} \\) likely represent the input voltage limits where the transconductance begins to significantly decrease.\n\nFigure 4.13 Variation of drain currents and overall transconductance of a differential pair versus input voltage.\nimage_name:Figure 4.14(a)\ndescription:The graph labeled \"(a)\" is a plot that illustrates the variation of the difference in drain currents (denoted as \\( I_{D1} - I_{D2} \\)) of a differential pair versus the input voltage \\( \\Delta V_{in} \\).\n\n1. **Type of Graph and Function:**\n- This is a characteristic curve graph representing the relationship between differential input voltage and differential output current in a differential amplifier.\n\n2. **Axes Labels and Units:**\n- The horizontal axis is labeled \\( \\Delta V_{in} \\), representing the input voltage difference. It does not specify units, but it is typically in volts.\n- The vertical axis is labeled \\( I_{D1} - I_{D2} \\), representing the difference in drain currents. Units are not specified, but it is typically in amperes.\n\n3. **Overall Behavior and Trends:**\n- The graph shows an S-shaped curve centered around the origin. As \\( \\Delta V_{in} \\) increases from negative to positive, \\( I_{D1} - I_{D2} \\) transitions from \\(-I_{SS}\\) to \\(+"
},
{
    "text": "In this section, we examine the large-signal and small-signal characteristics of MOS differential pairs. We start with a large-signal analysis to derive expressions for the plots depicted in Fig. 4.8.\n\nWe focus on the large-signal behavior of the differential pair shown in Fig. 4.12, aiming to express $V_{\\text {out } 1}-V_{\\text {out } 2}$ as a function of $V_{\\text {in } 1}-V_{\\text {in } 2}$. Given that $V_{\\text {out } 1}=V_{D D}-R_{D 1} I_{D 1}$ and $V_{\\text {out } 2}=V_{D D}-R_{D 2} I_{D 2}$, we find that $V_{\\text {out } 1}-V_{\\text {out } 2}=R_{D 2} I_{D 2}-R_{D 1} I_{D 1}=R_{D}\\left(I_{D 2}-I_{D 1}\\right)$, assuming $R_{D 1}=R_{D 2}=R_{D}$. Thus, we calculate $I_{D 1}$ and $I_{D 2}$ in terms of $V_{i n 1}$ and $V_{i n 2}$, assuming symmetry, saturation of $M_{1}$ and $M_{2}$, and $\\lambda=0$. Since the voltage at node $P$ equals $V_{i n 1}-V_{G S 1}$ and $V_{i n 2}-V_{G S 2}$, we have\n\n$$\nV_{i n 1}-V_{i n 2}=V_{G S 1}-V_{G S 2} \\tag{4.2}\n$$\n\nThe circuit in Fig. 4.12 is a differential pair with two NMOS transistors, M1 and M2, biased by a current source, Iss. Resistors RD1 and RD2 are connected to the drains of M1 and M2, respectively, and the power supply VDD is connected to the top of these resistors. The circuit is designed to amplify the difference between Vin1 and Vin2, producing outputs Vout1 and Vout2.\n\nFor a square-law device, we have\n\n$$\n\\left(V_{G S}-V_{T H}\\right)^{2}=\\frac{I_{D}}{\\frac{1}{2} \\mu_{n} C_{o x} \\frac{W}{L}} \\tag{4.3}\n$$\n\nand, therefore,\n\n$$\nV_{G S}=\\sqrt{\\frac{2 I_{D}}{\\mu_{n} C_{o x} \\frac{W}{L}}}+V_{T H} \\tag{4.4}\n$$\n\nIt follows from (4.2) and (4.4) that\n\n$$\nV_{i n 1}-V_{i n 2}=\\sqrt{\\frac{2 I_{D 1}}{\\mu_{n} C_{o x} \\frac{W}{L}}}-\\sqrt{\\frac{2 I_{D 2}}{\\mu_{n} C_{o x} \\frac{W}{L}}} \\tag{4.5}\n$$\n\nWe wish to calculate the differential output current, $I_{D 1}-I_{D 2}$. Squaring the two sides of (4.5) and recognizing that $I_{D 1}+I_{D 2}=I_{S S}$, we obtain\n\n$$\n\\left(V_{i n 1}-V_{i n 2}\\right)^{2}=\\frac{2}{\\mu_{n} C_{o x} \\frac{W}{L}}\\left(I_{S S}-2 \\sqrt{I_{D 1} I_{D 2}}\\right) \\tag{4.6}\n$$\n\nThat is,\n\n$$\n\\frac{1}{2} \\mu_{n} C_{o x} \\frac{W}{L}\\left(V_{i n 1}-V_{i n 2}\\right)^{2}-I_{S S}=-2 \\sqrt{I_{D 1} I_{D 2}} \\tag{4.7}\n$$\n\nSquaring the two sides again and noting that $4 I_{D 1} I_{D 2}=\\left(I_{D 1}+I_{D 2}\\right)^{2}-\\left(I_{D 1}-I_{D 2}\\right)^{2}=I_{S S}^{2}-\\left(I_{D 1}-I_{D 2}\\right)^{2}$, we arrive at\n\n$$\n\\left(I_{D 1}-I_{D 2}\\right)^{2}=-\\frac{1}{4}\\left(\\mu_{n} C_{o x} \\frac{W}{L}\\right)^{2}\\left(V_{i n 1}-V_{i n 2}\\right)^{4}+I_{S S} \\mu_{n} C_{o x} \\frac{W}{L}\\left(V_{i n 1}-V_{i n 2}\\right)^{2} \\tag{4.8}\n$$\n\nThus,\n\n$$\n\\begin{align*}\nI_{D 1}-I_{D 2} & =\\frac{1}{2} \\mu_{n} C_{o x} \\frac{W}{L}\\left(V_{i n 1}-V_{i n 2}\\right) \\sqrt{\\frac{4 I_{S S}}{\\mu_{n} C_{o x} \\frac{W}{L}}-\\left(V_{i n 1}-V_{i n 2}\\right)^{2}}  \\tag{4.9}\\\\\n& =\\sqrt{\\mu_{n} C_{o x} \\frac{W}{L} I_{S S}\\left(V_{i n 1}-V_{i n 2}\\right) \\sqrt{1-\\frac{\\mu_{n} C_{o x}(W / L)}{4 I_{S S}}\\left(V_{i n 1}-V_{i n 2}\\right)^{2}}} \\tag{4.10}\n\\end{align*}\n$$\n\nWe can say that $M_{1}, M_{2}$, and the tail operate as a voltage-dependent current source producing $I_{D 1}-I_{D 2}$ according to the above large-signal characteristics. As expected, $I_{D 1}-I_{D 2}$ is an odd function of $V_{i n 1}-V_{i n 2}$, falling to zero for $V_{i n 1}=V_{i n 2}$. As $\\left|V_{i n 1}-V_{i n 2}\\right|$ increases from zero, $\\left|I_{D 1}-I_{D 2}\\right|$ increases because the factor preceding the square root rises more rapidly than the argument in the square root drops.\n\nBefore examining (4.9) further, it is instructive to calculate the slope of the characteristic, i.e., the equivalent $G_{m}$ of $M_{1}$ and $M_{2}$. Denoting the differential quantities $I_{D 1}-I_{D 2}$ and $V_{i n 1}-V_{i n 2}$ by $\\Delta I_{D}$ and $\\Delta V_{i n}$, respectively, the reader can show that\n\n$$\n\\frac{\\partial \\Delta I_{D}}{\\partial \\Delta V_{i n}}=\\frac{1}{2} \\mu_{n} C_{o x} \\frac{W}{L} \\frac{\\frac{4 I_{S S}}{\\mu_{n} C_{o x} W / L}-2 \\Delta V_{i n}^{2}}{\\sqrt{\\frac{4 I_{S S}}{\\mu_{n} C_{o x} W / L}-\\Delta V_{i n}^{2}}} \\tag{4.11}\n$$\n\nFor $\\Delta V_{i n}=0, G_{m}$ is maximum (why?) and equal to $\\sqrt{\\mu_{n} C_{o x}(W / L) I_{S S}}$. Moreover, since $V_{\\text {out } 1}-V_{\\text {out } 2}=$ $R_{D} \\Delta I=-R_{D} G_{m} \\Delta V_{i n}$, we can write the small-signal differential voltage gain of the circuit in the equilibrium condition as\n\n$$\n\\left|A_{v}\\right|=\\sqrt{\\mu_{n} C_{o x} \\frac{W}{L} I_{S S}} R_{D} \\tag{4.12}\n$$\n\nSince each transistor carries a bias current of $I_{S S} / 2$ in this condition, the factor $\\sqrt{\\mu_{m} C_{o x}(W / L) I_{S S}}$ is in fact the same as the transconductance of each device, that is, $\\left|A_{v}\\right|=g_{m} R_{D}$. Equation (4.11) also suggests that $G_{m}$ falls to zero for $\\Delta V_{i n}=\\sqrt{2 I_{S S} /\\left(\\mu_{n} C_{o x} W / L\\right)}$. As we will see below, this value of $\\Delta V_{i n}$ plays an important role in the operation of the circuit.\n\nLet us now examine Eq. (4.9) more closely. If $\\left(V_{i n 1}-V_{i n 2}\\right)^{2} \\ll 4 I_{S S} /\\left[\\mu_{n} C_{o x}(W / L)\\right]$, then\n\n$$\nI_{D 1}-I_{D 2}=\\sqrt{\\mu_{n} C_{o x} \\frac{W}{L} I_{S S}}\\left(V_{i n 1}-V_{i n 2}\\right) \\tag{4.13}\n$$\n\nwhich yields the same equilibrium $G_{m}$ as that obtained above. But what happens for larger values of $\\left|V_{i n 1}-V_{i n 2}\\right|$ ? It appears that the argument in the square root drops to zero for $\\Delta V_{i n}=\\sqrt{4 I_{S S} /\\left(\\mu_{n} C_{o x} W / L\\right)}$ and $\\Delta I_{D}$ crosses zero at two different values of $\\Delta V_{i n}$, an effect not predicted by our qualitative analysis in Fig. 4.8. This conclusion, however, is incorrect. To understand why, recall that (4.9) was derived with the assumption that both $M_{1}$ and $M_{2}$ are on. In reality, as $\\Delta V_{i n}$ exceeds a limit, one transistor carries the entire $I_{S S}$, turning off the other. Denoting this value by $\\Delta V_{i n 1}$, we have $I_{D 1}=I_{S S}$ and $\\Delta V_{i n 1}=V_{G S 1}-V_{T H}$ because $M_{2}$ is nearly off. It follows that\n\n$$\n\\Delta V_{i n 1}=\\sqrt{\\frac{2 I_{S S}}{\\mu_{n} C_{o x} \\frac{W}{L}}} \\tag{4.14}\n$$\n\nFor $\\Delta V_{i n}>\\Delta V_{i n 1}, M_{2}$ is off and (4.9) and (4.10) do not hold. As mentioned above, $G_{m}$ falls to zero for $\\Delta V_{i n}=\\Delta V_{i n 1}$. Figure 4.13 plots the behavior.\n\n#### Example 4.4\n\nPlot the output currents of a differential pair versus $\\Delta V_{i n}$ as the device width and the tail current vary.\n\n#### Solution\n\nConsider the characteristic shown in Fig. 4.14(a). As $W / L$ increases, $\\Delta V_{i n 1}$ decreases, narrowing the input range across which both devices are on [Fig. 4.14(b)]. As $I_{S S}$ increases, both the input range and the output current swing increase [Fig. 4.14(c)]. Intuitively, we expect the circuit to become more linear as $I_{S S}$ increases or $W / L$ decreases.\n\nFigure 4.13 plots the variation of drain currents and overall transconductance of a differential pair versus input voltage.\n\n#### Example 4.5\n\nDue to a manufacturing defect, the differential signals applied to a differential pair have unequal dc levels (Fig. 4.15). If the peak swing, $V_{0}$, is small and the imbalance, $V_{O S}$, happens to be equal to $\\Delta V_{i n 1} / 2=(1 / 2) \\sqrt{2 I_{S S} /\\left(\\mu_{n} C_{o x} W / L\\right)}$, sketch the output voltage waveforms and determine the small-signal voltage gain.\n\n#### Solution\n\nLet us first study the circuit with only dc inputs that differ by $V_{O S}$. The differential pair senses an imbalance of $V_{i n 1}-V_{i n 2}=V_{O S}$ and, from Eq. (4.10), generates\n\n$$\nI_{D 1}-I_{D 2}=\\frac{\\sqrt{7}}{4} I_{S S} \\tag{4.16}\n$$\n\nThat is, $I_{D 1} \\approx 0.83 I_{S S}, I_{D 2} \\approx 0.17 I_{S S}$ and $V_{X}-V_{Y}=-(\\sqrt{7} / 4) I_{S S} R_{D}$.\nNow, we recognize from Fig. 4.15(b) that the input dc imbalance biases the transistors away from the highest transconductance, yielding from Eq. (4.11)\n\n$$\nG_{m 1}=\\frac{3}{\\sqrt{14}} \\sqrt{\\mu_{n} C_{o x} \\frac{W}{L} I_{S S}} \\tag{4.17}\n$$\n\nThis value is about 20\\% less than that at equilibrium. The output waveforms are shown in Fig. 4.15(c).\n\nSmall-Signal Analysis We now study the small-signal behavior of differential pairs. As depicted in Fig. 4.16, we apply small signals $V_{i n 1}$ and $V_{i n 2}$ and assume that $M_{1}$ and $M_{2}$ are saturated. What is the differential voltage gain, $\\left(V_{\\text {out } 1}-V_{\\text {out } 2}\\right) /\\left(V_{\\text {in1 }}-V_{\\text {in2 }}\\right)$ ? Recall from Eq. (4.12) that this quantity equals $\\sqrt{\\mu_{n} C_{o x} I_{S S} W / L} R_{D}$. Since in the vicinity of equilibrium, each transistor carries approximately $I_{S S} / 2$, this expression reduces to $g_{m} R_{D}$, where $g_{m}$ denotes the transconductance of $M_{1}$ and $M_{2}$. To arrive at the same result by small-signal analysis, we employ two different methods, each providing insight into the circuits operation. We assume that $R_{D 1}=R_{D 2}=R_{D}$.\n\nMethod I The circuit of Fig. 4.16 is driven by two independent signals. Thus, the output can be computed by superposition. (The voltages in this section are small-signal quantities.)\n\nLet us set $V_{i n 2}$ to zero and find the effect of $V_{i n 1}$ at $X$ and $Y$ [Fig. 4.17(a)]. To obtain $V_{X}$, we note that $M_{1}$ forms a common-source stage with a degeneration resistance equal to the impedance seen looking into the source of $M_{2}$ [Fig. 4.17(b)]. Neglecting channel-length modulation and body effect, we have $R_{S}=1 / g_{m 2}[$ Fig. 4.17(c) $]$ and\n\n$$\n\\frac{V_{X}}{V_{i n 1}}=\\frac{-R_{D}}{\\frac{1}{g_{m 1}}+\\frac{1}{g_{m 2}}} \\tag{4.18}\n$$\n\nTo calculate $V_{Y}$, we note that $M_{1}$ drives $M_{2}$ as a source follower and replace $V_{i n 1}$ and $M_{1}$ by a Thevenin equivalent (Fig. 4.18): the Thevenin voltage $V_{T}=V_{i n 1}$ and the resistance $R_{T}=1 / g_{m 1}$. Here, $M_{2}$ operates as a common-gate stage, exhibiting a gain equal to\n\n$$\n\\frac{V_{Y}}{V_{i n 1}}=\\frac{R_{D}}{\\frac{1}{g_{m 2}}+\\frac{1}{g_{m 1}}} \\tag{4.19}\n$$\n\nIt follows from (4.18) and (4.19) that the overall voltage gain for $V_{i n 1}$ is\n\n$$\n\\left.\\left(V_{X}-V_{Y}\\right)\\right|_{\\text {Due to } \\operatorname{Vin} 1}=\\frac{-2 R_{D}}{\\frac{1}{g_{m 1}}+\\frac{1}{g_{m 2}}} V_{i n 1} \\tag{4.20}\n$$\n\nwhich, for $g_{m 1}=g_{m 2}=g_{m}$, reduces to\n\n$$\n\\left.\\left(V_{X}-V_{Y}\\right)\\right|_{\\text {Due to } V i n 1}=-g_{m} R_{D} V_{i n 1} \\tag{4.21}\n$$\n\nBy virtue of symmetry, the effect of $V_{i n 2}$ at $X$ and $Y$ is identical to that of $V_{i n 1}$ except for a"
},
{
    "text": "In this section, we quantify both the large-signal and small-signal characteristics of MOS differential pairs. We begin with a large-signal analysis to derive expressions for the plots shown in Fig. 4.8.\n\nLarge-Signal Behavior Consider the differential pair shown in Fig. 4.12. Our objective is to determine the difference between the output voltages, $V_{\\text {out } 1}-V_{\\text {out } 2}$, as a function of the input voltage difference, $V_{\\text {in } 1}-V_{\\text {in } 2}$. We have $V_{\\text {out } 1}=V_{D D}-R_{D 1} I_{D 1}$ and $V_{\\text {out } 2}=V_{D D}-R_{D 2} I_{D 2}$. Therefore, $V_{\\text {out } 1}-V_{\\text {out } 2}=R_{D 2} I_{D 2}-R_{D 1} I_{D 1}=R_{D}(I_{D 2}-I_{D 1})$ if $R_{D 1}=R_{D 2}=R_{D}$. Thus, we simply calculate $I_{D 1}$ and $I_{D 2}$ in terms of $V_{i n 1}$ and $V_{i n 2}$, assuming the circuit is symmetric, $M_{1}$ and $M_{2}$ are saturated, and $\\lambda=0$. Since the voltage at node $P$ is equal to $V_{i n 1}-V_{G S 1}$ and $V_{i n 2}-V_{G S 2}$,\n\n$$\n\\begin{equation*}\nV_{i n 1}-V_{i n 2}=V_{G S 1}-V_{G S 2} \\tag{4.2}\n\\end{equation*}\n$$\n\nThis is a differential pair circuit with two NMOS transistors M1 and M2. The current source Iss provides the bias current. The resistors RD1 and RD2 are connected to the drains of M1 and M2, respectively, and the power supply VDD is connected to the top of these resistors. The circuit is designed to amplify the difference between Vin1 and Vin2, producing outputs Vout1 and Vout2.\n\nFor a square-law device, we have\n\n$$\n\\begin{equation*}\n\\left(V_{G S}-V_{T H}\\right)^{2}=\\frac{I_{D}}{\\frac{1}{2} \\mu_{n} C_{o x} \\frac{W}{L}} \\tag{4.3}\n\\end{equation*}\n$$\n\nand, therefore,\n\n$$\n\\begin{equation*}\nV_{G S}=\\sqrt{\\frac{2 I_{D}}{\\mu_{n} C_{o x} \\frac{W}{L}}}+V_{T H} \\tag{4.4}\n\\end{equation*}\n$$\n\nIt follows from (4.2) and (4.4) that\n\n$$\n\\begin{equation*}\nV_{i n 1}-V_{i n 2}=\\sqrt{\\frac{2 I_{D 1}}{\\mu_{n} C_{o x} \\frac{W}{L}}}-\\sqrt{\\frac{2 I_{D 2}}{\\mu_{n} C_{o x} \\frac{W}{L}}} \\tag{4.5}\n\\end{equation*}\n$$\n\nWe wish to calculate the differential output current, $I_{D 1}-I_{D 2}$. Squaring the two sides of (4.5) and recognizing that $I_{D 1}+I_{D 2}=I_{S S}$, we obtain\n\n$$\n\\begin{equation*}\n\\left(V_{i n 1}-V_{i n 2}\\right)^{2}=\\frac{2}{\\mu_{n} C_{o x} \\frac{W}{L}}\\left(I_{S S}-2 \\sqrt{I_{D 1} I_{D 2}}\\right) \\tag{4.6}\n\\end{equation*}\n$$\n\nThat is,\n\n$$\n\\begin{equation*}\n\\frac{1}{2} \\mu_{n} C_{o x} \\frac{W}{L}\\left(V_{i n 1}-V_{i n 2}\\right)^{2}-I_{S S}=-2 \\sqrt{I_{D 1} I_{D 2}} \\tag{4.7}\n\\end{equation*}\n$$\n\nSquaring the two sides again and noting that $4 I_{D 1} I_{D 2}=\\left(I_{D 1}+I_{D 2}\\right)^{2}-\\left(I_{D 1}-I_{D 2}\\right)^{2}=I_{S S}^{2}-\\left(I_{D 1}-I_{D 2}\\right)^{2}$, we arrive at\n\n$$\n\\begin{equation*}\n\\left(I_{D 1}-I_{D 2}\\right)^{2}=-\\frac{1}{4}\\left(\\mu_{n} C_{o x} \\frac{W}{L}\\right)^{2}\\left(V_{i n 1}-V_{i n 2}\\right)^{4}+I_{S S} \\mu_{n} C_{o x} \\frac{W}{L}\\left(V_{i n 1}-V_{i n 2}\\right)^{2} \\tag{4.8}\n\\end{equation*}\n$$\n\nThus,\n\n$$\n\\begin{align*}\nI_{D 1}-I_{D 2} & =\\frac{1}{2} \\mu_{n} C_{o x} \\frac{W}{L}\\left(V_{i n 1}-V_{i n 2}\\right) \\sqrt{\\frac{4 I_{S S}}{\\mu_{n} C_{o x} \\frac{W}{L}}-\\left(V_{i n 1}-V_{i n 2}\\right)^{2}}  \\tag{4.9}\\\\\n& =\\sqrt{\\mu_{n} C_{o x} \\frac{W}{L} I_{S S}\\left(V_{i n 1}-V_{i n 2}\\right) \\sqrt{1-\\frac{\\mu_{n} C_{o x}(W / L)}{4 I_{S S}}\\left(V_{i n 1}-V_{i n 2}\\right)^{2}}} \\tag{4.10}\n\\end{align*}\n$$\n\nWe can say that $M_{1}, M_{2}$, and the tail operate as a voltage-dependent current source producing $I_{D 1}-I_{D 2}$ according to the above large-signal characteristics. As expected, $I_{D 1}-I_{D 2}$ is an odd function of $V_{i n 1}-V_{i n 2}$, falling to zero for $V_{i n 1}=V_{i n 2}$. As $\\left|V_{i n 1}-V_{i n 2}\\right|$ increases from zero, $\\left|I_{D 1}-I_{D 2}\\right|$ increases because the factor preceding the square root rises more rapidly than the argument in the square root drops. ${ }^{4}$\n\nBefore examining (4.9) further, it is instructive to calculate the slope of the characteristic, i.e., the equivalent $G_{m}$ of $M_{1}$ and $M_{2}$. Denoting the differential quantities $I_{D 1}-I_{D 2}$ and $V_{i n 1}-V_{i n 2}$ by $\\Delta I_{D}$ and $\\Delta V_{i n}$, respectively, the reader can show that\n\n$$\n\\begin{equation*}\n\\frac{\\partial \\Delta I_{D}}{\\partial \\Delta V_{i n}}=\\frac{1}{2} \\mu_{n} C_{o x} \\frac{W}{L} \\frac{\\frac{4 I_{S S}}{\\mu_{n} C_{o x} W / L}-2 \\Delta V_{i n}^{2}}{\\sqrt{\\frac{4 I_{S S}}{\\mu_{n} C_{o x} W / L}-\\Delta V_{i n}^{2}}} \\tag{4.11}\n\\end{equation*}\n$$\n\nFor $\\Delta V_{i n}=0, G_{m}$ is maximum (why?) and equal to $\\sqrt{\\mu_{n} C_{o x}(W / L) I_{S S}}$. Moreover, since $V_{\\text {out } 1}-V_{\\text {out } 2}=R_{D} \\Delta I=-R_{D} G_{m} \\Delta V_{i n}$, we can write the small-signal differential voltage gain of the circuit in the equilibrium condition as\n\n$$\n\\begin{equation*}\n\\left|A_{v}\\right|=\\sqrt{\\mu_{n} C_{o x} \\frac{W}{L} I_{S S}} R_{D} \\tag{4.12}\n\\end{equation*}\n$$\n\nSince each transistor carries a bias current of $I_{S S} / 2$ in this condition, the factor $\\sqrt{\\mu_{m} C_{o x}(W / L) I_{S S}}$ is in fact the same as the transconductance of each device, that is, $\\left|A_{v}\\right|=g_{m} R_{D}$. Equation (4.11) also suggests that $G_{m}$ falls to zero for $\\Delta V_{i n}=\\sqrt{2 I_{S S} /\\left(\\mu_{n} C_{o x} W / L\\right)}$. As we will see below, this value of $\\Delta V_{i n}$ plays an important role in the operation of the circuit.\n\nLet us now examine Eq. (4.9) more closely. If $\\left(V_{i n 1}-V_{i n 2}\\right)^{2} \\ll 4 I_{S S} /\\left[\\mu_{n} C_{o x}(W / L)\\right]$, then\n\n$$\n\\begin{equation*}\nI_{D 1}-I_{D 2}=\\sqrt{\\mu_{n} C_{o x} \\frac{W}{L} I_{S S}}\\left(V_{i n 1}-V_{i n 2}\\right) \\tag{4.13}\n\\end{equation*}\n$$\n\nwhich yields the same equilibrium $G_{m}$ as that obtained above.\nBut what happens for larger values of $\\left|V_{i n 1}-V_{i n 2}\\right|$ ? It appears that the argument in the square root drops to zero for $\\Delta V_{i n}=\\sqrt{4 I_{S S} /\\left(\\mu_{n} C_{o x} W / L\\right)}$ and $\\Delta I_{D}$ crosses zero at two different values of $\\Delta V_{i n}$, an effect not predicted by our qualitative analysis in Fig. 4.8. This conclusion, however, is incorrect. To understand why, recall that (4.9) was derived with the assumption that both $M_{1}$ and $M_{2}$ are on. In reality, as $\\Delta V_{i n}$ exceeds a limit, one transistor carries the entire $I_{S S}$, turning off the other. ${ }^{5}$ Denoting this value by $\\Delta V_{i n 1}$, we have $I_{D 1}=I_{S S}$ and $\\Delta V_{i n 1}=V_{G S 1}-V_{T H}$ because $M_{2}$ is nearly off. It follows that\n\n$$\n\\begin{equation*}\n\\Delta V_{i n 1}=\\sqrt{\\frac{2 I_{S S}}{\\mu_{n} C_{o x} \\frac{W}{L}}} \\tag{4.14}\n\\end{equation*}\n$$\n\nFor $\\Delta V_{i n}>\\Delta V_{i n 1}, M_{2}$ is off and (4.9) and (4.10) do not hold. As mentioned above, $G_{m}$ falls to zero for $\\Delta V_{i n}=\\Delta V_{i n 1}$. Figure 4.13 plots the behavior.\n\n#### Example 4.4\n\nPlot the output currents of a differential pair versus $\\Delta V_{i n}$ as the device width and the tail current vary.\n\n#### Solution\n\nConsider the characteristic shown in Fig. 4.14(a). As $W / L$ increases, $\\Delta V_{i n 1}$ decreases, narrowing the input range across which both devices are on [Fig. 4.14(b)]. As $I_{S S}$ increases, both the input range and the output current swing increase [Fig. 4.14(c)]. Intuitively, we expect the circuit to become more linear as $I_{S S}$ increases or $W / L$ decreases.\n\nThis graph is critical for understanding how the differential pair responds to changes in input voltage, showing the linearity and the range of operation of the circuit.\nThe graph labeled \"(b)\" is a plot of transconductance \\( G_m \\) versus differential input voltage \\( \\Delta V_{in} \\). It is a typical bell-shaped curve, commonly seen in the analysis of differential pairs.\n\nThis graph is a voltage-current characteristic curve, commonly used in analog electronics to depict the behavior of differential pairs.\n\nThe graph exhibits an S-shaped curve, indicating a nonlinear relationship between the input voltage difference and the drain current difference.\nThe graph labeled \"(c)\" is a plot illustrating the variation of the difference in drain currents \\( I_{D1} - I_{D2} \\) of a differential pair versus the input voltage difference \\( \\Delta V_{in} \\). This type of graph is typically used to analyze the behavior of differential pairs in electronic circuits, particularly in the context of analog design.\n\nThe graph labeled \"(a)\" is a plot that illustrates the variation of the difference in drain currents (denoted as \\( I_{D1} - I_{D2} \\)) of a differential pair versus the input voltage \\( \\Delta V_{in} \\).\n\nThe graph labeled \"(b)\" is a plot depicting the difference in drain currents \\( I_{D1} - I_{D2} \\) versus the input voltage difference \\( \\Delta V_{in} \\) for a differential pair.\n\nThe graph labeled \"(c)\" in the provided image is a time-domain waveform graph depicting the output voltages \\(V_X\\) and \\(V_Y\\) over time \\(t\\). This graph is part of a differential pair circuit analysis where the differential signals have unequal DC levels due to a manufacturing defect.\n\nThe value of $\\Delta V_{i n 1}$ given by (4.14) in essence represents the maximum differential input that the circuit can \"handle.\" It is possible to relate $\\Delta V_{i n 1}$ to the overdrive voltage of $M_{1}$ and $M_{2}$ in equilibrium. For a zero differential input, $I_{D 1}=I_{D 2}=I_{S S} / 2$, yielding\n\n$$\n\\begin{equation*}\n\\left(V_{G S}-V_{T H}\\right)_{1,2}=\\sqrt{\\frac{I_{S S}}{\\mu_{n} C_{o x} \\frac{W}{L}}} \\tag{4.15}\n\\end{equation*}\n$$\n\nThus, $\\Delta V_{i n 1}$ is equal to $\\sqrt{2}$ times the equilibrium overdrive. The point is that increasing $\\Delta V_{i n 1}$ to make the circuit more linear inevitably increases the overdrive voltage of $M_{1}$ and $M_{2}$. For a given $I_{S S}$, this is accomplished only by reducing $W / L$ and hence the transconductance of the transistors, trading small-signal gain for linearity. Alternatively, we can increase $I_{S S}$, but at the cost of power. (What happens to the gain if $I_{S S}$ is increased but $I_{S S} R_{D}$ is kept constant due to headroom constraints?)\n\n#### Example 4.5\n\nDue to a manufacturing defect, the differential signals applied to a differential pair have unequal dc levels (Fig. 4.15). If the peak swing, $V_{0}$, is small and the imbalance, $V_{O S}$, happens to be equal to $\\Delta V_{i n 1} / 2=(1 / 2) \\sqrt{2 I_{S S} /\\left(\\mu_{n} C_{o x} W / L\\right)}$, sketch the output voltage waveforms and determine the small-signal voltage gain.\nThe diagram labeled \"(a)\" illustrates a differential pair circuit with its input and output voltage waveforms.\n\nThe function graph labeled \"(c)\" in the provided image is a time-domain waveform graph depicting the output voltages \\(V_X\\) and \\(V_Y\\) over time \\(t\\). This graph is part of a differential pair circuit analysis where the differential signals have unequal DC levels due to a manufacturing defect.\n\nThis waveform graph effectively illustrates the impact of the DC imbalance \\(V_{OS}\\) on the differential pairs output voltages, highlighting the resulting phase shift and amplitude differences.\n\n#### Solution\n\nLet us first study the circuit with only dc inputs that differ by $V_{O S}$. The differential pair senses an imbalance of $V_{i n 1}-V_{i n 2}=V_{O S}$ and, from Eq. (4.10), generates\n\n$$\n\\begin{equation*}\nI_{D 1}-I_{D 2}=\\frac{\\sqrt{7}}{4} I_{S S} \\tag{4.16}\n\\end{equation*}\n$$\n\nThat is, $I_{D 1} \\approx 0.83 I_{S S}, I_{D 2} \\approx 0.17 I_{S S}$ and $V_{X}-V_{Y}=-(\\sqrt{7} / 4) I_{S S} R_{D}$.\nNow, we recognize from Fig. 4.15(b) that the input dc imbalance biases the transistors away from the highest transconductance, yielding from Eq. (4.11)\n\n$$\n\\begin"
},
{
    "text": "In this section, we analyze both the large-signal and small-signal characteristics of MOS differential pairs. We start by examining the large-signal behavior, which leads to the expressions depicted in Fig. 4.8.\n\nConsider the differential pair illustrated in Fig. 4.12. Our goal is to express the output voltage difference, $V_{\\text {out } 1}-V_{\\text {out } 2}$, as a function of the input voltage difference, $V_{\\text {in } 1}-V_{\\text {in } 2}$. We have $V_{\\text {out } 1}=V_{D D}-R_{D 1} I_{D 1}$ and $V_{\\text {out } 2}=V_{D D}-R_{D 2} I_{D 2}$, resulting in $V_{\\text {out } 1}-V_{\\text {out } 2}=R_{D 2} I_{D 2}-R_{D 1} I_{D 1}=R_{D}(I_{D 2}-I_{D 1})$ when $R_{D 1}=R_{D 2}=R_{D}$. Therefore, we need to calculate $I_{D 1}$ and $I_{D 2}$ in terms of $V_{i n 1}$ and $V_{i n 2}$, assuming the circuit is symmetric, $M_{1}$ and $M_{2}$ are in saturation, and $\\lambda=0$. Since the voltage at node $P$ is equal to $V_{i n 1}-V_{G S 1}$ and $V_{i n 2}-V_{G S 2}$,\n\n$$\n\\begin{equation*}\nV_{i n 1}-V_{i n 2}=V_{G S 1}-V_{G S 2} \\tag{4.2}\n\\end{equation*}\n$$\n\nThe provided text contains detailed descriptions of the differential pair circuit, including the components and their connections. The circuit consists of two NMOS transistors, M1 and M2, with a current source Iss providing bias current. Resistors RD1 and RD2 are connected to the drains of M1 and M2, respectively, and the power supply VDD is connected to the top of these resistors. The circuit is designed to amplify the difference between Vin1 and Vin2, producing outputs Vout1 and Vout2.\n\nFor a square-law device, we have\n\n$$\n\\begin{equation*}\n\\left(V_{G S}-V_{T H}\\right)^{2}=\\frac{I_{D}}{\\frac{1}{2} \\mu_{n} C_{o x} \\frac{W}{L}} \\tag{4.3}\n\\end{equation*}\n$$\n\nand, therefore,\n\n$$\n\\begin{equation*}\nV_{G S}=\\sqrt{\\frac{2 I_{D}}{\\mu_{n} C_{o x} \\frac{W}{L}}}+V_{T H} \\tag{4.4}\n\\end{equation*}\n$$\n\nIt follows from (4.2) and (4.4) that\n\n$$\n\\begin{equation*}\nV_{i n 1}-V_{i n 2}=\\sqrt{\\frac{2 I_{D 1}}{\\mu_{n} C_{o x} \\frac{W}{L}}}-\\sqrt{\\frac{2 I_{D 2}}{\\mu_{n} C_{o x} \\frac{W}{L}}} \\tag{4.5}\n\\end{equation*}\n$$\n\nWe wish to calculate the differential output current, $I_{D 1}-I_{D 2}$. Squaring the two sides of (4.5) and recognizing that $I_{D 1}+I_{D 2}=I_{S S}$, we obtain\n\n$$\n\\begin{equation*}\n\\left(V_{i n 1}-V_{i n 2}\\right)^{2}=\\frac{2}{\\mu_{n} C_{o x} \\frac{W}{L}}\\left(I_{S S}-2 \\sqrt{I_{D 1} I_{D 2}}\\right) \\tag{4.6}\n\\end{equation*}\n$$\n\nThat is,\n\n$$\n\\begin{equation*}\n\\frac{1}{2} \\mu_{n} C_{o x} \\frac{W}{L}\\left(V_{i n 1}-V_{i n 2}\\right)^{2}-I_{S S}=-2 \\sqrt{I_{D 1} I_{D 2}} \\tag{4.7}\n\\end{equation*}\n$$\n\nSquaring the two sides again and noting that $4 I_{D 1} I_{D 2}=\\left(I_{D 1}+I_{D 2}\\right)^{2}-\\left(I_{D 1}-I_{D 2}\\right)^{2}=I_{S S}^{2}-\\left(I_{D 1}-I_{D 2}\\right)^{2}$, we arrive at\n\n$$\n\\begin{equation*}\n\\left(I_{D 1}-I_{D 2}\\right)^{2}=-\\frac{1}{4}\\left(\\mu_{n} C_{o x} \\frac{W}{L}\\right)^{2}\\left(V_{i n 1}-V_{i n 2}\\right)^{4}+I_{S S} \\mu_{n} C_{o x} \\frac{W}{L}\\left(V_{i n 1}-V_{i n 2}\\right)^{2} \\tag{4.8}\n\\end{equation*}\n$$\n\nThus,\n\n$$\n\\begin{align*}\nI_{D 1}-I_{D 2} & =\\frac{1}{2} \\mu_{n} C_{o x} \\frac{W}{L}\\left(V_{i n 1}-V_{i n 2}\\right) \\sqrt{\\frac{4 I_{S S}}{\\mu_{n} C_{o x} \\frac{W}{L}}-\\left(V_{i n 1}-V_{i n 2}\\right)^{2}}  \\tag{4.9}\\\\\n& =\\sqrt{\\mu_{n} C_{o x} \\frac{W}{L} I_{S S}\\left(V_{i n 1}-V_{i n 2}\\right) \\sqrt{1-\\frac{\\mu_{n} C_{o x}(W / L)}{4 I_{S S}}\\left(V_{i n 1}-V_{i n 2}\\right)^{2}}} \\tag{4.10}\n\\end{align*}\n$$\n\nWe can say that $M_{1}, M_{2}$, and the tail operate as a voltage-dependent current source producing $I_{D 1}-I_{D 2}$ according to the above large-signal characteristics. As expected, $I_{D 1}-I_{D 2}$ is an odd function of $V_{i n 1}-V_{i n 2}$,\nfalling to zero for $V_{i n 1}=V_{i n 2}$. As $\\left|V_{i n 1}-V_{i n 2}\\right|$ increases from zero, $\\left|I_{D 1}-I_{D 2}\\right|$ increases because the factor preceding the square root rises more rapidly than the argument in the square root drops. ${ }^{4}$\n\nBefore examining (4.9) further, it is instructive to calculate the slope of the characteristic, i.e., the equivalent $G_{m}$ of $M_{1}$ and $M_{2}$. Denoting the differential quantities $I_{D 1}-I_{D 2}$ and $V_{i n 1}-V_{i n 2}$ by $\\Delta I_{D}$ and $\\Delta V_{i n}$, respectively, the reader can show that\n\n$$\n\\begin{equation*}\n\\frac{\\partial \\Delta I_{D}}{\\partial \\Delta V_{i n}}=\\frac{1}{2} \\mu_{n} C_{o x} \\frac{W}{L} \\frac{\\frac{4 I_{S S}}{\\mu_{n} C_{o x} W / L}-2 \\Delta V_{i n}^{2}}{\\sqrt{\\frac{4 I_{S S}}{\\mu_{n} C_{o x} W / L}-\\Delta V_{i n}^{2}}} \\tag{4.11}\n\\end{equation*}\n$$\n\nFor $\\Delta V_{i n}=0, G_{m}$ is maximum (why?) and equal to $\\sqrt{\\mu_{n} C_{o x}(W / L) I_{S S}}$. Moreover, since $V_{\\text {out } 1}-V_{\\text {out } 2}=$ $R_{D} \\Delta I=-R_{D} G_{m} \\Delta V_{i n}$, we can write the small-signal differential voltage gain of the circuit in the equilibrium condition as\n\n$$\n\\begin{equation*}\n\\left|A_{v}\\right|=\\sqrt{\\mu_{n} C_{o x} \\frac{W}{L} I_{S S}} R_{D} \\tag{4.12}\n\\end{equation*}\n$$\n\nSince each transistor carries a bias current of $I_{S S} / 2$ in this condition, the factor $\\sqrt{\\mu_{m} C_{o x}(W / L) I_{S S}}$ is in fact the same as the transconductance of each device, that is, $\\left|A_{v}\\right|=g_{m} R_{D}$. Equation (4.11) also suggests that $G_{m}$ falls to zero for $\\Delta V_{i n}=\\sqrt{2 I_{S S} /\\left(\\mu_{n} C_{o x} W / L\\right)}$. As we will see below, this value of $\\Delta V_{i n}$ plays an important role in the operation of the circuit.\n\nLet us now examine Eq. (4.9) more closely. If $\\left(V_{i n 1}-V_{i n 2}\\right)^{2} \\ll 4 I_{S S} /\\left[\\mu_{n} C_{o x}(W / L)\\right]$, then\n\n$$\n\\begin{equation*}\nI_{D 1}-I_{D 2}=\\sqrt{\\mu_{n} C_{o x} \\frac{W}{L} I_{S S}}\\left(V_{i n 1}-V_{i n 2}\\right) \\tag{4.13}\n\\end{equation*}\n$$\n\nwhich yields the same equilibrium $G_{m}$ as that obtained above.\nBut what happens for larger values of $\\left|V_{i n 1}-V_{i n 2}\\right|$ ? It appears that the argument in the square root drops to zero for $\\Delta V_{i n}=\\sqrt{4 I_{S S} /\\left(\\mu_{n} C_{o x} W / L\\right)}$ and $\\Delta I_{D}$ crosses zero at two different values of $\\Delta V_{i n}$, an effect not predicted by our qualitative analysis in Fig. 4.8. This conclusion, however, is incorrect. To understand why, recall that (4.9) was derived with the assumption that both $M_{1}$ and $M_{2}$ are on. In reality, as $\\Delta V_{i n}$ exceeds a limit, one transistor carries the entire $I_{S S}$, turning off the other. ${ }^{5}$ Denoting this value by $\\Delta V_{i n 1}$, we have $I_{D 1}=I_{S S}$ and $\\Delta V_{i n 1}=V_{G S 1}-V_{T H}$ because $M_{2}$ is nearly off. It follows that\n\n$$\n\\begin{equation*}\n\\Delta V_{i n 1}=\\sqrt{\\frac{2 I_{S S}}{\\mu_{n} C_{o x} \\frac{W}{L}}} \\tag{4.14}\n\\end{equation*}\n$$\n\nFor $\\Delta V_{i n}>\\Delta V_{i n 1}, M_{2}$ is off and (4.9) and (4.10) do not hold. As mentioned above, $G_{m}$ falls to zero for $\\Delta V_{i n}=\\Delta V_{i n 1}$. Figure 4.13 plots the behavior.\n\n#### Example 4.4\n\nPlot the output currents of a differential pair versus $\\Delta V_{i n}$ as the device width and the tail current vary.\n\n#### Solution\n\nConsider the characteristic shown in Fig. 4.14(a). As $W / L$ increases, $\\Delta V_{i n 1}$ decreases, narrowing the input range across which both devices are on [Fig. 4.14(b)]. As $I_{S S}$ increases, both the input range and the output current swing increase [Fig. 4.14(c)]. Intuitively, we expect the circuit to become more linear as $I_{S S}$ increases or $W / L$ decreases.\n\nThe provided text contains detailed descriptions of the graphs and their implications. The graphs illustrate the relationship between input voltage and output currents, transconductance, and the overall behavior of the differential pair circuit under varying conditions.\n\nSmall-Signal Analysis We now study the small-signal behavior of differential pairs. As depicted in Fig. 4.16, we apply small signals $V_{i n 1}$ and $V_{i n 2}$ and assume that $M_{1}$ and $M_{2}$ are saturated. What is the differential voltage gain, $\\left(V_{\\text {out } 1}-V_{\\text {out } 2}\\right) /\\left(V_{\\text {in1 }}-V_{\\text {in2 }}\\right)$ ? Recall from Eq. (4.12) that this quantity equals $\\sqrt{\\mu_{n} C_{o x} I_{S S} W / L} R_{D}$. Since in the vicinity of equilibrium, each transistor carries approximately $I_{S S} / 2$, this expression reduces to $g_{m} R_{D}$, where $g_{m}$ denotes the transconductance of $M_{1}$ and $M_{2}$. To arrive at the same result by small-signal analysis, we employ two different methods, each providing insight into the circuits operation. We assume that $R_{D 1}=R_{D 2}=R_{D}$.\n\nThe provided text continues with detailed explanations and derivations of the small-signal behavior of differential pairs using two different methods, including calculations and graphs illustrating the concepts."
},
{
    "text": "This section delves into the analysis of both large-signal and small-signal characteristics of MOS differential pairs. The discussion commences with the large-signal analysis, which leads to the derivation of expressions for the plots depicted in Figure 4.8.\n\nWhen examining the large-signal behavior, we focus on the differential pair illustrated in Figure 4.12. Our aim is to express the output voltage difference, \\( V_{\\text{out }1} - V_{\\text{out }2} \\), as a function of the input voltage difference, \\( V_{\\text{in }1} - V_{\\text{in }2} \\). Given that \\( V_{\\text{out }1} = V_{D D} - R_{D 1} I_{D 1} \\) and \\( V_{\\text{out }2} = V_{D D} - R_{D 2} I_{D 2} \\), it follows that \\( V_{\\text{out }1} - V_{\\text{out }2} = R_{D 2} I_{D 2} - R_{D 1} I_{D 1} = R_{D} (I_{D 2} - I_{D 1}) \\), assuming \\( R_{D 1} = R_{D 2} = R_{D} \\). Therefore, we proceed to calculate \\( I_{D 1} \\) and \\( I_{D 2} \\) in terms of \\( V_{i n 1} \\) and \\( V_{i n 2} \\), under the assumption of a symmetric circuit, saturation of \\( M_1 \\) and \\( M_2 \\), and \\( \\lambda = 0 \\). Since the voltage at node \\( P \\) is equal to \\( V_{i n 1} - V_{G S 1} \\) and \\( V_{i n 2} - V_{G S 2} \\), we arrive at the equation:\n\n\\[ V_{i n 1} - V_{i n 2} = V_{G S 1} - V_{G S 2} \\tag{4.2} \\]\n\nThe image description details a differential pair circuit with two NMOS transistors, \\( M_1 \\) and \\( M_2 \\), a current source \\( I_{S S} \\), and resistors \\( R_{D 1} \\) and \\( R_{D 2} \\), all connected to a power supply \\( V_{D D} \\).\n\nFor a square-law device, the relationship is given by:\n\n\\[ \\left(V_{G S} - V_{T H}\\right)^2 = \\frac{I_{D}}{\\frac{1}{2} \\mu_{n} C_{o x} \\frac{W}{L}} \\tag{4.3} \\]\n\nConsequently,\n\n\\[ V_{G S} = \\sqrt{\\frac{2 I_{D}}{\\mu_{n} C_{o x} \\frac{W}{L}}} + V_{T H} \\tag{4.4} \\]\n\nCombining Equations (4.2) and (4.4) yields:\n\n\\[ V_{i n 1} - V_{i n 2} = \\sqrt{\\frac{2 I_{D 1}}{\\mu_{n} C_{o x} \\frac{W}{L}}} - \\sqrt{\\frac{2 I_{D 2}}{\\mu_{n} C_{o x} \\frac{W}{L}}} \\tag{4.5} \\]\n\nOur goal is to calculate the differential output current, \\( I_{D 1} - I_{D 2} \\). Squaring both sides of Equation (4.5) and acknowledging that \\( I_{D 1} + I_{D 2} = I_{S S} \\), we obtain:\n\n\\[ \\left(V_{i n 1} - V_{i n 2}\\right)^2 = \\frac{2}{\\mu_{n} C_{o x} \\frac{W}{L}} \\left(I_{S S} - 2 \\sqrt{I_{D 1} I_{D 2}}\\right) \\tag{4.6} \\]\n\nThis simplifies to:\n\n\\[ \\frac{1}{2} \\mu_{n} C_{o x} \\frac{W}{L} \\left(V_{i n 1} - V_{i n 2}\\right)^2 - I_{S S} = -2 \\sqrt{I_{D 1} I_{D 2}} \\tag{4.7} \\]\n\nSquaring both sides again and considering that \\( 4 I_{D 1} I_{D 2} = \\left(I_{D 1} + I_{D 2}\\right)^2 - \\left(I_{D 1} - I_{D 2}\\right)^2 = I_{S S}^2 - \\left(I_{D 1} - I_{D 2}\\right)^2 \\), we arrive at:\n\n\\[ \\left(I_{D 1} - I_{D 2}\\right)^2 = -\\frac{1}{4} \\left(\\mu_{n} C_{o x} \\frac{W}{L}\\right)^2 \\left(V_{i n 1} - V_{i n 2}\\right)^4 + I_{S S} \\mu_{n} C_{o x} \\frac{W}{L} \\left(V_{i n 1} - V_{i n 2}\\right)^2 \\tag{4.8} \\]\n\nThus,\n\n\\[ I_{D 1} - I_{D 2} = \\frac{1}{2} \\mu_{n} C_{o x} \\frac{W}{L} \\left(V_{i n 1} - V_{i n 2}\\right) \\sqrt{\\frac{4 I_{S S}}{\\mu_{n} C_{o x} \\frac{W}{L}} - \\left(V_{i n 1} - V_{i n 2}\\right)^2} \\tag{4.9} \\]\n\n\\[ I_{D 1} - I_{D 2} = \\sqrt{\\mu_{n} C_{o x} \\frac{W}{L} I_{S S} \\left(V_{i n 1} - V_{i n 2}\\right) \\sqrt{1 - \\frac{\\mu_{n} C_{o x} (W / L)}{4 I_{S S}} \\left(V_{i n 1} - V_{i n 2}\\right)^2}} \\tag{4.10} \\]\n\nIt can be stated that \\( M_1 \\), \\( M_2 \\), and the tail operate as a voltage-dependent current source, producing \\( I_{D 1} - I_{D 2} \\) according to the aforementioned large-signal characteristics. As expected, \\( I_{D 1} - I_{D 2} \\) is an odd function of \\( V_{i n 1} - V_{i n 2} \\), dropping to zero when \\( V_{i n 1} = V_{i n 2} \\). As \\( |V_{i n 1} - V_{i n 2}| \\) increases from zero, \\( |I_{D 1} - I_{D 2}| \\) increases because the factor preceding the square root rises more rapidly than the argument within the square root decreases.\n\nBefore delving deeper into Equation (4.9), it is instructive to calculate the slope of the characteristic, i.e., the equivalent \\( G_{m} \\) of \\( M_1 \\) and \\( M_2 \\). Denoting the differential quantities \\( I_{D 1} - I_{D 2} \\) and \\( V_{i n 1} - V_{i n 2} \\) by \\( \\Delta I_{D} \\) and \\( \\Delta V_{i n} \\), respectively, one can demonstrate that:\n\n\\[ \\frac{\\partial \\Delta I_{D}}{\\partial \\Delta V_{i n}} = \\frac{1}{2} \\mu_{n} C_{o x} \\frac{W}{L} \\frac{\\frac{4 I_{S S}}{\\mu_{n} C_{o x} W / L} - 2 \\Delta V_{i n}^2}{\\sqrt{\\frac{4 I_{S S}}{\\mu_{n} C_{o x} W / L} - \\Delta V_{i n}^2}} \\tag{4.11} \\]\n\nFor \\( \\Delta V_{i n} = 0 \\), \\( G_{m} \\) is maximum (why?) and equal to \\( \\sqrt{\\mu_{n} C_{o x} (W / L) I_{S S}} \\). Moreover, since \\( V_{\\text{out }1} - V_{\\text{out }2} = R_{D} \\Delta I = -R_{D} G_{m} \\Delta V_{i n} \\), the small-signal differential voltage gain of the circuit in the equilibrium condition can be expressed as:\n\n\\[ |A_{v}| = \\sqrt{\\mu_{n} C_{o x} \\frac{W}{L} I_{S S}} R_{D} \\tag{4.12} \\]\n\nGiven that each transistor carries a bias current of \\( I_{S S} / 2 \\) in this condition, the factor \\( \\sqrt{\\mu_{m} C_{o x} (W / L) I_{S S}} \\) is indeed the same as the transconductance of each device, meaning \\( |A_{v}| = g_{m} R_{D} \\). Equation (4.11) also suggests that \\( G_{m} \\) falls to zero for \\( \\Delta V_{i n} = \\sqrt{2 I_{S S} / (\\mu_{n} C_{o x} W / L)} \\). This value of \\( \\Delta V_{i n} \\) plays a significant role in the circuit's operation, as we will explore further.\n\nLet us now scrutinize Equation (4.9) more closely. If \\( (V_{i n 1} - V_{i n 2})^2 \\ll 4 I_{S S} / [\\mu_{n} C_{o x} (W / L)] \\), then:\n\n\\[ I_{D 1} - I_{D 2} = \\sqrt{\\mu_{n} C_{o x} \\frac{W}{L} I_{S S}} (V_{i n 1} - V_{i n 2}) \\tag{4.13} \\]\n\nThis yields the same equilibrium \\( G_{m} \\) as previously obtained. However, what transpires for larger values of \\( |V_{i n 1} - V_{i n 2}| \\)? It seems that the argument within the square root approaches zero for \\( \\Delta V_{i n} = \\sqrt{4 I_{S S} / (\\mu_{n} C_{o x} W / L)} \\), and \\( \\Delta I_{D} \\) crosses zero at two distinct \\( \\Delta V_{i n} \\) values, an effect not anticipated by our qualitative analysis in Figure 4.8. This conclusion, however, is erroneous. To comprehend why, recall that Equation (4.9) was derived under the assumption that both \\( M_1 \\) and \\( M_2 \\) are conducting. In reality, as \\( \\Delta V_{i n} \\) surpasses a certain limit, one transistor carries the entire \\( I_{S S} \\), turning off the other. Denoting this limit by \\( \\Delta V_{i n 1} \\), we have \\( I_{D 1} = I_{S S} \\) and \\( \\Delta V_{i n 1} = V_{G S 1} - V_{T H} \\) because \\( M_2 \\) is nearly off. It follows that:\n\n\\[ \\Delta V_{i n 1} = \\sqrt{\\frac{2 I_{S S}}{\\mu_{n} C_{o x} \\frac{W}{L}}} \\tag{4.14} \\]\n\nFor \\( \\Delta V_{i n} > \\Delta V_{i n 1} \\), \\( M_2 \\) is off, and Equations (4.9) and (4.10) no longer hold. As mentioned earlier, \\( G_{m} \\) falls to zero for \\( \\Delta V_{i n} = \\Delta V_{i n 1} \\). Figure 4.13 illustrates this behavior.\n\n#### Example 4.4\n\nPlot the output currents of a differential pair versus \\( \\Delta V_{i n} \\) as the device width and the tail current vary.\n\n#### Solution\n\nConsider the characteristic depicted in Figure 4.14(a). As \\( W / L \\) increases, \\( \\Delta V_{i n 1} \\) decreases, narrowing the input range across which both devices are conducting [Figure 4.14(b)]. As \\( I_{S S} \\) increases, both the input range and the output current swing increase [Figure 4.14(c)]. Intuitively, we anticipate that the circuit will exhibit greater linearity as \\( I_{S S} \\) increases or \\( W / L \\) decreases.\n\nThe provided image descriptions and subsequent text continue with detailed analyses and discussions on various aspects of differential pairs, including the impact of manufacturing defects, small-signal analysis, and the application of the half-circuit concept. The text also includes additional examples and their solutions, further elucidating the behavior and characteristics of differential pairs under different conditions and configurations."
},
{
    "text": "In this section, we explore the characteristics of MOS differential pairs, focusing on both large-signal and small-signal behavior. We start with large-signal analysis to derive expressions for the plots depicted in Fig. 4.8.\n\nConsider the differential pair shown in Fig. 4.12. Our goal is to express the difference between the output voltages, $V_{\\text {out } 1}-V_{\\text {out } 2}$, as a function of the input voltage difference, $V_{\\text {in } 1}-V_{\\text {in } 2}$. We have $V_{\\text {out } 1}=V_{D D}-R_{D 1} I_{D 1}$ and $V_{\\text {out } 2}=V_{D D}-R_{D 2} I_{D 2}$, which leads to $V_{\\text {out } 1}-V_{\\text {out } 2}=R_{D 2} I_{D 2}-R_{D 1} I_{D 1}=R_{D}(I_{D 2}-I_{D 1})$ when $R_{D 1}=R_{D 2}=R_{D}$. Thus, we need to calculate $I_{D 1}$ and $I_{D 2}$ in terms of $V_{i n 1}$ and $V_{i n 2}$, assuming a symmetric circuit with saturated transistors $M_{1}$ and $M_{2}$ and $\\lambda=0$. Since the voltage at node $P$ is equal to $V_{i n 1}-V_{G S 1}$ and $V_{i n 2}-V_{G S 2}$, we have\n\n$$\nV_{i n 1}-V_{i n 2}=V_{G S 1}-V_{G S 2} \\tag{4.2}\n$$\n\nFor a square-law device, we have\n\n$$\n\\left(V_{G S}-V_{T H}\\right)^{2}=\\frac{I_{D}}{\\frac{1}{2} \\mu_{n} C_{o x} \\frac{W}{L}} \\tag{4.3}\n$$\n\nand, therefore,\n\n$$\nV_{G S}=\\sqrt{\\frac{2 I_{D}}{\\mu_{n} C_{o x} \\frac{W}{L}}}+V_{T H} \\tag{4.4}\n$$\n\nIt follows from (4.2) and (4.4) that\n\n$$\nV_{i n 1}-V_{i n 2}=\\sqrt{\\frac{2 I_{D 1}}{\\mu_{n} C_{o x} \\frac{W}{L}}}-\\sqrt{\\frac{2 I_{D 2}}{\\mu_{n} C_{o x} \\frac{W}{L}}} \\tag{4.5}\n$$\n\nWe wish to calculate the differential output current, $I_{D 1}-I_{D 2}$. Squaring the two sides of (4.5) and recognizing that $I_{D 1}+I_{D 2}=I_{S S}$, we obtain\n\n$$\n\\left(V_{i n 1}-V_{i n 2}\\right)^{2}=\\frac{2}{\\mu_{n} C_{o x} \\frac{W}{L}}\\left(I_{S S}-2 \\sqrt{I_{D 1} I_{D 2}}\\right) \\tag{4.6}\n$$\n\nThat is,\n\n$$\n\\frac{1}{2} \\mu_{n} C_{o x} \\frac{W}{L}\\left(V_{i n 1}-V_{i n 2}\\right)^{2}-I_{S S}=-2 \\sqrt{I_{D 1} I_{D 2}} \\tag{4.7}\n$$\n\nSquaring the two sides again and noting that $4 I_{D 1} I_{D 2}=\\left(I_{D 1}+I_{D 2}\\right)^{2}-\\left(I_{D 1}-I_{D 2}\\right)^{2}=I_{S S}^{2}-\\left(I_{D 1}-I_{D 2}\\right)^{2}$, we arrive at\n\n$$\n\\left(I_{D 1}-I_{D 2}\\right)^{2}=-\\frac{1}{4}\\left(\\mu_{n} C_{o x} \\frac{W}{L}\\right)^{2}\\left(V_{i n 1}-V_{i n 2}\\right)^{4}+I_{S S} \\mu_{n} C_{o x} \\frac{W}{L}\\left(V_{i n 1}-V_{i n 2}\\right)^{2} \\tag{4.8}\n$$\n\nThus,\n\n$$\n\\begin{align*}\nI_{D 1}-I_{D 2} & =\\frac{1}{2} \\mu_{n} C_{o x} \\frac{W}{L}\\left(V_{i n 1}-V_{i n 2}\\right) \\sqrt{\\frac{4 I_{S S}}{\\mu_{n} C_{o x} \\frac{W}{L}}-\\left(V_{i n 1}-V_{i n 2}\\right)^{2}}  \\tag{4.9}\\\\\n& =\\sqrt{\\mu_{n} C_{o x} \\frac{W}{L} I_{S S}\\left(V_{i n 1}-V_{i n 2}\\right) \\sqrt{1-\\frac{\\mu_{n} C_{o x}(W / L)}{4 I_{S S}}\\left(V_{i n 1}-V_{i n 2}\\right)^{2}}} \\tag{4.10}\n\\end{align*}\n$$\n\nWe can say that $M_{1}, M_{2}$, and the tail operate as a voltage-dependent current source producing $I_{D 1}-I_{D 2}$ according to the above large-signal characteristics. As expected, $I_{D 1}-I_{D 2}$ is an odd function of $V_{i n 1}-V_{i n 2}$, falling to zero for $V_{i n 1}=V_{i n 2}$. As $\\left|V_{i n 1}-V_{i n 2}\\right|$ increases from zero, $\\left|I_{D 1}-I_{D 2}\\right|$ increases because the factor preceding the square root rises more rapidly than the argument in the square root drops.\n\nBefore examining (4.9) further, it is instructive to calculate the slope of the characteristic, i.e., the equivalent $G_{m}$ of $M_{1}$ and $M_{2}$. Denoting the differential quantities $I_{D 1}-I_{D 2}$ and $V_{i n 1}-V_{i n 2}$ by $\\Delta I_{D}$ and $\\Delta V_{i n}$, respectively, the reader can show that\n\n$$\n\\frac{\\partial \\Delta I_{D}}{\\partial \\Delta V_{i n}}=\\frac{1}{2} \\mu_{n} C_{o x} \\frac{W}{L} \\frac{\\frac{4 I_{S S}}{\\mu_{n} C_{o x} W / L}-2 \\Delta V_{i n}^{2}}{\\sqrt{\\frac{4 I_{S S}}{\\mu_{n} C_{o x} W / L}-\\Delta V_{i n}^{2}}} \\tag{4.11}\n$$\n\nFor $\\Delta V_{i n}=0, G_{m}$ is maximum (why?) and equal to $\\sqrt{\\mu_{n} C_{o x}(W / L) I_{S S}}$. Moreover, since $V_{\\text {out } 1}-V_{\\text {out } 2}=R_{D} \\Delta I=-R_{D} G_{m} \\Delta V_{i n}$, we can write the small-signal differential voltage gain of the circuit in the equilibrium condition as\n\n$$\n\\left|A_{v}\\right|=\\sqrt{\\mu_{n} C_{o x} \\frac{W}{L} I_{S S}} R_{D} \\tag{4.12}\n$$\n\nSince each transistor carries a bias current of $I_{S S} / 2$ in this condition, the factor $\\sqrt{\\mu_{m} C_{o x}(W / L) I_{S S}}$ is in fact the same as the transconductance of each device, that is, $\\left|A_{v}\\right|=g_{m} R_{D}$. Equation (4.11) also suggests that $G_{m}$ falls to zero for $\\Delta V_{i n}=\\sqrt{2 I_{S S} /\\left(\\mu_{n} C_{o x} W / L\\right)}$. As we will see below, this value of $\\Delta V_{i n}$ plays an important role in the operation of the circuit.\n\nLet us now examine Eq. (4.9) more closely. If $\\left(V_{i n 1}-V_{i n 2}\\right)^{2} \\ll 4 I_{S S} /\\left[\\mu_{n} C_{o x}(W / L)\\right]$, then\n\n$$\nI_{D 1}-I_{D 2}=\\sqrt{\\mu_{n} C_{o x} \\frac{W}{L} I_{S S}}\\left(V_{i n 1}-V_{i n 2}\\right) \\tag{4.13}\n$$\n\nwhich yields the same equilibrium $G_{m}$ as that obtained above. But what happens for larger values of $\\left|V_{i n 1}-V_{i n 2}\\right|$ ? It appears that the argument in the square root drops to zero for $\\Delta V_{i n}=\\sqrt{4 I_{S S} /\\left(\\mu_{n} C_{o x} W / L\\right)}$ and $\\Delta I_{D}$ crosses zero at two different values of $\\Delta V_{i n}$, an effect not predicted by our qualitative analysis in Fig. 4.8. This conclusion, however, is incorrect. To understand why, recall that (4.9) was derived with the assumption that both $M_{1}$ and $M_{2}$ are on. In reality, as $\\Delta V_{i n}$ exceeds a limit, one transistor carries the entire $I_{S S}$, turning off the other. Denoting this value by $\\Delta V_{i n 1}$, we have $I_{D 1}=I_{S S}$ and $\\Delta V_{i n 1}=V_{G S 1}-V_{T H}$ because $M_{2}$ is nearly off. It follows that\n\n$$\n\\Delta V_{i n 1}=\\sqrt{\\frac{2 I_{S S}}{\\mu_{n} C_{o x} \\frac{W}{L}}} \\tag{4.14}\n$$\n\nFor $\\Delta V_{i n}>\\Delta V_{i n 1}, M_{2}$ is off and (4.9) and (4.10) do not hold. As mentioned above, $G_{m}$ falls to zero for $\\Delta V_{i n}=\\Delta V_{i n 1}$. Figure 4.13 plots the behavior.\n\nConsider the characteristic shown in Fig. 4.14(a). As $W / L$ increases, $\\Delta V_{i n 1}$ decreases, narrowing the input range across which both devices are on [Fig. 4.14(b)]. As $I_{S S}$ increases, both the input range and the output current swing increase [Fig. 4.14(c)]. Intuitively, we expect the circuit to become more linear as $I_{S S}$ increases or $W / L$ decreases.\n\nThe value of $\\Delta V_{i n 1}$ given by (4.14) in essence represents the maximum differential input that the circuit can \"handle.\" It is possible to relate $\\Delta V_{i n 1}$ to the overdrive voltage of $M_{1}$ and $M_{2}$ in equilibrium. For a zero differential input, $I_{D 1}=I_{D 2}=I_{S S} / 2$, yielding\n\n$$\n\\left(V_{G S}-V_{T H}\\right)_{1,2}=\\sqrt{\\frac{I_{S S}}{\\mu_{n} C_{o x} \\frac{W}{L}}} \\tag{4.15}\n$$\n\nThus, $\\Delta V_{i n 1}$ is equal to $\\sqrt{2}$ times the equilibrium overdrive. The point is that increasing $\\Delta V_{i n 1}$ to make the circuit more linear inevitably increases the overdrive voltage of $M_{1}$ and $M_{2}$. For a given $I_{S S}$, this is accomplished only by reducing $W / L$ and hence the transconductance of the transistors, trading small-signal gain for linearity. Alternatively, we can increase $I_{S S}$, but at the cost of power. (What happens to the gain if $I_{S S}$ is increased but $I_{S S} R_{D}$ is kept constant due to headroom constraints?)\n\nDue to a manufacturing defect, the differential signals applied to a differential pair have unequal dc levels (Fig. 4.15). If the peak swing, $V_{0}$, is small and the imbalance, $V_{O S}$, happens to be equal to $\\Delta V_{i n 1} / 2=(1 / 2) \\sqrt{2 I_{S S} /\\left(\\mu_{n} C_{o x} W / L\\right)}$, sketch the output voltage waveforms and determine the small-signal voltage gain.\n\nLet us first study the circuit with only dc inputs that differ by $V_{O S}$. The differential pair senses an imbalance of $V_{i n 1}-V_{i n 2}=V_{O S}$ and, from Eq. (4.10), generates\n\n$$\nI_{D 1}-I_{D 2}=\\frac{\\sqrt{7}}{4} I_{S S} \\tag{4.16}\n$$\n\nThat is, $I_{D 1} \\approx 0.83 I_{S S}, I_{D 2} \\approx 0.17 I_{S S}$ and $V_{X}-V_{Y}=-(\\sqrt{7} / 4) I_{S S} R_{D}$.\nNow, we recognize from Fig. 4.15(b) that the input dc imbalance biases the transistors away from the highest transconductance, yielding from Eq. (4.11)\n\n$$\nG_{m 1}=\\frac{3}{\\sqrt{14}} \\sqrt{\\mu_{n} C_{o x} \\frac{W}{L} I_{S S}} \\tag{4.17}\n$$\n\nThis value is about 20\\% less than that at equilibrium. The output waveforms are shown in Fig. 4.15(c).\n\nSmall-Signal Analysis We now study the small-signal behavior of differential pairs. As depicted in Fig. 4.16, we apply small signals $V_{i n 1}$ and $V_{i n 2}$ and assume that $M_{1}$ and $M_{2}$ are saturated. What is the differential voltage gain, $\\left(V_{\\text {out } 1}-V_{\\text {out } 2}\\right) /\\left(V_{\\text {in1 }}-V_{\\text {in2 }}\\right)$ ? Recall from Eq. (4.12) that this quantity equals $\\sqrt{\\mu_{n} C_{o x} I_{S S} W / L} R_{D}$. Since in the vicinity of equilibrium, each transistor carries approximately $I_{S S} / 2$, this expression reduces to $g_{m} R_{D}$, where $g_{m}$ denotes the transconductance of $M_{1}$ and $M_{2}$. To arrive at the same result by small-signal analysis, we employ two different methods, each providing insight into the circuits operation. We assume that $R_{D 1}=R_{D 2}=R_{D}$.\n\nLet us set $V_{i n 2}$ to zero and find the effect of $V_{i n 1}$ at $X$ and $Y$ [Fig. 4.17(a)]. To obtain $V_{X}$, we note that $M_{1}$ forms a common-source stage with a degeneration resistance equal to the impedance seen looking into the source of $M_{2}$ [Fig. 4.17(b)]. Neglecting channel-length modulation and body effect, we have $R_{S}=1 / g_{m 2}[$ Fig. 4.17(c) $]$ and\n\n$$\n\\frac{V_{X}}{V_{i n 1}}=\\frac{-R_{D}}{\\frac{1}{g_{m 1}}+\\frac{1}{g_{m 2}}} \\tag{4.18}\n$$\n\nTo calculate $V_{Y}$, we note that $M_{1}$ drives $M_{2}$ as a source follower and replace $V_{i n 1}$ and $M_{1}$ by a Thevenin equivalent (Fig. 4.18): the Thevenin voltage $V_{T}=V_{i n 1}$ and the resistance $R_{T}=1 / g_{m 1}$. Here, $M_{2}$ operates as a common-gate stage, exhibiting a gain equal to\n\n$$\n\\frac{V_{Y}}{V_{i n 1}}=\\frac{R_{D}}{\\frac{1}{g_{m 2}}+\\frac{1}{g_{m 1}}} \\tag{4.19}\n$$\n\nIt follows from (4.18) and (4.19) that the overall voltage gain for $V_{i n 1}$ is\n\n$$\n\\left.\\left(V_{X}-V_{Y}\\right)\\right|_{\\text {Due to } \\operatorname{Vin} 1}=\\frac{-2 R_{D}}{\\frac{1}{g_{m 1}}+\\frac{1}{g_{m 2}}} V_{i n 1} \\tag{4.20}\n$$\n\nwhich"
},
{
    "text": "In this section, we delve into both analysis of both large-signal and small-signal characteristics of MOS differential pairs. The large-signal analysis commences with the derivation of expressions corresponding to the plots depicted in Fig. 4.8.\n\nWhen we focus on the large-signal behavior, we take into consideration the differential pair illustrated in Fig. 4.12, aiming to derive\nI'm sorry, but I seem to have missed the rephrased text for the passage\nCertainly, let me provide you with the rephrased text:\n\n---\n\nIn this section, we quantify both the large-signal and small-signal characteristics of MOS differential pairs. Our exploration begins with a large-signal analysis to derive expressions for the plots depicted in Fig. 4.8.\n\nConsidering the large-signal behavior, we examine the differential pair shown in Fig. 4.12, with the goal of determining the difference in output voltages, \\(V_{\\text{out } 1}-V_{\\text{out } 2}\\), as a function of the difference in input voltages, \\(V_{\\text{in } 1}-V_{\\text{in } 2}\\). We have \\(V_{\\text{out } 1}=V_{D D}-R_{D 1} I_{D 1}\\) and \\(V_{\\text{out } 2}=V_{D D}-R_{D 2} I_{D 2}\\), which implies \\(V_{\\text{out } 1}-V_{\\text{out } 2}=R_{D 2} I_{D 2}-R_{D 1} I_{D 1}=R_{D}(I_{D 2}-I_{D 1})\\) when \\(R_{D 1}=R_{D 2}=R_{D}\\). Thus, we need to calculate \\(I_{D 1}\\) and \\(I_{D 2}\\) in terms of \\(V_{i n 1}\\) and \\(V_{i n 2}\\), assuming symmetry in the circuit, saturation of \\(M_{1}\\) and \\(M_{2}\\), and \\(\\lambda=0\\). Since the voltage at node \\(P\\) is equal to \\(V_{i n 1}-V_{G S 1}\\) and \\(V_{i n 2}-V_{G S 2}\\),\n\n$$\n\\begin{equation*}\nV_{i n 1}-V_{i n 2}=V_{G S 1}-V_{G S 2} \\tag{4.2}\n\\end{equation*}\n$$\n\nThe description of the image \"Figure 4.12 Differential pair\" indicates a circuit with two NMOS transistors \\(M1\\) and \\(M2\\), resistors \\(RD1\\) and \\(RD2\\), a current source \\(Iss\\), and a voltage source \\(VDD\\). The circuit is designed to amplify the difference between \\(Vin1\\) and \\(Vin2\\), resulting in outputs \\(Vout1\\) and \\(Vout2\\).\n\nFor a square-law device, we have\n\n$$\n\\begin{equation*}\n\\left(V_{G S}-V_{T H}\\right)^{2}=\\frac{I_{D}}{\\frac{1}{2} \\mu_{n} C_{o x} \\frac{W}{L}} \\tag{4.3}\n\\end{equation*}\n$$\n\nand, consequently,\n\n$$\n\\begin{equation*}\nV_{G S}=\\sqrt{\\frac{2 I_{D}}{\\mu_{n} C_{o x} \\frac{W}{L}}}+V_{T H} \\tag{4.4}\n\\end{equation*}\n$$\n\nFrom (4.2) and (4.4), it follows that\n\n$$\n\\begin{equation*}\nV_{i n 1}-V_{i n 2}=\\sqrt{\\frac{2 I_{D 1}}{\\mu_{n} C_{o x} \\frac{W}{L}}}-\\sqrt{\\frac{2 I_{D 2}}{\\mu_{n} C_{o x} \\frac{W}{L}}} \\tag{4.5}\n\\end{equation*}\n$$\n\nWe aim to calculate the differential output current, \\(I_{D 1}-I_{D 2}\\). Squaring both sides of (4.5) and recognizing that \\(I_{D 1}+I_{D 2}=I_{S S}\\), we obtain\n\n$$\n\\begin{equation*}\n\\left(V_{i n 1}-V_{i n 2}\\right)^{2}=\\frac{2}{\\mu_{n} C_{o x} \\frac{W}{L}}\\left(I_{S S}-2 \\sqrt{I_{D 1} I_{D 2}}\\right) \\tag{4.6}\n\\end{equation*}\n$$\n\nWhich simplifies to\n\n$$\n\\begin{equation*}\n\\frac{1}{2} \\mu_{n} C_{o x} \\frac{W}{L}\\left(V_{i n 1}-V_{i n 2}\\right)^{2}-I_{S S}=-2 \\sqrt{I_{D 1} I_{D 2}} \\tag{4.7}\n\\end{equation*}\n$$\n\nSquaring both sides again and noting that \\(4 I_{D 1} I_{D 2}=\\left(I_{D 1}+I_{D 2}\\right)^{2}-\\left(I_{D 1}-I_{D 2}\\right)^{2}=I_{S S}^{2}-\\left(I_{D 1}-I_{D 2}\\right)^{2}\\), we arrive at\n\n$$\n\\begin{equation*}\n\\left(I_{D 1}-I_{D 2}\\right)^{2}=-\\frac{1}{4}\\left(\\mu_{n} C_{o x} \\frac{W}{L}\\right)^{2}\\left(V_{i n 1}-V_{i n 2}\\right)^{4}+I_{S S} \\mu_{n} C_{o x} \\frac{W}{L}\\left(V_{i n 1}-V_{i n 2}\\right)^{2} \\tag{4.8}\n\\end{equation*}\n$$\n\nThus,\n\n$$\n\\begin{align*}\nI_{D 1}-I_{D 2} & =\\frac{1}{2} \\mu_{n} C_{o x} \\frac{W}{L}\\left(V_{i n 1}-V_{i n 2}\\right) \\sqrt{\\frac{4 I_{S S}}{\\mu_{n} C_{o x} \\frac{W}{L}}-\\left(V_{i n 1}-V_{i n 2}\\right)^{2}}  \\tag{4.9}\\\\\n& =\\sqrt{\\mu_{n} C_{o x} \\frac{W}{L} I_{S S}\\left(V_{i n 1}-V_{i n 2}\\right) \\sqrt{1-\\frac{\\mu_{n} C_{o x}(W / L)}{4 I_{S S}}\\left(V_{i n 1}-V_{i n 2}\\right)^{2}}} \\tag{4.10}\n\\end{align*}\n$$\n\nWe can conclude that \\(M_{1}, M_{2}\\), and the tail operate as a voltage-dependent current source, producing \\(I_{D 1}-I_{D 2}\\) according to the above large-signal characteristics. As expected, \\(I_{D 1}-I_{D 2}\\) is an odd function of \\(V_{i n 1}-V_{i n 2}\\), falling to zero for \\(V_{i n 1}=V_{i n 2}\\). As \\(\\left|V_{i n 1}-V_{i n 2}\\right|\\) increases from zero, \\(\\left|I_{D 1}-I_{D 2}\\right|\\) increases because the factor preceding the square root rises more rapidly than the argument in the square root drops.\n\nBefore delving deeper into (4.9), it is instructive to calculate the slope of the characteristic, i.e., the equivalent \\(G_{m}\\) of \\(M_{1}\\) and \\(M_{2}\\). Denoting the differential quantities \\(I_{D 1}-I_{D 2}\\) and \\(V_{i n 1}-V_{i n 2}\\) by \\(\\Delta I_{D}\\) and \\(\\Delta V_{i n}\\), respectively, the reader can show that\n\n$$\n\\begin{equation*}\n\\frac{\\partial \\Delta I_{D}}{\\partial \\Delta V_{i n}}=\\frac{1}{2} \\mu_{n} C_{o x} \\frac{W}{L} \\frac{\\frac{4 I_{S S}}{\\mu_{n} C_{o x} W / L}-2 \\Delta V_{i n}^{2}}{\\sqrt{\\frac{4 I_{S S}}{\\mu_{n} C_{o x} W / L}-\\Delta V_{i n}^{2}}} \\tag{4.11}\n\\end{equation*}\n$$\n\nFor \\(\\Delta V_{i n}=0\\), \\(G_{m}\\) is maximum (why?) and equal to \\(\\sqrt{\\mu_{n} C_{o x}(W / L) I_{S S}}\\). Moreover, since \\(V_{\\text{out } 1}-V_{\\text{out } 2}=R_{D} \\Delta I=-R_{D} G_{m} \\Delta V_{i n}\\), we can express the small-signal differential voltage gain of the circuit in the equilibrium condition as\n\n$$\n\\begin{equation*}\n\\left|A_{v}\\right|=\\sqrt{\\mu_{n} C_{o x} \\frac{W}{L} I_{S S}} R_{D} \\tag{4.12}\n\\end{equation*}\n$$\n\nSince each transistor carries a bias current of \\(I_{S S} / 2\\) in this condition, the factor \\(\\sqrt{\\mu_{m} C_{o x}(W / L) I_{S S}}\\) is in fact the same as the transconductance of each device, that is, \\(\\left|A_{v}\\right|=g_{m} R_{D}\\). Equation (4.11) also suggests that \\(G_{m}\\) falls to zero for \\(\\Delta V_{i n}=\\sqrt{2 I_{S S} /\\left(\\mu_{n} C_{o x} W / L\\right)}\\). This value of \\(\\Delta V_{i n}\\) plays a significant role in the operation of the circuit.\n\nLet us now examine Eq. (4.9) more closely. If \\(\\left(V_{i n 1}-V_{i n 2}\\right)^{2} \\ll 4 I_{S S} /\\left[\\mu_{n} C_{o x}(W / L)\\right]\\), then\n\n$$\n\\begin{equation*}\nI_{D 1}-I_{D 2}=\\sqrt{\\mu_{n} C_{o x} \\frac{W}{L} I_{S S}}\\left(V_{i n 1}-V_{i n 2}\\right) \\tag{4.13}\n\\end{equation*}\n$$\n\nwhich yields the same equilibrium \\(G_{m}\\) as that obtained above. But what happens for larger values of \\(\\left|V_{i n 1}-V_{i n 2}\\right|\\)? It appears that the argument in the square root drops to zero for \\(\\Delta V_{i n}=\\sqrt{4 I_{S S} /\\left(\\mu_{n} C_{o x} W / L\\right)}\\) and \\(\\Delta I_{D}\\) crosses zero at two different values of \\(\\Delta V_{i n}\\), an effect not predicted by our qualitative analysis in Fig. 4.8. This conclusion, however, is incorrect. To understand why, recall that (4.9) was derived with the assumption that both \\(M_{1}\\) and \\(M_{2}\\) are on. In reality, as \\(\\Delta V_{i n}\\) exceeds a limit, one transistor carries the entire \\(I_{S S}\\), turning off the other. Denoting this value by \\(\\Delta V_{i n 1}\\), we have \\(I_{D 1}=I_{S S}\\) and \\(\\Delta V_{i n 1}=V_{G S 1}-V_{T H}\\) because \\(M_{2}\\) is nearly off. It follows that\n\n$$\n\\begin{equation*}\n\\Delta V_{i n 1}=\\sqrt{\\frac{2 I_{S S}}{\\mu_{n} C_{o x} \\frac{W}{L}}} \\tag{4.14}\n\\end{equation*}\n$$\n\nFor \\(\\Delta V_{i n}>\\Delta V_{i n 1}\\), \\(M_{2}\\) is off and (4.9) and (4.10) do not hold. As mentioned above, \\(G_{m}\\) falls to zero for \\(\\Delta V_{i n}=\\Delta V_{i n 1}\\). Figure 4.13 plots the behavior.\n\n---\n\nThis rephrased text maintains the original meaning and length, with slight adjustments to sentence structure and wording for clarity and flow."
},
{
    "text": "In this part of the text, we delve into both the large-signal and small-signal characteristics of MOS differential pairs. Initially, we focus on the large-signal analysis to derive expressions that correspond to the plots depicted in Figure 4.8.\n\nWe start by considering the large-signal behavior of the differential pair shown in Figure 4.12. Our goal is to determine the voltage difference \\( V_{\\text{out } 1} - V_{\\text{out } 2} \\) as a function of the input voltage difference \\( V_{\\text{in } 1} - V_{\\text{in } 2} \\). We express \\( V_{\\text{out } 1} \\) and \\( V_{\\text{out } 2} \\) in terms of \\( V_{D D} \\), \\( R_{D 1} \\), \\( I_{D 1} \\), \\( R_{D 2} \\), and \\( I_{D 2} \\). Simplifying these expressions, we find that \\( V_{\\text{out } 1} - V_{\\text{out } 2} \\) is equal to \\( R_{D} \\left( I_{D 2} - I_{D 1} \\right) \\), assuming \\( R_{D 1} = R_{D 2} = R_{D} \\). Thus, our task is to calculate \\( I_{D 1} \\) and \\( I_{D 2} \\) in terms of \\( V_{\\text{in } 1} \\) and \\( V_{\\text{in } 2} \\), under the assumption that the circuit is symmetric, \\( M_{1} \\) and \\( M_{2} \\) are in saturation, and \\( \\lambda = 0 \\). Since the voltage at node \\( P \\) is equal to \\( V_{\\text{in } 1} - V_{G S 1} \\) and \\( V_{\\text{in } 2} - V_{G S 2} \\), we derive the equation \\( V_{\\text{in } 1} - V_{\\text{in } 2} = V_{G S 1} - V_{G S 2} \\).\n\nThe text then provides a detailed description of the circuit components, including two NMOS transistors \\( M_{1} \\) and \\( M_{2} \\), resistors \\( R_{D 1} \\) and \\( R_{D 2} \\), a current source \\( I_{S S} \\), and a voltage source \\( V_{D D} \\). The circuit is designed to amplify the difference between \\( V_{\\text{in } 1} \\) and \\( V_{\\text{in } 2} \\), producing outputs \\( V_{\\text{out } 1} \\) and \\( V_{\\text{out } 2} \\).\n\nFor a square-law device, the text derives\nThe this section, we delve into both the large-signal and small-signal characteristics of MOS differential pairs. We, we focus on the large-signal analysis to derive expressions that correspond to the plots depicted in Figure 4.8.\n\nWe start by considering the large-signal behavior of the differential pair shown in Figure 4.12. Our goal is to determine the voltage difference \\( V_{\\text{out } 1} - V_{\\text{out } 2} \\) as a function of the input voltage difference \\( V_{\\text{in } 1} - V_{\\text{in } 2} \\). We express \\( V_{\\text{out } 1} \\) and \\( V_{\\text{out } 2} \\) in terms of \\( V_{D D} \\), \\( R_{D 1} \\), \\( I_{D 1} \\), \\( R_{D 2} \\), and \\( I_{D 2} \\). Simplifying these expressions, we find that \\( V_{\\text{out } 1} - V_{\\text{out } 2} \\) is equal to \\( R_{D} \\left( I_{D 2} - I_{D 1} \\right) \\), assuming \\( R_{D 1} = R_{D 2} = R_{D} \\). Thus, our task is to calculate \\( I_{D 1} \\) and \\( I_{D 2} \\) in terms of \\( V_{\\text{in } 1} \\) and \\( V_{\\text{in } 2} \\), under the assumption that the circuit is symmetric, \\( M_{1} \\) and \\( M_{2} \\) are in saturation, and \\( \\lambda = 0 \\). Since the voltage at node \\( P \\) is equal to \\( V_{\\text{in } 1} - V_{G S 1} \\) and \\( V_{\\text{in } 2} - V_{G S 2} \\), we derive the equation \\( V_{\\text{in } 1} - V_{\\text{in } 2} = V_{G S 1} - V_{G S 2} \\).\n\nThe text then provides a detailed description of the circuit components, including two NMOS transistors \\( M_{1} \\) and \\( M_{2} \\), resistors \\( R_{D 1} \\) and \\( R_{D 2} \\), a current source \\( I_{S S} \\), and a voltage source \\( V_{D D} \\). The circuit is designed to amplify the difference between \\( V_{\\text{in } 1} \\) and \\( V_{\\text{in } 2} \\), producing outputs \\( V_{\\text{out } 1} \\) and \\( V_{\\text{out } 2} \\).\n\nFor a square-law device, the text"
},
{
    "text": "In this section, we assess the significant and subtle attributes of MOS differential pairs. We commence by examining the large-signal performance, leading to the derivation of the equations depicted in Figure 4.8.\n\nLarge-Signal Dynamics Examine the differential pair depicted in Figure 4.12. Our goal is to ascertain the relationship between the output voltages \\(V_{\\text {out } 1}\\) and \\(V_{\\text {out } 2}\\) as they depend on the input voltages \\(V_{\\text {in } 1}\\) and \\(V_{\\text {in } 2}\\). We have \\(V_{\\text {out } 1}=V_{D D}-R_{D 1} I_{D 1}\\) and \\(V_{\\text {out } 2}=V_{D D}-R_{D 2} I_{D 2}\\), implying \\(V_{\\text {out } 1}-V_{\\text {out } 2}=R_{D 2} I_{D 2}-R_{D 1} I_{D 1}=R_{D}\\left(I_{D 2}-I_{D 1}\\right)\\) provided \\(R_{D 1}=R_{D 2}=R_{D}\\). Hence, we can readily compute \\(I_{D 1}\\) and \\(I_{D 2}\\) in terms of \\(V_{i n 1}\\) and \\(V_{i n 2}\\), under the assumption of a symmetrical circuit, saturated transistors \\(M_{1}\\) and \\(M_{2}\\), and \\(\\lambda=0\\). Since the voltage at node \\(P\\) is equal to \\(V_{i n 1}-V_{G S 1}\\) and \\(V_{i n 2}-V_{G S 2}\\),\n\n$$\n\\begin{equation*}\nV_{i n 1}-V_{i n 2}=V_{G S 1}-V_{G S 2} \\tag{4.2}\n\\end{equation*}\n$$\n\nimage_name:Figure 4.12 Differential pair\ndescription:\n[\nname: M1, type: NMOS, ports: {S: P, D: Vout1, G: Vin1}\nname: M2, type: NMOS, ports: {S: P, D: Vout2, G: Vin2}\nname: RD1, type: Resistor, value: RD1, ports: {N1: VDD, N2: Vout1}\nname: RD2, type: Resistor, value: RD2, ports: {N1: VDD, N2: Vout2}\nname: Iss, type: CurrentSource, value: Iss, ports: {Np: P, Nn: GND}\nname: VDD, type: VoltageSource, value: VDD, ports: {Np: VDD, Nn: GND}\n]\nextrainfo:A differential pair circuit with two NMOS transistors, M1 and M2, is presented. The current source, Iss, furnishes the bias current. The resistors, RD1 and RD2, are linked to the drains of M1 and M2, respectively, while the power supply, VDD, is connected to the upper ends of these resistors. The circuit is engineered to augment the disparity between Vin1 and Vin2, generating outputs Vout1 and Vout2.\n\nFor a device with a quadratic current-voltage characteristic, we obtain\n\n$$\n\\begin{equation*}\n\\left(V_{G S}-V_{T H}\\right)^{2}=\\frac{I_{D}}{\\frac{1}{2} \\mu_{n} C_{o x} \\frac{W}{L}} \\tag{4.3}\n\\end{equation*}\n$$\n\nthereby,\n\n$$\n\\begin{equation*}\nV_{G S}=\\sqrt{\\frac{2 I_{D}}{\\mu_{n} C_{o x} \\frac{W}{L}}}+V_{T H} \\tag{4.4}\n\\end{equation*}\n$$\n\nIt can be deduced from (4.2) and (4.4) that\n\n$$\n\\begin{equation*}\nV_{i n 1}-V_{i n 2}=\\sqrt{\\frac{2 I_{D 1}}{\\mu_{n} C_{o x} \\frac{W}{L}}}-\\sqrt{\\frac{2 I_{D 2}}{\\mu_{n} C_{o x} \\frac{W}{L}}} \\tag{4.5}\n\\end{equation*}\n$$\n\nWe aim to determine the differential output current, \\(I_{D 1}-I_{D 2}\\). By squaring both sides of (4.5) and recognizing that \\(I_{D 1}+I_{D 2}=I_{S S}\\), we find\n\n$$\n\\begin{equation*}\n\\left(V_{i n 1}-V_{i n 2}\\right)^{2}=\\frac{2}{\\mu_{n} C_{o x} \\frac{W}{L}}\\left(I_{S S}-2 \\sqrt{I_{D 1} I_{D 2}}\\right) \\tag{4.6}\n\\end{equation*}\n$$\n\nThus,\n\n$$\n\\begin{equation*}\n\\frac{1}{2} \\mu_{n} C_{o x} \\frac{W}{L}\\left(V_{i n 1}-V_{i n 2}\\right)^{2}-I_{S S}=-2 \\sqrt{I_{D 1} I_{D 2}} \\tag{4.7}\n\\end{equation*}\n$$\n\nSquaring both sides once more and noting that \\(4 I_{D 1} I_{D 2}=\\left(I_{D 1}+I_{D 2}\\right)^{2}-\\left(I_{D 1}-I_{D 2}\\right)^{2}=I_{S S}^{2}-\\left(I_{D 1}-I_{D 2}\\right)^{2}\\), we arrive at\n\n$$\n\\begin{equation*}\n\\left(I_{D 1}-I_{D 2}\\right)^{2}=-\\frac{1}{4}\\left(\\mu_{n} C_{o x} \\frac{W}{L}\\right)^{2}\\left(V_{i n 1}-V_{i n 2}\\right)^{4}+I_{S S} \\mu_{n} C_{o x} \\frac{W}{L}\\left(V_{i n 1}-V_{i n 2}\\right)^{2} \\tag{4.8}\n\\end{equation*}\n$$\n\nHence,\n\n$$\n\\begin{align*}\nI_{D 1}-I_{D 2} & =\\frac{1}{2} \\mu_{n} C_{o x} \\frac{W}{L}\\left(V_{i n 1}-V_{i n 2}\\right) \\sqrt{\\frac{4 I_{S S}}{\\mu_{n} C_{o x} \\frac{W}{L}}-\\left(V_{i n 1}-V_{i n 2}\\right)^{2}}  \\tag{4.9}\\\\\n& =\\sqrt{\\mu_{n} C_{o x} \\frac{W}{L} I_{S S}\\left(V_{i n 1}-V_{i n 2}\\right) \\sqrt{1-\\frac{\\mu_{n} C_{o x}(W / L)}{4 I_{S S}}\\left(V_{i n 1}-V_{i n 2}\\right)^{2}}} \\tag{4.10}\n\\end{align*}\n$$\n\nIt can be stated that \\(M_{1}\\), \\(M_{2}\\), and the tail current source behave as a voltage-dependent current source, generating \\(I_{D 1}-I_{D 2}\\) in accordance with the aforementioned large-signal characteristics. As anticipated, \\(I_{D 1}-I_{D 2}\\) exhibits an odd function dependency on \\(V_{i n 1}-V_{i n 2}\\), dropping to zero when \\(V_{i n 1}=V_{i n 2}\\). As \\(|V_{i n 1}-V_{i n 2}|\\) escalates from zero, \\(|I_{D 1}-I_{D 2}|\\) also increases because the coefficient preceding the square root rises at a faster pace than the argument within the square root diminishes. \n\nBefore delving further into (4.9), it is beneficial to compute the slope of the characteristic, i.e., the transconductance \\(G_{m}\\) of \\(M_{1}\\) and \\(M_{2}\\). By denoting the differential quantities \\(I_{D 1}-I_{D 2}\\) and \\(V_{i n 1}-V_{i n 2}\\) as \\(\\Delta I_{D}\\) and \\(\\Delta V_{i n}\\), respectively, one can demonstrate that\n\n$$\n\\begin{equation*}\n\\frac{\\partial \\Delta I_{D}}{\\partial \\Delta V_{i n}}=\\frac{1}{2} \\mu_{n} C_{o x} \\frac{W}{L} \\frac{\\frac{4 I_{S S}}{\\mu_{n} C_{o x} W / L}-2 \\Delta V_{i n}^{2}}{\\sqrt{\\frac{4 I_{S S}}{\\mu_{n} C_{o x} W / L}-\\Delta V_{i n}^{2}}} \\tag{4.11}\n\\end{equation*}\n$$\n\nFor \\(\\Delta V_{i n}=0\\), \\(G_{m}\\) attains its maximum and is equivalent to \\(\\sqrt{\\mu_{n} C_{o x}(W / L) I_{S S}}\\). Furthermore, since \\(V_{\\text {out } 1}-V_{\\text {out } 2}=R_{D} \\Delta I=-R_{D} G_{m} \\Delta V_{i n}\\), we can express the small-signal differential voltage gain of the circuit under the equilibrium condition as\n\n$$\n\\begin{equation*}\n\\left|A_{v}\\right|=\\sqrt{\\mu_{n} C_{o x} \\frac{W}{L} I_{S S}} R_{D} \\tag{4.12}\n\\end{equation*}\n$$\n\nSince each transistor carries a bias current of \\(I_{S S} / 2\\) under this condition, the factor \\(\\sqrt{\\mu_{m} C_{o x}(W / L) I_{S S}}\\) is, in fact, the transconductance of each device, leading to \\(\\left|A_{v}\\right|=g_{m} R_{D}\\). Equation (4.11) also suggests that \\(G_{m}\\) diminishes to zero for \\(\\Delta V_{i n}=\\sqrt{2 I_{S S} /\\left(\\mu_{n} C_{o x} W / L\\right)}\\). As we shall see subsequently, this value of \\(\\Delta V_{i n}\\) plays a pivotal role in the operation of the circuit.\n\nLet us now scrutinize Eq. (4.9) with greater precision. If \\(\\left(V_{i n 1}-V_{i n 2}\\right)^{2} \\ll 4 I_{S S} /\\left[\\mu_{n} C_{o x}(W / L)\\right]\\), then\n\n$$\n\\begin{equation*}\nI_{D 1}-I_{D 2}=\\sqrt{\\mu_{n} C_{o x} \\frac{W}{L} I_{S S}}\\left(V_{i n 1}-V_{i n 2}\\right) \\tag{4.13}\n\\end{equation*}\n$$\n\nyielding the same equilibrium \\(G_{m}\\) as that ascertained previously. However, what occurs for greater magnitudes of \\(|V_{i n 1}-V_{i n 2}|\\)? It seems that the argument within the square root declines to zero for \\(\\Delta V_{i n}=\\sqrt{4 I_{S S} /\\left(\\mu_{n} C_{o x} W / L\\right)}\\) and \\(\\Delta I_{D}\\) intersects zero at two distinct values of \\(\\Delta V_{i n}\\), an outcome not predicted by our preliminary analysis in Figure 4.8. Nonetheless, this conclusion is erroneous. To comprehend why, recall that (4.9) was derived under the assumption that both \\(M_{1}\\) and \\(M_{2}\\) are operational. In reality, as \\(\\Delta V_{i n}\\) surpasses a threshold, one transistor assumes the entire \\(I_{S S}\\), thereby shutting down the other. Denoting this value as \\(\\Delta V_{i n 1}\\), we have \\(I_{D 1}=I_{S S}\\) and \\(\\Delta V_{i n 1}=V_{G S 1}-V_{T H}\\) since \\(M_{2}\\) is nearly inactive. Consequently,\n\n$$\n\\begin{equation*}\n\\Delta V_{i n 1}=\\sqrt{\\frac{2 I_{S S}}{\\mu_{n} C_{o x} \\frac{W}{L}}} \\tag{4.14}\n\\end{equation*}\n$$\n\nFor \\(\\Delta V_{i n}>\\Delta V_{i n 1}\\), \\(M_{2}\\) is disabled and (4.9) and (4.10) are no longer applicable. As previously mentioned, \\(G_{m}\\) diminishes to zero for \\(\\Delta V_{i n}=\\Delta V_{i n 1}\\). Figure 4.13 illustrates the behavior.\n\n#### Example 4.4\n\nSketch the output currents of a differential pair in response to changes in the device width and the tail current.\n\n#### Solution\n\nConsider the characteristic depicted in Figure 4.14(a). As \\(W / L\\) grows, \\(\\Delta V_{i n 1}\\) diminishes, shrinking the input range where both devices remain active [Figure 4.14(b)]. As \\(I_{S S}\\) increases, both the input range and the output current range expand [Figure 4.14(c)]. Intuitively, we anticipate the circuit to become more linear as \\(I_{S S}\\) increases or \\(W / L\\) decreases.\n\nimage_name:(a)\ndescription:The graph labeled \"(a)\" is a plot of drain currents \\(I_{D1}\\) and \\(I_{D2}\\) against the differential input voltage \\(\\Delta V_{in}\\) for a differential pair. The x-axis denotes the differential input voltage \\(\\Delta V_{in}\\), marked with critical points \\(-\\Delta V_{in1}\\) and \\(+\\Delta V_{in1}\\), and the y-axis denotes the drain currents \\(I_{D1}\\) and \\(I_{D2}\\).\n\n**Type of Graph and Function:**\n- This graph is a characteristic curve that illustrates the relationship between input voltage and output currents in a differential pair circuit.\n\n**Axes Labels and Units:**\n- X-axis: \\(\\Delta V_{in}\\) (differential input voltage)\n- Y-axis: \\(I_{D1}\\) and \\(I_{D2}\\) (drain currents)\n\n**Overall Behavior and Trends:**\n- As the input voltage \\(\\Delta V_{in}\\) increases from negative to positive, the current \\(I_{D1}\\) increases while \\(I_{D2}\\) decreases symmetrically.\n- The graph exhibits a crossover point at \\(\\Delta V_{in} = 0\\), where both currents are equal.\n- The curves are S-shaped, indicating a gradual transition between states.\n\n**Key Features and Technical Details:**\n- The currents \\(I_{D1}\\) and \\(I_{D2}\\) are equal at \\(\\Delta V_{in} = 0\\), which is the midpoint of symmetry for the differential pair.\n- The input voltage range \\([-\\Delta V_{in1}, +\\Delta V_{in1}]\\) defines the area where both transistors are operational.\n\n**Annotations and Specific Data Points:**\n- The graph is annotated with \\(-\\Delta V_{in1}\\) and \\(+\\Delta V_{in1}\\) to indicate the input voltage bounds at which the differential pair begins to deactivate one side entirely.\n\nThis graph is essential for comprehending how the differential pair reacts to alterations in input voltage, demonstrating the linearity and operational range of the circuit.\nimage_name:(b)\ndescription:The graph labeled \"(b)\" is a plot of transconductance \\( G_m \\) against differential input voltage \\( \\Delta V_{in} \\). It is a common bell-shaped curve observed in the analysis of differential pairs.\n\n1. **Type of Graph and Function:**\n- This graph depicts the relationship between transconductance, a measure of the gain in a differential pair, and the differential input voltage.\n\n2. **Axes Labels and Units:**\n- The horizontal axis represents the differential input voltage \\( \\Delta V_{in} \\), with units likely in volts (V).\n- The vertical axis represents the transconductance \\( G_m \\), which is typically measured in siemens (S).\n\n3. **Overall Behavior and Trends:**\n- The graph features a peak at the center, where \\( \\Delta V_{in} \\) is zero, indicating maximum gain at this point.\n- As \\( \\Delta V_{in} \\) moves away from zero in either direction (positive or negative), the transconductance diminishes, reflecting a symmetrical reduction on both sides of the peak.\n- This pattern suggests that the differential pair is most linear and has the highest gain when the input voltage difference is minimal.\n\n4. **Key Features and Technical Details:**\n- The peak of the curve corresponds to the maximum transconductance, which occurs at \\( \\Delta V_{in} = 0 \\).\n- The curve is symmetrical about the vertical axis, indicating balanced behavior for both positive and negative input differences.\n- The width of the curve at the base indicates the range of \\( \\Delta V_{in} \\) over which the transconductance is significant.\n\n5. **Annotations and Specific Data Points:**\n- The graph lacks specific numerical annotations or markers, but the peak and symmetry are key qualitative features.\n- The points labeled \\( -\\Delta V_{in1} \\) and \\( +\\Delta V_{in1} \\) likely represent the input voltage limits where the transconductance starts to significantly decline.\n\nFigure 4.13 displays the variation of drain currents and overall"
}
]