[

{
    "text": "Analog circuits extensively utilize voltage and current references. These references are DC quantities that show minimal reliance on supply and process parameters and a clearly defined temperature dependence. For instance, the bias current of a differential pair must be generated based on a reference, as it influences the circuit's voltage gain and noise. Additionally, precise voltages are essential for defining common-mode levels in operational amplifiers. Furthermore, in systems like A/D and D/A converters, a reference is necessary to establish the input or output full-scale range.\n\nThis chapter addresses the design of reference generators in CMOS technology, emphasizing well-established \"bandgap\" methods. Initially, we explore supply-independent biasing and the start-up issue. Then, we discuss temperature-independent references and analyze topics such as the impact of offset voltages. Lastly, we introduce constant-$G_{m}$ biasing and examine a state-of-the-art bandgap reference example."
},
{
    "text": "Analog circuits extensively utilize voltage and current references. These references are DC quantities that show minimal reliance on supply and process parameters and have a clearly defined relationship with temperature. For instance, the bias current of a differential pair must be generated based on a reference, as it influences the circuit's voltage gain and noise. Additionally, precise voltages are essential for defining common-mode levels in operational amplifiers. Furthermore, in systems like A/D and D/A converters, a reference is necessary to establish the full-scale range for inputs or outputs.\n\nThis chapter addresses the design of reference generators in CMOS technology, emphasizing well-established \"bandgap\" methods. Initially, we explore supply-independent biasing and the issue of start-up. Subsequently, we discuss temperature-independent references and analyze aspects such as the impact of offset voltages. Finally, we introduce constant-$G_{m}$ biasing and examine a cutting-edge example of bandgap references."
},
{
    "text": "Analog circuits extensively utilize voltage and current references. These references are DC quantities that show minimal reliance on supply and process parameters, while exhibiting a well-defined relationship with temperature. For instance, the bias current of a differential pair must be generated based on a reference, as it influences the circuit's voltage gain and noise. Additionally, precise voltages are essential for defining common-mode levels in operational amplifiers. Furthermore, in systems like A/D and D/A converters, a reference is crucial for establishing the full-scale range of input or output.\n\nIn this chapter, we focus on the design of reference generators in CMOS technology, particularly the well-established \"bandgap\" techniques. Initially, we explore supply-independent biasing and address the start-up issue. Subsequently, we discuss temperature-independent references and analyze matters such as the impact of offset voltages. Lastly, we introduce constant-$G_{m}$ biasing and examine a cutting-edge example of bandgap references."
},
{
    "text": "Analog circuits widely utilize voltage and current references. These references are DC quantities that show minimal reliance on supply and process parameters, alongside a clearly defined temperature dependence. For instance, the bias current in a differential pair needs to be generated based on a reference, as it influences the circuit's voltage gain and noise. Additionally, precise voltages are essential for establishing common-mode levels in operational amplifiers. Furthermore, in systems like A/D and D/A converters, a reference is necessary to determine the full-scale range of input or output.\n\nThis chapter focuses on designing reference generators in CMOS technology, emphasizing established \"bandgap\" methods. Initially, we explore supply-independent biasing and address the start-up issue. Subsequently, we discuss temperature-independent references and analyze aspects such as offset voltage effects. Lastly, we introduce constant-$G_{m}$ biasing and examine a cutting-edge example of bandgap references."
},
{
    "text": "Analog circuits extensively utilize voltage and current references. These references are DC quantities that show minimal reliance on supply and process parameters, while exhibiting a well-defined temperature dependence. For instance, the bias current of a differential pair must be generated based on a reference, as it influences the circuit's voltage gain and noise. Additionally, precise voltages are essential for defining common-mode levels in operational amplifiers. Furthermore, in systems like A/D and D/A converters, a reference is necessary to establish the full-scale range for input or output.\n\nThis chapter addresses the design of reference generators in CMOS technology, with a focus on established \"bandgap\" techniques. Initially, we explore supply-independent biasing and the start-up issue. Subsequently, we discuss temperature-independent references and analyze aspects such as the impact of offset voltages. Lastly, we introduce constant-$G_{m}$ biasing and examine a cutting-edge example of bandgap references."
},
{
    "text": "Analog circuits extensively utilize voltage and current references. These references are dc quantities that show minimal dependence on supply and process parameters and a clearly defined relationship with temperature. For instance, the bias current of a differential pair must be generated based on a reference, as it influences the circuit's voltage gain and noise. We have also observed the necessity for accurate voltages to establish common-mode levels in operational amplifiers. Furthermore, in systems like A/D and D/A converters, a reference is essential to define the full-scale range of input or output.\n\nIn this chapter, we focus on the design of reference generators in CMOS technology, emphasizing well-established \"bandgap\" techniques. Initially, we explore supply-independent biasing and the issue of start-up. Then, we discuss temperature-independent references and analyze matters such as the impact of offset voltages. Lastly, we introduce constant-$G_{m}$ biasing and examine a contemporary example of bandgap references."
},
{
    "text": "Analog circuits extensively utilize voltage and current references. These references are DC quantities that show minimal reliance on supply and process variables, with a clearly defined temperature dependency. For instance, the bias current in a differential pair must be generated based on a reference, as it influences the circuit's voltage gain and noise. Additionally, precise voltages are essential for establishing common-mode levels in operational amplifiers. Furthermore, in systems like A/D and D/A converters, references are necessary to define the full-scale range of inputs or outputs.\n\nIn this chapter, we focus on the design of reference generators in CMOS technology, emphasizing established \"bandgap\" methods. Initially, we explore supply-independent biasing and the start-up issue. Then, we discuss temperature-independent references and consider factors such as offset voltage effects. Lastly, we introduce constant-$G_{m}$ biasing and analyze a cutting-edge example of bandgap references."
},
{
    "text": "Analog circuits extensively utilize voltage and current references. These references are DC quantities that show minimal reliance on supply and process parameters while exhibiting a well-defined temperature dependency. For instance, the bias current of a differential pair must be derived from a reference, as it influences the circuit's voltage gain and noise. We have also observed the necessity for accurate voltages to establish common-mode levels in operational amplifiers. Additionally, in systems like A/D and D/A converters, a reference is essential to define the full-scale range of input or output.\n\nIn this chapter, we address the design of reference generators in CMOS technology, with a focus on the well-established \"bandgap\" techniques. Initially, we explore supply-independent biasing and the issue of start-up. Subsequently, we discuss temperature-independent references and analyze aspects such as the impact of offset voltages. Lastly, we introduce constant-$G_{m}$ biasing and examine a contemporary example of state-of-the-art bandgap references."
},
{
    "text": "---[Rephrased Text]---\nThe passages from previous chapters have subtly presumed the existence of an unchanging \"golden\" reference current. As depicted in Fig. 12.1(a), when $I_{R E F}$ is constant regardless of $V_{D D}$, and the channel-length modulation of $M_{2}$ and $M_{3}$ is ignored, the currents $I_{D 2}$ and $I_{D 3}$ are independent of the power supply voltage. This raises the question: How can we generate such a stable $I_{R E F}$?\n\nThe circuit in Fig. 12.1(a) employs an ideal current source for biasing in a current mirror setup, composed of three NMOS transistors (M1, M2, M3) along with the current source IREF. ID2 and ID3 are sourced from nodes LOAD1 and LOAD2 respectively, with the goal of keeping these currents unaffected by the power supply voltage VDD.\n\nFigure 12.1(b) shows an alternative method of generating a reference current that is less affected by the supply voltage. A resistor R1 is used to create IREF, while M1 and M2 form the current mirror, with M2 delivering the output current Iout.\n\nFigures 12.1(a) and 12.1(b) illustrate current mirror biasing using an ideal current source and a resistor, respectively. To mimic a current source, a resistor is connected from VDD to the gate of M1 in Fig. 12.1(b). However, the output current of this setup is highly sensitive to VDD:\n\n$$\n\\Delta I_{\\text {out }}=\\frac{\\Delta V_{D D}}{R_{1}+1 / g_{m 1}} \\cdot \\frac{(W / L)_{2}}{(W / L)_{1}} \\tag{12.1}\n$$\n\nTo achieve less sensitivity, we propose that the circuit must self-bias, meaning $I_{R E F}$ should derive from $I_{\\text {out }}$. The concept is that for $I_{\\text {out }}$ to be truly independent of $V_{D D}$, $I_{R E F}$ could mirror $I_{\\text {out }}$. Figure 12.2 demonstrates this idea, where M3 and M4 replicate $I_{\\text {out }}$, thereby defining $I_{R E F}$. Essentially, $I_{R E F}$ is \"bootstrapped\" to $I_{\\text {out }}$. If channel-length modulation is disregarded, we have $I_{\\text {out }}=K I_{R E F}$. It's important to note that since each diode-connected device is powered by a current source, $I_{\\text {out }}$ and $I_{R E F}$ have minimal dependence on $V_{D D}$.\n\nFigure 12.2 displays a straightforward circuit to establish currents that are independent of the supply voltage.\n\nSince $I_{\\text {out }}$ and $I_{R E F}$ in Fig. 12.2 show minimal sensitivity to $V_{D D}$, their values are determined by other factors. How do we calculate these currents? Interestingly, if $M_{1}-M_{4}$ operate in saturation and $\\lambda \\approx 0$, the circuit follows a single equation, $I_{\\text {out }}=K I_{R E F}$, and thus can maintain any current level! For instance, if we initially set $I_{R E F}$ to $10 \\mu \\mathrm{~A}$, the resulting $I_{\\text {out }}$ of $K \\times 10 \\mu \\mathrm{~A}$ circulates around the loop, upholding these current levels in the left and right branches indefinitely.\n\nTo uniquely establish the currents, an additional constraint is introduced to the circuit, as shown in Fig. 12.3(a). Here, resistor $R_{S}$ reduces the current of $M_{2}$, and the PMOS devices necessitate that $I_{\\text {out }}=I_{R E F}$ due to their identical dimensions and thresholds. This leads to the equation:\n\n$$\n\\sqrt{\\frac{2 I_{\\text {out }}}{\\mu_{n} C_{o x}(W / L)_{N}}}+V_{T H 1}=\\sqrt{\\frac{2 I_{\\text {out }}}{\\mu_{n} C_{o x} K(W / L)_{N}}}+V_{T H 2}+I_{\\text {out }} R_{S} \\tag{12.2}\n$$\n\nDisregarding body effect, we obtain:\n\n$$\n\\sqrt{\\frac{2 I_{\\text {out }}}{\\mu_{n} C_{o x}(W / L)_{N}}}\\left(1-\\frac{1}{\\sqrt{K}}\\right)=I_{\\text {out }} R_{S} \\tag{12.3}\n$$\n\nAnd hence:\n\n$$\nI_{\\text {out }}=\\frac{2}{\\mu_{n} C_{o x}(W / L)_{N}} \\cdot \\frac{1}{R_{S}^{2}}\\left(1-\\frac{1}{\\sqrt{K}}\\right)^{2} \\tag{12.4}\n$$\n\nAs anticipated, the current is independent of the supply voltage (though still influenced by process and temperature).\n\nThe assumption $V_{T H 1}=V_{T H 2}$ introduces some error in the calculations because the sources of $M_{1}$ and $M_{2}$ are at different voltages. Figure 12.3(b) presents a solution by placing the resistor in the source of $M_{3}$ and eliminating body effect by connecting the source and bulk of each PMOS transistor.\n\nThe circuits in Figs. 12.3(a) and (b) exhibit minimal supply dependence when channel-length modulation is negligible. Consequently, all transistors in these circuits employ relatively long channels, which also aids in reducing flicker noise.\n\n#### Example 12.1\n\nGiven that $\\lambda \\neq 0$ in Fig. 12.3(a), estimate the change in $I_{\\text {out }}$ for a small change $\\Delta V_{D D}$ in the supply voltage.\n\n#### Solution\n\nSimplifying the circuit as depicted in Fig. 12.4, where $R_{1}=r_{O 1} \\|\\left(1 / g_{m 1}\\right)$ and $R_{3}=r_{O 3} \\|\\left(1 / g_{m 3}\\right)$, we calculate the \"gain\" from $V_{D D}$ to $I_{\\text {out }}$. The small-signal gate-source voltage of $M_{4}$ equals $-I_{o u t} R_{3}$, and the current through $r_{O 4}$ is $\\left(V_{D D}-V_{X}\\right) / r_{O 4}$. Therefore:\n\n$$\n\\frac{V_{D D}-V_{X}}{r_{O 4}}+I_{o u t} R_{3} g_{m 4}=\\frac{V_{X}}{R_{1}} \\tag{12.5}\n$$\n\nIf we denote the equivalent transconductance of $M_{2}$ and $R_{S}$ by $G_{m 2}=I_{\\text {out }} / V_{X}$, then:\n\n$$\n\\frac{I_{\\text {out }}}{V_{D D}}=\\frac{1}{r_{O 4}}\\left[\\frac{1}{G_{m 2}\\left(r_{O 4} \\| R_{1}\\right)}-g_{m 4} R_{3}\\right]^{-1} \\tag{12.6}\n$$\n\nAccording to Chapter 3:\n\n$$\nG_{m 2}=\\frac{g_{m 2} r_{O 2}}{R_{S}+r_{O 2}+\\left(g_{m 2}+g_{m b 2}\\right) R_{S} r_{O 2}} \\tag{12.7}\n$$\n\nInterestingly, the sensitivity disappears if $r_{O 4}=\\infty$.\n\nIn some applications, the sensitivity provided by (12.6) is excessively high. Additionally, due to various capacitive paths, the supply sensitivity of the circuit increases at high frequencies. Therefore, the core supply voltage is often derived from a locally-generated, less sensitive voltage, which is discussed further in Sec. 12.8.\n\nAn essential issue in supply-independent biasing is the presence of \"degenerate\" bias points. For example, in the circuit of Fig. 12.3(a), if all transistors carry zero current when the supply is turned on, they may remain off indefinitely because the loop can support zero current in both branches. This condition is not accounted for by (12.4) because in deriving (12.3), we divided both sides by $\\sqrt{I_{o u t}}$, implicitly assuming that $I_{\\text {out }} \\neq 0$. In other words, the circuit can stabilize in one of two different operating conditions.\n\nThis issue, known as the \"start-up\" problem, is resolved by incorporating a mechanism that prompts the circuit to exit the degenerate bias point upon start-up. Figure 12.5(a) shows a simple example, where the diode-connected device $M_{5}$ provides a current path from $V_{D D}$ through $M_{3}$ and $M_{1}$ to ground during start-up. Consequently, $M_{3}$ and $M_{1}$, and thus $M_{2}$ and $M_{4}$, cannot remain off. Of course, this technique is practical only if $V_{T H 1}+V_{T H 5}+\\left|V_{T H 3}\\right|<V_{D D}$ and $V_{G S 1}+V_{T H 5}+\\left|V_{G S 3}\\right|>V_{D D}$, with the latter ensuring that $M_{5}$ remains off after start-up.\n\nAddressing the start-up problem generally necessitates meticulous analysis and simulation. The supply voltage must be gradually increased from zero in a dc sweep simulation (to prevent false start-up due to parasitic capacitances) as well as in a transient simulation, with the behavior of the circuit examined at each supply voltage. Figure 12.5(b) presents an example of the observed behavior with the start-up circuit in place. In more complex implementations, multiple degenerate points may exist.\n\nFigure 12.5 (a) depicts the addition of a start-up device to the circuit of Fig. 12.3(a), and (b) illustrates the presence of a degenerate point."
},
{
    "text": "Our prior chapters have implicitly assumed the existence of a \"golden\" reference current in our use of bias currents and current mirrors. In Fig. 12.1(a), if $I_{R E F}$ remains constant with changes in $V_{D D}$, and the channel-length modulation of $M_{2}$ and $M_{3}$ is ignored, then $I_{D 2}$ and $I_{D 3}$ will not depend on the supply voltage. The question arises: How do we generate $I_{R E F}$?\nimage_name:Figure 12.1(a)\ndescription:\n[\nname: M1, type: NMOS, ports: {S: GND, D: X, G: X}\nname: M2, type: NMOS, ports: {S: GND, D: LOAD1, G: X}\nname: M3, type: NMOS, ports: {S: GND, D: LOAD2, G: X}\nname: IREF, type: CurrentSource, value: IREF, ports: {Np: VDD, Nn: X}\n]\nextrainfo:Figure 12.1(a) displays a current mirror biasing circuit using an ideal current source. The circuit consists of three NMOS transistors (M1, M2, M3) and a current source IREF. The output currents ID2 and ID3 are drawn from nodes LOAD1 and LOAD2 respectively. The circuit aims to maintain these currents independent of the supply voltage VDD.\nimage_name:Figure 12.1(b)\ndescription:\n[\nname: M1, type: NMOS, ports: {S: GND, D: X, G: X}\nname: M2, type: NMOS, ports: {S: GND, D: Load1, G: X}\nname: VDD, type: VoltageSource, value: VDD, ports: {Np: VDD, Nn: GND}\nname: R1, type: Resistor, value: R1, ports: {N1: VDD, N2: X}\n]\nextrainfo:The circuit is a current mirror with a supply-independent biasing scheme. It uses a resistor R1 to generate a reference current IREF that is less sensitive to variations in VDD. M1 and M2 form the current mirror, with M2 providing the output current Iout.\n\nFigure 12.1 Current mirror biasing using (a) an ideal current source and (b) a resistor.\nAs an approximation of a current source, we connect a resistor from $V_{D D}$ to the gate of $M_{1}$ [Fig. 12.1(b)]. However, the output current of this circuit is quite sensitive to $V_{D D}$ :\n\n$$\n\\begin{equation*}\n\\Delta I_{\\text {out }}=\\frac{\\Delta V_{D D}}{R_{1}+1 / g_{m 1}} \\cdot \\frac{(W / L)_{2}}{(W / L)_{1}} \\tag{12.1}\n\\end{equation*}\n$$\n\nIn order to arrive at a less sensitive solution, we postulate that the circuit must bias itself, i.e., $I_{R E F}$ must be somehow derived from $I_{\\text {out }}$. The idea is that if $I_{\\text {out }}$ is to be ultimately independent of $V_{D D}$, then $I_{R E F}$ can be a replica of $I_{\\text {out }}$. Figure 12.2 illustrates an implementation where $M_{3}$ and $M_{4}$ copy $I_{\\text {out }}$, thereby defining $I_{R E F}$. In essence, $I_{R E F}$ is \"bootstrapped\" to $I_{o u t}$. With the sizes chosen here, we have $I_{\\text {out }}=K I_{R E F}$ if channel-length modulation is neglected. Note that, since each diode-connected device feeds from a current source, $I_{o u t}$ and $I_{R E F}$ are relatively independent of $V_{D D}$.\nimage_name:Figure 12.2\ndescription:\n[\nname: M1, type: NMOS, ports: {S: GND, D: X, G: X}\nname: M2, type: NMOS, ports: {S: GND, D: Y, G: X}\nname: M3, type: PMOS, ports: {S: VDD, D: Y, G: Y}\nname: M4, type: PMOS, ports: {S: VDD, D: X, G: Y}\n]\nextrainfo:The circuit is designed to establish supply-independent currents with Iout and IREF having little dependence on VDD. M3 and M4 mirror Iout to define IREF, with Iout = K * IREF assuming saturation and negligible channel-length modulation.\n\nFigure 12.2 Simple circuit to establish supply-independent currents.\n\nSince $I_{\\text {out }}$ and $I_{R E F}$ in Fig. 12.2 display little dependence on $V_{D D}$, their magnitude is set by other parameters. How do we calculate these currents? Interestingly, if $M_{1}-M_{4}$ operate in saturation and $\\lambda \\approx 0$, then the circuit is governed by only one equation, $I_{\\text {out }}=K I_{R E F}$, and hence can support any current level! For example, if we initially force $I_{R E F}$ to be $10 \\mu \\mathrm{~A}$, the resulting $I_{\\text {out }}$ of $K \\times 10 \\mu \\mathrm{~A}$ \"circulates\" around the loop, sustaining these current levels in the left and right branches indefinitely.\n\nTo uniquely define the currents, we add another constraint to the circuit, e.g., as shown in Fig. 12.3(a). Here, resistor $R_{S}$ decreases the current of $M_{2}$ while the PMOS devices require that $I_{\\text {out }}=I_{R E F}$ because they have identical dimensions and thresholds. We can write $V_{G S 1}=V_{G S 2}+I_{D 2} R_{S}$, or\n\n$$\n\\begin{equation*}\n\\sqrt{\\frac{2 I_{\\text {out }}}{\\mu_{n} C_{o x}(W / L)_{N}}}+V_{T H 1}=\\sqrt{\\frac{2 I_{\\text {out }}}{\\mu_{n} C_{o x} K(W / L)_{N}}}+V_{T H 2}+I_{\\text {out }} R_{S} \\tag{12.2}\n\\end{equation*}\n$$\n\nNeglecting body effect, we have\n\n$$\n\\begin{equation*}\n\\sqrt{\\frac{2 I_{\\text {out }}}{\\mu_{n} C_{o x}(W / L)_{N}}}\\left(1-\\frac{1}{\\sqrt{K}}\\right)=I_{\\text {out }} R_{S} \\tag{12.3}\n\\end{equation*}\n$$\n\nimage_name:(a)\ndescription:\n[\nname: M1, type: NMOS, ports: {S: GND, D: X, G: X}\nname: M2, type: NMOS, ports: {S: s2, D: Y(Iout), G: X}\nname: M3, type: PMOS, ports: {S: VDD, D: Y(Iout), G: Y}\nname: M4, type: PMOS, ports: {S: VDD, D: X, G: Y}\nname: RS, type: Resistor, value: RS, ports: {N1: s2, N2: GND}\n]\nextrainfo:The circuit is a current mirror configuration with M1 and M2 as NMOS transistors, and M3 and M4 as PMOS transistors. The resistor RS sets the output current Iout. The circuit uses a reference current IREF to define the currents through M1 and M2.\n\nimage_name:(b)\ndescription:\n[\nname: M1, type: NMOS, ports: {S: GND, D: X, G: Y}\nname: M2, type: NMOS, ports: {S: GND, D: Y(Iout), G: Y}\nname: M3, type: PMOS, ports: {S: s3, D: Y(Iout), G: X}\nname: M4, type: PMOS, ports: {S: VDD, D: X, G: X}\nname: RS, type: Resistor, value: RS, ports: {N1: VDD, N2: s3}\n]\nextrainfo:The circuit is a current mirror configuration with M1 and M2 as NMOS transistors, and M3 and M4 as PMOS transistors. The resistor RS sets the output current Iout. The circuit uses a reference current IREF to define the currents through M1 and M2.\n\nFigure 12.3 (a) Addition of $R_{S}$ to define the currents; (b) alternative implementation eliminating body effect.\nand hence\n\n$$\n\\begin{equation*}\nI_{\\text {out }}=\\frac{2}{\\mu_{n} C_{o x}(W / L)_{N}} \\cdot \\frac{1}{R_{S}^{2}}\\left(1-\\frac{1}{\\sqrt{K}}\\right)^{2} \\tag{12.4}\n\\end{equation*}\n$$\n\nAs expected, the current is independent of the supply voltage (but still a function of process and temperature).\n\nThe assumption $V_{T H 1}=V_{T H 2}$ introduces some error in the foregoing calculations because the sources of $M_{1}$ and $M_{2}$ are at different voltages. Shown in Fig. 12.3(b) is to place the resistor in the source of $M_{3}$ while eliminating body effect by tying the source and bulk of each PMOS transistor. Another solution is described in Problem 12.1.\n\nThe circuits of Figs. 12.3(a) and (b) exhibit little supply dependence if channel-length modulation is negligible. For this reason, relatively long channels are used for all of the transistors in the circuit. This also helps reduce their flicker noise.\n\n#### Example 12.1\n\nAssuming $\\lambda \\neq 0$ in Fig. 12.3(a), estimate the change in $I_{\\text {out }}$ for a small change $\\Delta V_{D D}$ in the supply voltage.\n\n#### Solution\n\nSimplifying the circuit as depicted in Fig. 12.4, where $R_{1}=r_{O 1} \\|\\left(1 / g_{m 1}\\right)$ and $R_{3}=r_{O 3} \\|\\left(1 / g_{m 3}\\right)$, we calculate the \"gain\" from $V_{D D}$ to $I_{\\text {out }}$. The small-signal gate-source voltage of $M_{4}$ equals $-I_{o u t} R_{3}$, and the current through $r_{O 4}$ is $\\left(V_{D D}-V_{X}\\right) / r_{O 4}$. Thus,\n\n$$\n\\begin{equation*}\n\\frac{V_{D D}-V_{X}}{r_{O 4}}+I_{o u t} R_{3} g_{m 4}=\\frac{V_{X}}{R_{1}} \\tag{12.5}\n\\end{equation*}\n$$\n\nimage_name:Figure 12.4\ndescription:\n[\nname: VDD, type: VoltageSource, value: VDD, ports: {Np: VDD, Nn: GND}\nname: ro4, type: Resistor, value: ro4, ports: {N1: VDD, N2: X}\nname: M4, type: PMOS, ports: {S: VDD, D: X, G: g4d2}\nname: R1, type: Resistor, value: R1, ports: {N1: X, N2: GND}\nname: M2, type: NMOS, ports: {S: s2, D: g4d2, G: X}\nname: R3, type: Resistor, value: R3, ports: {N1: VDD, N2: g4d2}\nname: ro2, type: Resistor, value: ro2, ports: {N1: g4d2, N2: s2}\nname: RS, type: Resistor, value: RS, ports: {N1: s2, N2: GND}\n]\nextrainfo:The circuit is a small-signal model involving a PMOS (M4) and NMOS (M2) transistor configuration. It calculates the gain from VDD to Iout, considering the transconductance and output resistances of the transistors and resistors in the circuit.\n\nIf we denote the equivalent transconductance of $M_{2}$ and $R_{S}$ by $G_{m 2}=I_{\\text {out }} / V_{X}$, then\n\n$$\n\\begin{equation*}\n\\frac{I_{\\text {out }}}{V_{D D}}=\\frac{1}{r_{O 4}}\\left[\\frac{1}{G_{m 2}\\left(r_{O 4} \\| R_{1}\\right)}-g_{m 4} R_{3}\\right]^{-1} \\tag{12.6}\n\\end{equation*}\n$$\n\nNote from Chapter 3 that\n\n$$\n\\begin{equation*}\nG_{m 2}=\\frac{g_{m 2} r_{O 2}}{R_{S}+r_{O 2}+\\left(g_{m 2}+g_{m b 2}\\right) R_{S} r_{O 2}} \\tag{12.7}\n\\end{equation*}\n$$\n\nInterestingly, the sensitivity vanishes if $r_{O 4}=\\infty$.\n\nIn some applications, the sensitivity given by (12.6) is prohibitively large. Also, owing to various capacitive paths, the supply sensitivity of the circuit rises at high frequencies. For these reasons, the supply voltage of the core is often derived from a locally-generated, less sensitive voltage. We return to this point in Sec. 12.8.\n\nAn important issue in supply-independent biasing is the existence of \"degenerate\" bias points. In the circuit of Fig. 12.3(a), for example, if all of the transistors carry zero current when the supply is turned on, they may remain off indefinitely because the loop can support a zero current in both branches. This condition is not predicted by (12.4) because in manipulating (12.3), we divided both sides by $\\sqrt{I_{o u t}}$, tacitly assuming that $I_{\\text {out }} \\neq 0$. In other words, the circuit can settle in one of two different operating conditions.\n\nCalled the \"start-up\" problem, the above issue is resolved by adding a mechanism that drives the circuit out of the degenerate bias point when the supply is turned on. Shown in Fig. 12.5(a) is a simple example, where the diode-connected device $M_{5}$ provides a current path from $V_{D D}$ through $M_{3}$ and $M_{1}$ to ground upon start-up. Thus, $M_{3}$ and $M_{1}$, and hence $M_{2}$ and $M_{4}$, cannot remain off. Of course, this technique is practical only if $V_{T H 1}+V_{T H 5}+\\left|V_{T H 3}\\right|<V_{D D}$ and $V_{G S 1}+V_{T H 5}+\\left|V_{G S 3}\\right|>V_{D D}$, the latter to ensure that $M_{5}$ remains off after start-up. Another start-up circuit is analyzed in Problem 12.2.\n\nThe problem of start-up generally requires careful analysis and simulation. The supply voltage must be ramped from zero in a dc sweep simulation (such that parasitic capacitances do not cause false start-up) as well as in a transient simulation and the behavior of the circuit examined for each supply voltage. Figure 12.5(b) depicts an example of the observed behavior in the presence of the start-up circuit. In complex implementations, more than one degenerate point may exist.\nimage_name:Figure 12.5(a)\ndescription:\n[\nname: M1, type: NMOS, ports: {S: GND, D: Y, G: Y}\nname: M2, type: NMOS, ports: {S: s2, D: X, G: Y}\nname: M5, type: NMOS, ports: {S: Y, D: X, G: X}\nname: M3, type: PMOS, ports: {S: VDD, D: X, G: X}\nname: M4, type: PMOS, ports: {S: VDD, D: Y, G: X}\nname: RS, type: Resistor, value: RS, ports: {N1: S2, N2: GND}\n]\nextrainfo:This circuit diagram illustrates a start-up circuit with NMOS and PMOS transistors and a resistor. The circuit is connected to VDD and GND, with a resistor RS connected to node S2 and ground. The start-up circuit is designed to avoid false start-up by ensuring proper biasing of the transistors.\nimage_name:Figure 12.5(b)\ndescription:The graph labeled (b) is a plot depicting the relationship between the drain current (I_D2) and the supply voltage (V_DD) in the context of a start-up circuit.\n\n1. **Type of Graph and Function:**\n- This is a current-voltage (I-V) graph, illustrating how the drain current changes as the supply voltage is varied.\n\n2. **Axes Labels and Units:**\n- The horizontal axis represents the supply voltage (V_DD), typically measured in volts.\n- The vertical axis represents the drain current (I_D2), usually measured in amperes.\n- Both axes appear to use a linear scale.\n\n3. **Overall Behavior and Trends:**\n- The graph starts at the origin, indicating that when the supply voltage is zero, the drain current is also zero.\n- As the supply voltage increases, the drain"
},
{
    "text": "Our preceding discussions on bias currents and current mirrors have presumed the availability of a stable reference current. As depicted in Fig. 12.1(a), when the reference current $I_{R E F}$ remains constant with changes in $V_{D D}$, and the channel-length modulation of $M_{2}$ and $M_{3}$ is ignored, the currents $I_{D 2}$ and $I_{D 3}$ are unaffected by the supply voltage. The central issue becomes—how do we produce $I_{R E F}$?\n\nFig. 12.1(a) presents a current mirror biasing circuit using an ideal current source. It includes three NMOS transistors (M1, M2, M3) and a current source IREF. The output currents ID2 and ID3 are sourced from nodes LOAD1 and LOAD2, respectively. The objective of the circuit is to ensure these currents remain unaffected by the supply voltage VDD.\n\nIn Fig. 12.1(b), a resistor R1 is used to generate a reference current IREF that is less sensitive to variations in VDD, creating a current mirror with a supply-independent biasing scheme. M1 and M2 form the current mirror, with M2 delivering the output current Iout.\n\nFigure 12.1 shows current mirror biasing circuits using (a) an ideal current source and (b) a resistor. To approximate a current source, we connect a resistor from $V_{D D}$ to the gate of $M_{1}$ [Fig. 12.1(b)]. However, the output current of this circuit is highly sensitive to $V_{D D}$:\n\n$$\n\\begin{equation*}\n\\Delta I_{\\text {out }}=\\frac{\\Delta V_{D D}}{R_{1}+1 / g_{m 1}} \\cdot \\frac{(W / L)_{2}}{(W / L)_{1}} \\tag{12.1}\n\\end{equation*}\n$$\n\nTo achieve a solution that is less sensitive, we hypothesize that the circuit must self-bias, meaning $I_{R E F}$ must be derived from $I_{\\text {out }}$. The concept is that if $I_{\\text {out }}$ is to be independent of $V_{D D}$, then $I_{R E F}$ can mirror $I_{\\text {out }}$. Figure 12.2 demonstrates an implementation where $M_{3}$ and $M_{4}$ replicate $I_{\\text {out }}$, thereby defining $I_{R E F}$. Essentially, $I_{R E F}$ is \"bootstrapped\" to $I_{o u t}$. With the chosen sizes, we have $I_{\\text {out }}=K I_{R E F}$ if channel-length modulation is neglected. Note that, since each diode-connected device is fed from a current source, $I_{o u t}$ and $I_{R E F}$ are relatively independent of $V_{D D}$.\n\nFigure 12.2 shows a simple circuit to establish supply-independent currents.\n\nSince $I_{\\text {out }}$ and $I_{R E F}$ in Fig. 12.2 exhibit minimal dependence on $V_{D D}$, their values are determined by other parameters. How do we compute these currents? Interestingly, if $M_{1}-M_{4}$ operate in saturation and $\\lambda \\approx 0$, then the circuit is governed by only one equation, $I_{\\text {out }}=K I_{R E F}$, and hence can support any current level! For instance, if we initially set $I_{R E F}$ to be $10 \\mu \\mathrm{~A}$, the resulting $I_{\\text {out }}$ of $K \\times 10 \\mu \\mathrm{~A}$ \"circulates\" around the loop, maintaining these current levels in the left and right branches indefinitely.\n\nTo uniquely define the currents, we introduce another constraint to the circuit, as shown in Fig. 12.3(a). Here, resistor $R_{S}$ reduces the current of $M_{2}$, and the PMOS devices necessitate that $I_{\\text {out }}=I_{R E F}$ due to their identical dimensions and thresholds. We can write $V_{G S 1}=V_{G S 2}+I_{D 2} R_{S}$, or\n\n$$\n\\begin{equation*}\n\\sqrt{\\frac{2 I_{\\text {out }}}{\\mu_{n} C_{o x}(W / L)_{N}}}+V_{T H 1}=\\sqrt{\\frac{2 I_{\\text {out }}}{\\mu_{n} C_{o x} K(W / L)_{N}}}+V_{T H 2}+I_{\\text {out }} R_{S} \\tag{12.2}\n\\end{equation*}\n$$\n\nNeglecting body effect, we have\n\n$$\n\\begin{equation*}\n\\sqrt{\\frac{2 I_{\\text {out }}}{\\mu_{n} C_{o x}(W / L)_{N}}}\\left(1-\\frac{1}{\\sqrt{K}}\\right)=I_{\\text {out }} R_{S} \\tag{12.3}\n\\end{equation*}\n$$\n\nand hence\n\n$$\n\\begin{equation*}\nI_{\\text {out }}=\\frac{2}{\\mu_{n} C_{o x}(W / L)_{N}} \\cdot \\frac{1}{R_{S}^{2}}\\left(1-\\frac{1}{\\sqrt{K}}\\right)^{2} \\tag{12.4}\n\\end{equation*}\n$$\n\nAs anticipated, the current is independent of the supply voltage (but still depends on process and temperature).\n\nThe assumption $V_{T H 1}=V_{T H 2}$ introduces some error in the previous calculations because the sources of $M_{1}$ and $M_{2}$ are at different voltages. Fig. 12.3(b) shows a configuration that places the resistor in the source of $M_{3}$ while eliminating body effect by connecting the source and bulk of each PMOS transistor. Another solution is described in Problem 12.1.\n\nThe circuits of Figs. 12.3(a) and (b) show minimal supply dependence if channel-length modulation is negligible. Consequently, relatively long channels are used for all the transistors in the circuit. This also helps reduce their flicker noise.\n\n#### Example 12.1\n\nAssuming $\\lambda \\neq 0$ in Fig. 12.3(a), estimate the change in $I_{\\text {out }}$ for a small change $\\Delta V_{D D}$ in the supply voltage.\n\n#### Solution\n\nSimplifying the circuit as depicted in Fig. 12.4, where $R_{1}=r_{O 1} \\|\\left(1 / g_{m 1}\\right)$ and $R_{3}=r_{O 3} \\|\\left(1 / g_{m 3}\\right)$, we calculate the \"gain\" from $V_{D D}$ to $I_{\\text {out }}$. The small-signal gate-source voltage of $M_{4}$ equals $-I_{o u t} R_{3}$, and the current through $r_{O 4}$ is $\\left(V_{D D}-V_{X}\\right) / r_{O 4}$. Thus,\n\n$$\n\\begin{equation*}\n\\frac{V_{D D}-V_{X}}{r_{O 4}}+I_{o u t} R_{3} g_{m 4}=\\frac{V_{X}}{R_{1}} \\tag{12.5}\n\\end{equation*}\n$$\n\nIf we denote the equivalent transconductance of $M_{2}$ and $R_{S}$ by $G_{m 2}=I_{\\text {out }} / V_{X}$, then\n\n$$\n\\begin{equation*}\n\\frac{I_{\\text {out }}}{V_{D D}}=\\frac{1}{r_{O 4}}\\left[\\frac{1}{G_{m 2}\\left(r_{O 4} \\| R_{1}\\right)}-g_{m 4} R_{3}\\right]^{-1} \\tag{12.6}\n\\end{equation*}\n$$\n\nAs noted in Chapter 3,\n\n$$\n\\begin{equation*}\nG_{m 2}=\\frac{g_{m 2} r_{O 2}}{R_{S}+r_{O 2}+\\left(g_{m 2}+g_{m b 2}\\right) R_{S} r_{O 2}} \\tag{12.7}\n\\end{equation*}\n$$\n\nInterestingly, the sensitivity disappears if $r_{O 4}=\\infty$.\n\nIn some applications, the sensitivity given by (12.6) is prohibitively high. Additionally, due to various capacitive paths, the supply sensitivity of the circuit increases at high frequencies. For these reasons, the supply voltage of the core is often derived from a locally-generated, less sensitive voltage. We revisit this point in Sec. 12.8.\n\nAn important issue in supply-independent biasing is the presence of \"degenerate\" bias points. For example, in the circuit of Fig. 12.3(a), if all the transistors carry zero current when the supply is turned on, they may remain off indefinitely because the loop can support a zero current in both branches. This condition is not predicted by (12.4) because in manipulating (12.3), we divided both sides by $\\sqrt{I_{o u t}}$, implicitly assuming that $I_{\\text {out }} \\neq 0$. In other words, the circuit can settle in one of two different operating conditions.\n\nCalled the \"start-up\" problem, the above issue is resolved by adding a mechanism that drives the circuit out of the degenerate bias point when the supply is turned on. Fig. 12.5(a) shows a simple example, where the diode-connected device $M_{5}$ provides a current path from $V_{D D}$ through $M_{3}$ and $M_{1}$ to ground upon start-up. Thus, $M_{3}$ and $M_{1}$, and hence $M_{2}$ and $M_{4}$, cannot remain off. Of course, this technique is practical only if $V_{T H 1}+V_{T H 5}+\\left|V_{T H 3}\\right|<V_{D D}$ and $V_{G S 1}+V_{T H 5}+\\left|V_{G S 3}\\right|>V_{D D}$, the latter to ensure that $M_{5}$ remains off after start-up. Another start-up circuit is analyzed in Problem 12.2.\n\nThe start-up problem generally requires careful analysis and simulation. The supply voltage must be ramped from zero in a dc sweep simulation (such that parasitic capacitances do not cause false start-up) as well as in a transient simulation, and the behavior of the circuit examined for each supply voltage. Fig. 12.5(b) shows an example of the observed behavior in the presence of the start-up circuit. In complex implementations, more than one degenerate point may exist.\n\nFigure 12.5 (a) Addition of start-up device to the circuit of Fig. 12.3(a), and (b) illustration of degenerate point."
},
{
    "text": "Our prior discussions regarding bias currents and current mirrors have tacitly presumed the existence of a stable reference current. Depicted in Fig. 12.1(a), if the reference current $I_{R E F}$ is insensitive to variations in $V_{D D}$ and channel-length modulation of $M_{2}$ and $M_{3}$ is disregarded, then the currents $I_{D 2}$ and $I_{D 3}$ will not be affected by the supply voltage. The challenge we face is the generation of this stable reference current $I_{R E F}$.\n\nThe circuit shown in Fig. 12.1(a) utilizes an ideal current source to create a current mirror biasing circuit. It is composed of three NMOS transistors (M1, M2, M3) and a current source IREF. The output currents ID2 and ID3 are sourced from nodes LOAD1 and LOAD2, respectively. The circuit's purpose is to ensure these currents remain independent of the supply voltage VDD.\n\nFigure 12.1(b) demonstrates a current mirror circuit with a supply-independent biasing method. It employs a resistor R1 to generate a reference current IREF that is less affected by changes in VDD. M1 and M2 form the current mirror, with M2 delivering the output current Iout.\n\nAs a substitute for a current source, we connect a resistor from $V_{D D}$ to the gate of $M_{1}$, as seen in Fig. 12.1(b). However, the output current of this circuit is highly sensitive to $V_{D D}$:\n\n$$\n\\begin{equation*}\n\\Delta I_{\\text {out }}=\\frac{\\Delta V_{D D}}{R_{1}+1 / g_{m 1}} \\cdot \\frac{(W / L)_{2}}{(W / L)_{1}} \\tag{12.1}\n\\end{equation*}\n$$\n\nTo achieve a more stable solution, we propose that the circuit must self-bias, meaning $I_{R E F}$ must be derived from $I_{\\text {out }}$. The concept is that if $I_{\\text {out }}$ is to be entirely independent of $V_{D D}$, then $I_{R E F}$ can be a copy of $I_{\\text {out }}$. Figure 12.2 presents an implementation where $M_{3}$ and $M_{4}$ replicate $I_{\\text {out }}$, thereby establishing $I_{R E F}$. Essentially, $I_{R E F}$ is \"bootstrapped\" to $I_{o u t}$. Given the chosen sizes, we have $I_{\\text {out }}=K I_{R E F}$, assuming channel-length modulation is ignored. It's important to note that since each diode-connected device draws from a current source, $I_{o u t}$ and $I_{R E F}$ are relatively insensitive to $V_{D D}$.\n\nFigure 12.2 showcases a simple circuit that maintains supply-independent currents.\n\nThe currents $I_{\\text {out }}$ and $I_{R E F}$ in Fig. 12.2 show minimal dependence on $V_{D D}$, meaning their magnitude is determined by other parameters. How do we calculate these currents? Interestingly, if $M_{1}-M_{4}$ operate in saturation and $\\lambda \\approx 0$, the circuit is governed by a single equation, $I_{\\text {out }}=K I_{R E F}$, and can sustain any current level! For instance, if we initially set $I_{R E F}$ to be $10 \\mu \\mathrm{~A}$, the resulting $I_{\\text {out }}$ of $K \\times 10 \\mu \\mathrm{~A}$ will circulate around the loop, maintaining these current levels in the left and right branches indefinitely.\n\nTo uniquely determine the currents, we introduce an additional constraint to the circuit, as shown in Fig. 12.3(a). Here, resistor $R_{S}$ reduces the current of $M_{2}$, and the PMOS devices necessitate that $I_{\\text {out }}=I_{R E F}$ due to their identical dimensions and thresholds. We can express this as $V_{G S 1}=V_{G S 2}+I_{D 2} R_{S}$, or\n\n$$\n\\begin{equation*}\n\\sqrt{\\frac{2 I_{\\text {out }}}{\\mu_{n} C_{o x}(W / L)_{N}}}+V_{T H 1}=\\sqrt{\\frac{2 I_{\\text {out }}}{\\mu_{n} C_{o x} K(W / L)_{N}}}+V_{T H 2}+I_{\\text {out }} R_{S} \\tag{12.2}\n\\end{equation*}\n$$\n\nDisregarding body effect, we obtain\n\n$$\n\\begin{equation*}\n\\sqrt{\\frac{2 I_{\\text {out }}}{\\mu_{n} C_{o x}(W / L)_{N}}}\\left(1-\\frac{1}{\\sqrt{K}}\\right)=I_{\\text {out }} R_{S} \\tag{12.3}\n\\end{equation*}\n$$\n\nand thus\n\n$$\n\\begin{equation*}\nI_{\\text {out }}=\\frac{2}{\\mu_{n} C_{o x}(W / L)_{N}} \\cdot \\frac{1}{R_{S}^{2}}\\left(1-\\frac{1}{\\sqrt{K}}\\right)^{2} \\tag{12.4}\n\\end{equation*}\n$$\n\nAs anticipated, the current is independent of the supply voltage (though still influenced by process and temperature).\n\nThe assumption $V_{T H 1}=V_{T H 2}$ introduces some error in the previous calculations because the sources of $M_{1}$ and $M_{2}$ are at different voltages. Figure 12.3(b) illustrates a method to place the resistor in the source of $M_{3}$ while eliminating body effect by connecting the source and bulk of each PMOS transistor. Another solution is described in Problem 12.1.\n\nThe circuits in Figs. 12.3(a) and (b) exhibit minimal supply dependence if channel-length modulation is negligible. Consequently, all transistors in the circuit are designed with relatively long channels, which also helps to minimize their flicker noise.\n\n#### Example 12.1\n\nSuppose $\\lambda \\neq 0$ in Fig. 12.3(a), estimate the change in $I_{\\text {out }}$ for a slight change $\\Delta V_{D D}$ in the supply voltage.\n\n#### Solution\n\nSimplifying the circuit as depicted in Fig. 12.4, where $R_{1}=r_{O 1} \\|\\left(1 / g_{m 1}\\right)$ and $R_{3}=r_{O 3} \\|\\left(1 / g_{m 3}\\right)$, we calculate the \"gain\" from $V_{D D}$ to $I_{\\text {out }}$. The small-signal gate-source voltage of $M_{4}$ equals $-I_{o u t} R_{3}$, and the current through $r_{O 4}$ is $\\left(V_{D D}-V_{X}\\right) / r_{O 4}$. Therefore,\n\n$$\n\\begin{equation*}\n\\frac{V_{D D}-V_{X}}{r_{O 4}}+I_{o u t} R_{3} g_{m 4}=\\frac{V_{X}}{R_{1}} \\tag{12.5}\n\\end{equation*}\n$$\n\nIf we denote the equivalent transconductance of $M_{2}$ and $R_{S}$ by $G_{m 2}=I_{\\text {out }} / V_{X}$, then\n\n$$\n\\begin{equation*}\n\\frac{I_{\\text {out }}}{V_{D D}}=\\frac{1}{r_{O 4}}\\left[\\frac{1}{G_{m 2}\\left(r_{O 4} \\| R_{1}\\right)}-g_{m 4} R_{3}\\right]^{-1} \\tag{12.6}\n\\end{equation*}\n$$\n\nAs noted in Chapter 3,\n\n$$\n\\begin{equation*}\nG_{m 2}=\\frac{g_{m 2} r_{O 2}}{R_{S}+r_{O 2}+\\left(g_{m 2}+g_{m b 2}\\right) R_{S} r_{O 2}} \\tag{12.7}\n\\end{equation*}\n$$\n\nInterestingly, the sensitivity disappears if $r_{O 4}=\\infty$.\n\nIn certain applications, the sensitivity as expressed by (12.6) is unacceptably high. Moreover, due to various capacitive paths, the supply sensitivity of the circuit increases at high frequencies. For these reasons, the supply voltage of the core is often derived from a locally-generated, less sensitive voltage. We will revisit this topic in Sec. 12.8.\n\nAn important consideration in supply-independent biasing is the presence of \"degenerate\" bias points. For instance, in the circuit of Fig. 12.3(a), if all transistors carry zero current when the supply is activated, they may remain off indefinitely because the loop can support zero current in both branches. This condition is not accounted for by (12.4) because in deriving (12.3), we divided both sides by $\\sqrt{I_{o u t}}$, implicitly assuming that $I_{\\text {out }} \\neq 0$. In other words, the circuit can settle in one of two different operating conditions.\n\nThis issue, known as the \"start-up\" problem, is resolved by introducing a mechanism that initializes the circuit out of the degenerate bias point upon power-up. Figure 12.5(a) presents a simple example, where the diode-connected device $M_{5}$ provides a current path from $V_{D D}$ through $M_{3}$ and $M_{1}$ to ground during start-up. Consequently, $M_{3}$ and $M_{1}$, and hence $M_{2}$ and $M_{4}$, cannot remain off. Naturally, this technique is only practical if $V_{T H 1}+V_{T H 5}+\\left|V_{T H 3}\\right|<V_{D D}$ and $V_{G S 1}+V_{T H 5}+\\left|V_{G S 3}\\right|>V_{D D}$, the latter ensuring that $M_{5}$ remains off after start-up. Another start-up circuit is analyzed in Problem 12.2.\n\nThe start-up problem typically requires meticulous analysis and simulation. The supply voltage must be gradually increased from zero in a dc sweep simulation (to prevent parasitic capacitances from causing false start-up) as well as in a transient simulation, with the circuit's behavior examined at each supply voltage. Figure 12.5(b) provides an example of the observed behavior with the start-up circuit in place. In more complex implementations, there may be multiple degenerate points.\n\nFigure 12.5(a) depicts the addition of a start-up device to the circuit of Fig. 12.3(a), and Figure 12.5(b) illustrates the presence of a degenerate point."
},
{
    "text": "Our previous chapters have assumed the availability of a stable \"golden\" reference current. Figure 12.1(a) demonstrates that if $I_{R E F}$ is constant with respect to $V_{D D}$, and the channel-length modulation of $M_{2}$ and $M_{3}$ is ignored, then $I_{D 2}$ and $I_{D 3}$ remain unaffected by the supply voltage. The challenge lies in generating this $I_{R E F}$.\n\nFigure 12.1(a) illustrates a current mirror biasing circuit utilizing an ideal current source. It includes three NMOS transistors (M1, M2, M3) and a current source IREF. The output currents ID2 and ID3 are sourced from nodes LOAD1 and LOAD2, respectively, with the goal of keeping these currents independent of the supply voltage VDD.\n\nFigure 12.1(b) shows a current mirror circuit with a biasing scheme that is independent of the supply voltage. It employs a resistor R1 to generate a reference current IREF that is less susceptible to variations in VDD. M1 and M2 form the current mirror, with M2 providing the output current Iout.\n\nFigure 12.1 depicts current mirror biasing using (a) an ideal current source and (b) a resistor. As an approximation of a current source, we connect a resistor from $V_{D D}$ to the gate of $M_{1}$ [Figure 12.1(b)]. However, the output current of this circuit is highly sensitive to $V_{D D}$:\n\n$$\n\\begin{equation*}\n\\Delta I_{\\text {out }}=\\frac{\\Delta V_{D D}}{R_{1}+1 / g_{m 1}} \\cdot \\frac{(W / L)_{2}}{(W / L)_{1}} \\tag{12.1}\n\\end{equation*}\n$$\n\nTo achieve a less sensitive solution, we postulate that the circuit must self-bias, i.e., $I_{R E F}$ must be derived from $I_{\\text {out }}$. The concept is that if $I_{\\text {out }}$ is to be ultimately independent of $V_{D D}$, then $I_{R E F}$ can mirror $I_{\\text {out }}$. Figure 12.2 shows an implementation where $M_{3}$ and $M_{4}$ replicate $I_{\\text {out }}$, thereby defining $I_{R E F}$. Essentially, $I_{R E F}$ is \"bootstrapped\" to $I_{o u t}$. Assuming channel-length modulation is negligible and with the chosen sizes, we have $I_{\\text {out }}=K I_{R E F}$. Note that, since each diode-connected device is fed from a current source, $I_{o u t}$ and $I_{R E F}$ are relatively independent of $V_{D D}$.\n\nFigure 12.2 presents a simple circuit to establish supply-independent currents.\n\nSince $I_{\\text {out }}$ and $I_{R E F}$ in Figure 12.2 show minimal dependence on $V_{D D}$, their magnitude is determined by other parameters. How do we calculate these currents? Interestingly, if $M_{1}-M_{4}$ operate in saturation and $\\lambda \\approx 0$, then the circuit is governed by a single equation, $I_{\\text {out }}=K I_{R E F}$, and hence can support any current level! For instance, if we initially set $I_{R E F}$ to $10 \\mu \\mathrm{~A}$, the resulting $I_{\\text {out }}$ of $K \\times 10 \\mu \\mathrm{~A}$ \"circulates\" around the loop, maintaining these current levels in the left and right branches indefinitely.\n\nTo uniquely define the currents, we introduce another constraint to the circuit, as shown in Figure 12.3(a). Here, resistor $R_{S}$ reduces the current of $M_{2}$, while the PMOS devices require that $I_{\\text {out }}=I_{R E F}$ due to their identical dimensions and thresholds. We can write $V_{G S 1}=V_{G S 2}+I_{D 2} R_{S}$, or\n\n$$\n\\begin{equation*}\n\\sqrt{\\frac{2 I_{\\text {out }}}{\\mu_{n} C_{o x}(W / L)_{N}}}+V_{T H 1}=\\sqrt{\\frac{2 I_{\\text {out }}}{\\mu_{n} C_{o x} K(W / L)_{N}}}+V_{T H 2}+I_{\\text {out }} R_{S} \\tag{12.2}\n\\end{equation*}\n$$\n\nNeglecting body effect, we have\n\n$$\n\\begin{equation*}\n\\sqrt{\\frac{2 I_{\\text {out }}}{\\mu_{n} C_{o x}(W / L)_{N}}}\\left(1-\\frac{1}{\\sqrt{K}}\\right)=I_{\\text {out }} R_{S} \\tag{12.3}\n\\end{equation*}\n$$\n\nand hence\n\n$$\n\\begin{equation*}\nI_{\\text {out }}=\\frac{2}{\\mu_{n} C_{o x}(W / L)_{N}} \\cdot \\frac{1}{R_{S}^{2}}\\left(1-\\frac{1}{\\sqrt{K}}\\right)^{2} \\tag{12.4}\n\\end{equation*}\n$$\n\nAs expected, the current is independent of the supply voltage (but still a function of process and temperature).\n\nThe assumption $V_{T H 1}=V_{T H 2}$ introduces some error in the preceding calculations because the sources of $M_{1}$ and $M_{2}$ are at different voltages. Figure 12.3(b) shows an alternative implementation that places the resistor in the source of $M_{3}$ while eliminating body effect by connecting the source and bulk of each PMOS transistor. Another solution is described in Problem 12.1.\n\nThe circuits of Figures 12.3(a) and (b) exhibit minimal supply dependence if channel-length modulation is negligible. Consequently, relatively long channels are used for all transistors in the circuit, which also helps reduce their flicker noise.\n\n#### Example 12.1\n\nAssuming $\\lambda \\neq 0$ in Figure 12.3(a), estimate the change in $I_{\\text {out }}$ for a small change $\\Delta V_{D D}$ in the supply voltage.\n\n#### Solution\n\nSimplifying the circuit as depicted in Figure 12.4, where $R_{1}=r_{O 1} \\|\\left(1 / g_{m 1}\\right)$ and $R_{3}=r_{O 3} \\|\\left(1 / g_{m 3}\\right)$, we calculate the \"gain\" from $V_{D D}$ to $I_{\\text {out }}$. The small-signal gate-source voltage of $M_{4}$ equals $-I_{o u t} R_{3}$, and the current through $r_{O 4}$ is $\\left(V_{D D}-V_{X}\\right) / r_{O 4}$. Thus,\n\n$$\n\\begin{equation*}\n\\frac{V_{D D}-V_{X}}{r_{O 4}}+I_{o u t} R_{3} g_{m 4}=\\frac{V_{X}}{R_{1}} \\tag{12.5}\n\\end{equation*}\n$$\n\nIf we denote the equivalent transconductance of $M_{2}$ and $R_{S}$ by $G_{m 2}=I_{\\text {out }} / V_{X}$, then\n\n$$\n\\begin{equation*}\n\\frac{I_{\\text {out }}}{V_{D D}}=\\frac{1}{r_{O 4}}\\left[\\frac{1}{G_{m 2}\\left(r_{O 4} \\| R_{1}\\right)}-g_{m 4} R_{3}\\right]^{-1} \\tag{12.6}\n\\end{equation*}\n$$\n\nFrom Chapter 3, we know that\n\n$$\n\\begin{equation*}\nG_{m 2}=\\frac{g_{m 2} r_{O 2}}{R_{S}+r_{O 2}+\\left(g_{m 2}+g_{m b 2}\\right) R_{S} r_{O 2}} \\tag{12.7}\n\\end{equation*}\n$$\n\nInterestingly, the sensitivity vanishes if $r_{O 4}=\\infty$.\n\nIn some applications, the sensitivity given by (12.6) is prohibitively large. Additionally, due to various capacitive paths, the supply sensitivity of the circuit increases at high frequencies. For these reasons, the supply voltage of the core is often derived from a locally-generated, less sensitive voltage. We will revisit this point in Sec. 12.8.\n\nAn important issue in supply-independent biasing is the existence of \"degenerate\" bias points. In the circuit of Figure 12.3(a), for example, if all transistors carry zero current when the supply is turned on, they may remain off indefinitely because the loop can support zero current in both branches. This condition is not predicted by (12.4) because in manipulating (12.3), we divided both sides by $\\sqrt{I_{o u t}}$, implicitly assuming that $I_{\\text {out }} \\neq 0$. In other words, the circuit can settle in one of two different operating conditions.\n\nThis issue, known as the \"start-up\" problem, is resolved by adding a mechanism that drives the circuit out of the degenerate bias point when the supply is turned on. Figure 12.5(a) shows a simple example, where the diode-connected device $M_{5}$ provides a current path from $V_{D D}$ through $M_{3}$ and $M_{1}$ to ground during start-up. Thus, $M_{3}$ and $M_{1}$, and hence $M_{2}$ and $M_{4}$, cannot remain off. Of course, this technique is practical only if $V_{T H 1}+V_{T H 5}+\\left|V_{T H 3}\\right|<V_{D D}$ and $V_{G S 1}+V_{T H 5}+\\left|V_{G S 3}\\right|>V_{D D}$, the latter to ensure that $M_{5}$ remains off after start-up. Another start-up circuit is analyzed in Problem 12.2.\n\nThe start-up problem generally requires careful analysis and simulation. The supply voltage must be ramped from zero in a dc sweep simulation (to prevent parasitic capacitances from causing false start-up) as well as in a transient simulation, with the behavior of the circuit examined at each supply voltage. Figure 12.5(b) depicts an example of the observed behavior in the presence of the start-up circuit. In complex implementations, more than one degenerate point may exist.\n\nFigure 12.5 (a) shows the addition of a start-up device to the circuit of Figure 12.3(a), and (b) illustrates the degenerate point."
},
{
    "text": "The text provided discusses the design and operation of current mirror biasing circuits, which are essential in analog circuit design for generating stable currents independent of supply voltage variations. It starts by noting the assumption of a stable reference current, $I_{REF}$, in previous chapters. The figure descriptions and the associated extra information describe the circuits in detail, including the components and their connections.\n\nIn Figure 12.1(a), the circuit uses an ideal current source, $I_{REF}$, to generate output currents $I_{D2}$ and $I_{D3}$ that are independent of the supply voltage, $V_{DD}$, under the assumption of no channel-length modulation for transistors $M_2$ and $M_3$. The question of how to generate $I_{REF}$ is then posed.\n\nFigure 12.1(b) shows a circuit that uses a resistor, $R_1$, to create a reference current that is less sensitive to $V_{DD}$ variations. Here, $M_1$ and $M_2$ form the current mirror, and the output current is denoted as $I_{out}$. The text explains that this output current is sensitive to $V_{DD}$ variations and provides a mathematical expression for this sensitivity.\n\nTo address this issue, the text proposes a circuit in Figure 12.2 where $M_3$ and $M_4$ are used to copy $I_{out}$, effectively defining $I_{REF}$. The circuit operates under the assumption of saturation and negligible channel-length modulation, with the relationship $I_{out} = K I_{REF}$.\n\nThe discussion then turns to Figure 12.3, which illustrates a circuit with an added resistor $R_S$ to define the currents more precisely. The text provides a series of equations that describe the operation of the circuit and show how the output current $I_{out}$ can be calculated. It notes that the current is independent of the supply voltage but still depends on process and temperature parameters.\n\nThe text also addresses the \"start-up\" problem, which can occur when the circuit initializes at zero current, potentially leaving it in an undesirable state. Figure 12.5(a) shows a circuit with an added start-up device, $M_5$, to prevent this issue. The figure description explains how the start-up circuit ensures proper biasing of the transistors.\n\nFinally, Figure 12.5(b) is a graph that illustrates the behavior of the drain current $I_{D2}$ as the supply voltage $V_{DD}$ is varied, highlighting the presence of a degenerate point and the eventual stabilization of the current as the voltage increases.\n\nThe text and figures together provide a comprehensive overview of the design considerations and challenges involved in creating stable, supply-independent biasing circuits using current mirrors."
},
{
    "text": "---[Rephrased Text]---\nOur discussions in prior chapters have quietly presumed the availability of a stable \"golden\" reference current. Depicted in Fig. 12.1(a), it is assumed that $I_{R E F}$ remains constant with fluctuations in $V_{D D}$, and any channel-length modulation effects in $M_{2}$ and $M_{3}$ are disregarded, which leads to $I_{D 2}$ and $I_{D 3}$ being unaffected by variations in the power supply. The subsequent inquiry is — how can we generate such a stable $I_{R E F}$?\n\nThe diagrams provided in the text have been translated into textual descriptions as follows:\n- **Figure 12.1(a)** illustrates a current mirror biasing circuit that incorporates an ideal current source. Comprising three NMOS transistors (M1, M2, M3) and a current source labeled IREF, this circuit ensures that the output currents, ID2 and ID3, sourced from LOAD1 and LOAD2 nodes respectively, are maintained regardless of the supply voltage, VDD.\n- **Figure 12.1(b)** presents a circuit that serves as a current mirror with a supply voltage-independent biasing mechanism. A resistor, R1, is employed to generate a reference current, IREF, which is less susceptible to changes in VDD. M1 and M2 are configured as the current mirror, with M2 delivering the output current, Iout.\n\n**Figure 12.2** showcases a simple circuit configuration capable of generating supply-independent currents.\n\n**Figure 12.3** introduces resistor $R_{S}$ to refine the definition of the currents within the circuit and presents an alternative arrangement that mitigates body effect.\n\n**Figure 12.4** is a small-signal model that examines the gain from VDD to Iout by considering the transconductance and output resistances of the transistors and resistors involved.\n\n**Figure 12.5(a)** demonstrates the inclusion of a start-up device within the circuit of Fig. 12.3(a), designed to circumvent degenerate bias points. **Figure 12.5(b)** is an I-V graph that illustrates the behavior of the drain current (I_D2) relative to the supply voltage (V_DD), particularly highlighting the presence of a degenerate point.\n\nAn essential consideration in these circuits is the potential for \"degenerate\" bias points, where transistors may remain off indefinitely if the circuit supports a zero current state. This \"start-up\" issue necessitates the introduction of mechanisms that ensure proper circuit operation upon initial power-up. The analysis and simulation of these circuits, particularly in terms of start-up behavior, are crucial for reliable operation."
}
]