[

{
    "text": "A critical analog component, particularly in data-converter systems, is the sample-and-hold circuit. It's pertinent to note that these circuits are also frequently called \"track-and-hold\" circuits. Generally, these terms are interchangeable, except for certain switched-capacitor sample-and-hold circuits that lack a phase where the output signal follows the input signal. Sample-and-hold circuits are essential in many data-acquisition systems, such as $A / D$ converters. Often, employing a sample-and-hold at the converter's input can significantly reduce errors stemming from minor internal delay discrepancies.\n\nBefore delving into the fundamental principles of sample-and-hold circuits, it's crucial to discuss some performance metrics used for their characterization.\n\n1. The initial parameter is the sampling pedestal or hold step, an error that arises when the circuit transitions from sample to hold mode. During this shift, a minor voltage error occurs, causing the held voltage to differ from the input voltage at the sampling instant. Ideally, this error should be minimal and signal-independent to avoid introducing nonlinear distortion.\n2. Another metric assesses the isolation of the sampled signal from the input signal during hold mode. Ideally, the output voltage should remain unaffected by input voltage changes. However, some signal feedthrough, typically due to parasitic capacitive coupling, is inevitable. Well-designed circuits can substantially reduce this feedthrough.\n3. A third vital parameter is the speed at which the circuit can track an input signal in sample mode. In this mode, the circuit faces both small-signal and large-signal limitations due to its $-3-\\mathrm{dB}$ bandwidth and finite slew rate, respectively. Maximizing both these factors is crucial for high-speed operation.\n4. A less critical limitation in high-speed designs is the droop rate during hold mode. This error manifests as a slow output voltage change, caused by factors like leakage currents from bipolar transistors' finite base currents and reverse-biased junctions. In most CMOS designs, this droop rate is negligible.\n5. The fifth limitation is aperture jitter or aperture uncertainty, an error resulting from variations in the effective sampling time between instances, especially pronounced with high-speed signals. Rapid changes in high-speed input signals can lead to small aperture uncertainties, causing significant deviations from the ideal held voltage.\n\nOther performance parameters, such as dynamic range, linearity, gain, and offset error, are also crucial for sample-and-hold circuits. The next section details the mechanisms behind these errors in specific $\\mathrm{S} / \\mathrm{H}$ examples and outlines design principles to minimize them.\n\nKey Point: Beyond standard analog performance metrics like dynamic range and linearity, sample-and-hold circuits exhibit unique nonidealities, typically characterized by their sampling pedestal, input isolation, tracking bandwidth, slew rate, droop rate, and aperture uncertainty."
},
{
    "text": "A crucial analog building block, particularly in data-converter systems, is the sample-and-hold circuit. It's worth noting that these circuits are also commonly known as \"track-and-hold\" circuits. Generally, these terms are interchangeable, except for certain switched-capacitor sample-and-hold circuits that lack a phase where the output signal follows the input signal. Sample-and-hold circuits are essential in many data-acquisition systems, such as $A / D$ converters. Often, employing a sample-and-hold at the data converter's input can significantly reduce errors stemming from minor differences in the converter's internal delay times.\n\nBefore delving into the fundamental principles of sample-and-hold circuits, it's necessary to discuss some performance parameters used for their characterization.\n\n1. The initial parameter is the sampling pedestal or hold step. This error arises when a sample-and-hold transitions from sample mode to hold mode. During this shift, a slight error in the held voltage occurs, making it differ from the input voltage at the sampling moment. Ideally, this error should be minimal and signal-independent to avoid introducing nonlinear distortion.\n2. Another parameter assesses how well the sampled signal is isolated from the input signal during hold mode. Ideally, the output voltage should remain unaffected by input voltage changes. However, some signal feedthrough, typically due to parasitic capacitive coupling, is inevitable. In well-designed circuits, this feedthrough can be substantially reduced.\n3. A third vital parameter is the speed at which a sample-and-hold can track an input signal in sample mode. In this mode, the circuit faces both small-signal and large-signal limitations due to its $-3-\\mathrm{dB}$ bandwidth and finite slew rate, respectively. Maximizing both these parameters is crucial for high-speed operation.\n4. A less critical limitation in high-speed designs is the droop rate during hold mode. This error represents a gradual change in output voltage, caused by factors like leakage currents from bipolar transistors' finite base currents and reverse-biased junctions. In most CMOS designs, this droop rate is negligible.\n5. The fifth limitation is aperture jitter or aperture uncertainty. This error arises from variations in the effective sampling time between successive sampling instances, becoming more significant with high-speed signals. When sampling high-speed signals, rapid input signal changes can lead to minor aperture uncertainties, causing the held voltage to deviate notably from the ideal value.\n\nOther performance parameters are also crucial for sample-and-hold realization, including dynamic range, linearity, gain, and offset error. The next section describes the mechanisms behind these errors in specific sample-and-hold examples and outlines design principles to minimize them.\n\nKey Point: Beyond standard analog performance metrics like dynamic range and linearity, sample-and-hold circuits exhibit unique nonidealities, typically characterized by their sampling pedestal, input isolation, tracking bandwidth, slew rate, droop rate, and aperture uncertainty."
},
{
    "text": "A crucial analog building block, particularly in data-converter systems, is the sample-and-hold circuit. It's pertinent to note that these circuits are also commonly known as \"track-and-hold\" circuits. Generally, these terms are interchangeable, except for certain switched-capacitor sample-and-hold circuits that lack a phase where the output signal follows the input signal. Sample-and-hold circuits are essential in many data-acquisition systems, such as $A / D$ converters. Often, employing a sample-and-hold at the converter's input can significantly reduce errors stemming from minor discrepancies in the converter's internal delay times.\n\nBefore delving into the fundamental principles of sample-and-hold circuits, it's essential to discuss some performance parameters used for their characterization.\n\n1. The initial parameter is the sampling pedestal or hold step. This error arises when a sample-and-hold transitions from sample mode to hold mode. During this shift, a slight voltage error occurs, making the held voltage differ from the input voltage at the sampling instant. Ideally, this error should be minimal and signal-independent to avoid introducing nonlinear distortion.\n2. Another parameter assesses the isolation of the sampled signal from the input signal during hold mode. Ideally, the output voltage should remain unaffected by input voltage changes. However, some signal feedthrough, typically due to parasitic capacitive coupling, is inevitable. Well-designed sample-and-holds can substantially reduce this feedthrough.\n3. A third vital parameter is the speed at which a sample-and-hold can track an input signal in sample mode. In this mode, the circuit faces both small-signal and large-signal limitations due to its $-3-\\mathrm{dB}$ bandwidth and finite slew rate, respectively. Maximizing both the $-3-\\mathrm{dB}$ bandwidth and slew rate is crucial for high-speed operation.\n4. A less critical limitation in high-speed designs is the droop rate in hold mode. This error manifests as a slow output voltage change, caused by factors like leakage currents from bipolar transistors' finite base currents and reverse-biased junctions. In most CMOS designs, this droop rate is negligible.\n5. A fifth limitation is aperture jitter or aperture uncertainty. This error arises from variations in the effective sampling time between successive sampling instances, becoming more significant with high-speed signals. Specifically, rapid changes in high-speed input signals can lead to minor aperture uncertainties, causing the held voltage to deviate substantially from the ideal value.\n\nOther performance parameters are also vital for realizing effective sample-and-holds. These include dynamic range, linearity, gain, and offset error. The next section details the mechanisms behind these errors in specific sample-and-hold examples and outlines design principles to minimize them.\n\nKey Point: Beyond standard analog performance metrics like dynamic range and linearity, sample-and-hold circuits exhibit unique nonidealities, typically characterized by their sampling pedestal, input isolation, tracking bandwidth, slew rate, droop rate, and aperture uncertainty."
},
{
    "text": "A crucial analog component, particularly in data-converter systems, is the sample-and-hold circuit. It's pertinent to note that these circuits are also commonly known as \"track-and-hold\" circuits. Generally, these terms are interchangeable, except for certain switched-capacitor sample-and-hold circuits that lack a phase where the output signal follows the input signal. Sample-and-hold circuits are essential in many data-acquisition systems, such as $A / D$ converters. Often, employing a sample-and-hold at the data converter's input can significantly reduce errors stemming from minor discrepancies in the converter's internal delay times.\n\nBefore delving into the fundamental principles of sample-and-hold circuits, it's essential to discuss some performance parameters used for their characterization.\n\n1. The initial parameter is the sampling pedestal or hold step, an error that arises when a sample-and-hold transitions from sample mode to hold mode. During this shift, a slight voltage error occurs, causing the held voltage to differ from the input voltage at the sampling instant. Ideally, this error should be minimal and signal-independent to avoid introducing nonlinear distortion.\n2. Another parameter assesses the isolation of the sampled signal from the input signal during hold mode. Ideally, the output voltage should remain unaffected by input voltage changes. However, some signal feedthrough, typically due to parasitic capacitive coupling, is inevitable. Well-designed sample-and-holds can substantially reduce this feedthrough.\n3. A third critical parameter is the speed at which a sample-and-hold can track an input signal in sample mode. In this mode, the circuit faces both small-signal and large-signal limitations due to its $-3-\\mathrm{dB}$ bandwidth and finite slew rate, respectively. Maximizing both the $-3-\\mathrm{dB}$ bandwidth and slew rate is crucial for high-speed operation.\n4. A less critical limitation in high-speed designs is the droop rate in hold mode. This error manifests as a gradual change in output voltage during hold mode, caused by factors like leakage currents from bipolar transistors' finite base currents and reverse-biased junctions. In most CMOS designs, this droop rate is negligible.\n5. The fifth limitation is aperture jitter or aperture uncertainty, an error due to variations in the effective sampling time between consecutive sampling instances. This issue is more pronounced with high-speed signals, where rapid input signal changes can cause small aperture uncertainties, leading to significant deviations from the ideal held voltage.\n\nOther performance parameters are also vital for realizing effective sample-and-holds, including dynamic range, linearity, gain, and offset error. The subsequent section describes the mechanisms behind these errors in specific sample-and-hold examples and outlines design principles to minimize them.\n\nKey Point: Beyond standard analog performance metrics like dynamic range and linearity, sample-and-hold circuits exhibit unique nonidealities, typically characterized by their sampling pedestal, input isolation, tracking bandwidth, slew rate, droop rate, and aperture uncertainty."
},
{
    "text": "A crucial analog building block, particularly in data-converter systems, is the sample-and-hold circuit. It's pertinent to note that these circuits are also frequently called \"track-and-hold\" circuits. Generally, these terms are interchangeable, except for certain switched-capacitor sample-and-hold circuits that lack a phase where the output signal follows the input signal. Sample-and-hold circuits are essential in many data-acquisition systems, such as $A / D$ converters. Often, employing a sample-and-hold at the converter's input can significantly reduce errors stemming from minor discrepancies in the converter's internal delay times.\n\nBefore delving into the fundamental principles of sample-and-hold circuits, it's essential to discuss some performance parameters used for their characterization.\n\n1. The initial parameter is the sampling pedestal or hold step. This error arises when a sample-and-hold transitions from sample mode to hold mode. During this shift, a slight voltage error occurs, causing the held voltage to differ from the input voltage at the sampling instant. Ideally, this error should be minimal and signal-independent to avoid introducing nonlinear distortion.\n2. Another parameter assesses the isolation of the sampled signal from the input signal during hold mode. Ideally, the output voltage should remain unaffected by input voltage changes. However, some signal feedthrough, typically due to parasitic capacitive coupling, is inevitable. Well-designed sample-and-holds can substantially reduce this feedthrough.\n3. A third vital parameter is the tracking speed of a sample-and-hold in sample mode. In this mode, the circuit faces both small-signal and large-signal limitations due to its $-3-\\mathrm{dB}$ bandwidth and finite slew rate, respectively. Maximizing both the $-3-\\mathrm{dB}$ bandwidth and slew rate is crucial for high-speed operation.\n4. A less critical limitation in high-speed designs is the droop rate during hold mode. This error manifests as a slow output voltage change, caused by factors like leakage currents from bipolar transistors' finite base currents and reverse-biased junctions. In most CMOS designs, this droop rate is negligible.\n5. A fifth limitation is aperture jitter or aperture uncertainty. This error arises from variations in the effective sampling time between consecutive sampling instances, becoming more significant with high-speed signals. Rapid changes in high-speed input signals can lead to minor aperture uncertainties, causing the held voltage to deviate from the ideal value.\n\nOther performance parameters are also crucial for realizing effective sample-and-holds. These include dynamic range, linearity, gain, and offset error. The next section describes the mechanisms behind these errors in specific sample-and-hold examples and outlines design principles to minimize them.\n\nKey Point: Beyond standard analog performance metrics like dynamic range and linearity, sample-and-hold circuits exhibit unique nonidealities, often characterized by their sampling pedestal, input isolation, tracking bandwidth, slew rate, droop rate, and aperture uncertainty."
},
{
    "text": "A crucial analog component, particularly in data-converter systems, is the sample-and-hold circuit. It's pertinent to note that these circuits are also commonly known as \"track-and-hold\" circuits. Generally, these terms are interchangeable, except for certain switched-capacitor sample-and-hold circuits that lack a phase where the output signal follows the input signal. Sample-and-hold circuits are essential in numerous data-acquisition systems, such as $A / D$ converters. Often, employing a sample-and-hold at the converter's input can significantly reduce errors stemming from minor internal delay variations.\n\nBefore delving into the fundamental principles of sample-and-hold circuits, it's essential to discuss some performance metrics used for their characterization.\n\n1. The initial parameter is the sampling pedestal or hold step, an error that arises when a sample-and-hold transitions from sample to hold mode. During this shift, a minor voltage error occurs, causing the held voltage to differ from the input voltage at the sampling instant. Ideally, this error should be minimal and signal-independent to avoid introducing nonlinear distortion.\n2. Another metric assesses the isolation of the sampled signal from the input signal during hold mode. Ideally, the output voltage should remain unaffected by input voltage changes. However, some signal feedthrough, typically due to parasitic capacitive coupling, is inevitable. Well-designed sample-and-holds can substantially reduce this feedthrough.\n3. A third vital parameter is the speed at which a sample-and-hold can track an input signal in sample mode. In this mode, the circuit faces both small-signal and large-signal limitations due to its $-3-\\mathrm{dB}$ bandwidth and finite slew rate, respectively. Maximizing both these parameters is crucial for high-speed operation.\n4. A less critical limitation in high-speed designs is the droop rate in hold mode. This error manifests as a gradual output voltage change, caused by factors like leakage currents from bipolar transistors' finite base currents and reverse-biased junctions. In most CMOS designs, this droop rate is negligible.\n5. A fifth limitation is aperture jitter or aperture uncertainty, which arises from variations in the effective sampling time between consecutive samples. This issue becomes more pronounced with high-speed signals, where rapid input signal changes can lead to significant discrepancies between the held voltage and the ideal held voltage.\n\nAdditional performance parameters are also crucial for sample-and-hold realization, including dynamic range, linearity, gain, and offset error. The subsequent section details the mechanisms behind these errors in specific sample-and-hold examples and outlines design principles to minimize them.\n\nKey Point: Beyond standard analog performance metrics like dynamic range and linearity, sample-and-hold circuits exhibit unique nonidealities, typically characterized by their sampling pedestal, input isolation, tracking bandwidth, slew rate, droop rate, and aperture uncertainty."
},
{
    "text": "A critical analog component, particularly in data-converter systems, is the sample-and-hold circuit. It's pertinent to note that these circuits are also commonly known as \"track-and-hold\" circuits. Generally, these terms are interchangeable, except for certain switched-capacitor sample-and-hold circuits that lack a phase where the output signal follows the input signal. Sample-and-hold circuits are essential in many data-acquisition systems, such as $A / D$ converters. Often, employing a sample-and-hold at the data converter's input can significantly reduce errors stemming from minor discrepancies in the converter's internal timing.\n\nBefore delving into the fundamental principles of sample-and-hold circuits, it's crucial to discuss some performance metrics used for their characterization.\n\n1. The initial parameter is the sampling pedestal or hold step. This error arises when a sample-and-hold transitions from sample mode to hold mode. During this shift, a slight voltage discrepancy occurs, making the held voltage differ from the input voltage at the sampling instant. Ideally, this error should be minimal and signal-independent to avoid introducing nonlinear distortion.\n2. Another metric assesses the isolation of the sampled signal from the input signal during hold mode. Ideally, the output voltage should remain unaffected by input voltage changes. However, some signal feedthrough, typically due to parasitic capacitive coupling, is inevitable. Well-designed sample-and-holds can substantially reduce this feedthrough.\n3. A third vital parameter is the speed at which a sample-and-hold can track an input signal in sample mode. In this mode, the circuit faces both small-signal and large-signal limitations due to its $-3-\\mathrm{dB}$ bandwidth and finite slew rate, respectively. Maximizing both the $-3-\\mathrm{dB}$ bandwidth and slew rate is essential for high-speed performance.\n4. A less critical limitation in high-speed designs is the droop rate in hold mode. This error manifests as a slow output voltage change, caused by factors like leakage currents from bipolar transistors' finite base currents and reverse-biased junctions. In most CMOS designs, this droop rate is negligible.\n5. A fifth limitation is aperture jitter or aperture uncertainty. This error arises from variations in the effective sampling time between successive samples, becoming more significant with high-speed signals. Rapid changes in high-speed input signals can lead to minor aperture uncertainties, causing significant deviations in the held voltage from the ideal value.\n\nOther performance parameters are also crucial for sample-and-hold realization, including dynamic range, linearity, gain, and offset error. The next section describes the mechanisms behind these errors in specific sample-and-hold examples and outlines design principles to mitigate them.\n\nKey Point: Beyond standard analog performance metrics like dynamic range and linearity, sample-and-hold circuits exhibit unique nonidealities, typically characterized by their sampling pedestal, input isolation, tracking bandwidth, slew rate, droop rate, and aperture uncertainty."
},
{
    "text": "A crucial analog component, particularly in data-converter systems, is the sample-and-hold circuit. It's pertinent to note that these circuits are also commonly known as \"track-and-hold\" circuits. Generally, these terms are interchangeable, except for certain switched-capacitor sample-and-hold circuits that lack a phase where the output signal follows the input signal. Sample-and-hold circuits are essential in many data-acquisition systems, such as $A / D$ converters. Often, employing a sample-and-hold at the converter's input can significantly reduce errors stemming from minor internal delay discrepancies.\n\nBefore delving into the fundamental principles of sample-and-hold circuits, it's essential to discuss some performance metrics used for their characterization.\n\n1. The initial parameter is the sampling pedestal or hold step, an error that arises when a sample-and-hold transitions from sample to hold mode. During this shift, a slight voltage error occurs, making the held voltage differ from the input voltage at the sampling instant. Ideally, this error should be minimal and signal-independent to avoid introducing nonlinear distortion.\n2. Another metric assesses the isolation of the sampled signal from the input signal during hold mode. Ideally, the output voltage should remain unaffected by input voltage changes. However, some signal feedthrough, typically due to parasitic capacitive coupling, is inevitable. Well-designed sample-and-holds can substantially reduce this feedthrough.\n3. A third critical parameter is the tracking speed of a sample-and-hold in sample mode. In this mode, the circuit faces both small-signal and large-signal limitations due to its $-3-\\mathrm{dB}$ bandwidth and finite slew rate, respectively. Maximizing both these parameters is crucial for high-speed operation.\n4. A less significant limitation in high-speed designs is the droop rate in hold mode. This error manifests as a slow output voltage change, caused by factors like leakage currents from bipolar transistors' finite base currents and reverse-biased junctions. In most CMOS designs, this droop rate is negligible.\n5. A fifth limitation is aperture jitter or aperture uncertainty, which arises from variations in the effective sampling time between instances. This error is more pronounced with high-speed signals, where rapid input signal changes can cause small aperture uncertainties, leading to significant deviations from the ideal held voltage.\n\nOther performance parameters, such as dynamic range, linearity, gain, and offset error, are also vital for sample-and-holds. The subsequent section describes the mechanisms behind these errors in specific $\\mathrm{S} / \\mathrm{H}$ examples and outlines design principles to mitigate them.\n\nKey Point: Beyond standard analog performance metrics like dynamic range and linearity, sample-and-hold circuits exhibit unique nonidealities, often characterized by their sampling pedestal, input isolation, tracking bandwidth, slew rate, droop rate, and aperture uncertainty."
},
{
    "text": "Before delving into various $\\mathrm{S} / \\mathrm{H}$ architectures, it's essential to first outline a widely-used method for testing $\\mathrm{S} / \\mathrm{Hs}$, known as the beat test. This test involves operating the $\\mathrm{S} / \\mathrm{H}$ at its peak clock frequency and applying a sinusoidal input signal whose frequency slightly differs from the clock frequency. ${ }^{1}$ The system's output is then demodulated to a lower frequency, equivalent to the difference between the clock signal's frequency and the input signal's frequency. This low-frequency signal is subsequently analyzed using a spectrum analyzer or by digitizing it with a\n\nKey Point: The beat test enables the characterization of a sample-and-hold (or A/D converter) at its maximum clock frequency, while only requiring the monitoring of a relatively low-frequency output signal.\nhigh-precision A/D converter clocked at the difference frequency, followed by computer analysis. The setup for a beat test is depicted in Fig. 11.1. Example waveforms for the input signal, the sampling signal, and the sample-and-hold's output signal are illustrated in Fig. 11.2. Note that this test facilitates the characterization of a S/H while it operates at its maximum clock frequency, yet only necessitates the monitoring of a relatively low-frequency output signal.\nimage_name:Fig. 11.1\ndescription:Fig. 11.1 presents a system block diagram for a test setup designed to characterize a sample-and-hold (S/H) circuit using a beat test. The primary components of this setup are:\n\n1. **Input Signal (Vin):** The system input is a sinusoidal signal described by \\( V_{in} = A_{in} \\sin[2\\pi(f_{smpl} + \\Delta f)t] \\). This indicates the input signal has a frequency component of \\( f_{smpl} + \\Delta f \\), where \\( f_{smpl} \\) is the sampling frequency and \\( \\Delta f \\) is the difference frequency.\n\n2. **Sample-and-Hold Circuit (S/H):** The central component is the S/H block, which samples the input signal. It is controlled by a clock signal (Clk) with a sampling frequency of \\( f_{smpl} \\). The clock signal \\( \\phi_{smpl} \\) governs the timing of the sampling process.\n\n3. **Output Signal:** The S/H circuit's output is an analog signal at the difference frequency \\( \\Delta f \\). This output is then routed to two different analysis components.\n\n4. **Spectrum Analyzer:** One output path is directed to a spectrum analyzer, which examines the frequency components of the output signal, allowing for the analysis of the beat frequency \\( \\Delta f \\).\n\n5. **A/D Converter and Computer:** The other output path goes to an analog-to-digital converter (A/D) and a computer system. This setup digitizes the output signal for further analysis and processing using computational tools.\n\n**Flow of Information:**\n- The input sinusoidal signal \\( V_{in} \\) enters the S/H block, where it is sampled based on the clock signal \\( \\phi_{smpl} \\).\n- The sampled signal, now at frequency \\( \\Delta f \\), is split and sent to both the spectrum analyzer and the A/D converter for analysis.\n\n**Overall System Function:**\nThe main function of this setup is to evaluate the performance of the sample-and-hold circuit by analyzing its output at a specific beat frequency. This allows for precise measurements of the S/H performance while operating at maximum clock frequency, by simplifying the monitoring to a lower frequency output.\n\nFig. 11.1 The test setup for characterizing a sample-and-hold using a beat test.\n\n1. If the circuit under test is a track and hold, the output of the first track and hold would be resampled by a second track and hold clocked in the opposite phase to the original.\nimage_name:Fig. 11.2\ndescription:Fig. 11.2 displays a time-domain waveform graph illustrating the behavior of a sample-and-hold circuit. It includes two waveforms: the input signal and the sample-and-hold's output signal.\n\n1. **Type of Graph and Function:**\n- The graph is a time-domain waveform plot.\n\n2. **Axes Labels and Units:**\n- The axes are not explicitly labeled, but it can be inferred that the horizontal axis represents time and the vertical axis represents signal amplitude (voltage).\n- The scale appears linear, with no specific units or markers indicated.\n\n3. **Overall Behavior and Trends:**\n- The input signal is a continuous sinusoidal wave, depicted as a smooth curve with regular peaks and troughs.\n- The sample-and-hold's output signal is shown as a stepped waveform, holding the sampled values of the input signal at regular intervals, forming a staircase-like pattern.\n- The output remains constant between sampling points, reflecting the hold phase of the sample-and-hold operation.\n\n4. **Key Features and Technical Details:**\n- The input signal oscillates smoothly, indicating a continuous sinusoidal function.\n- The output signal captures and holds the peak values of the input signal at specific intervals, demonstrating the sample-and-hold effect.\n- Key features include the transition points of the output waveform between held values, coinciding with the peaks of the input sinusoid.\n\n5. **Annotations and Specific Data Points:**\n- The graph includes annotations for the 'Input signal' and 'Output signal of sample-and-hold.'\n- No numerical values or specific data points are marked on the graph.\n\nOverall, the graph effectively illustrates how a sample-and-hold circuit samples a continuous input signal and produces a discrete output by holding sampled values over time.\n\nSampling signal\nFig. 11.2 Example waveforms for the test setup of Fig. 11.1.\n\nIf a computer is utilized for analysis, the signal is typically curve-fitted to a sinusoidal wave at the beat (i.e., difference) frequency. This ideal closest-fit sinusoid is then subtracted from the measured signal, and the error signal is analyzed for RMS content and spectral components using a fast-Fourier transform.\n\nIt's worth noting that a very similar test setup can be employed for analog-to-digital converters, where the $\\mathrm{A} / \\mathrm{D}$ converter's output would be digitally loaded into a computer for analysis."
},
{
    "text": "Before delving into various $\\mathrm{S} / \\mathrm{H}$ architectures, it is essential to first outline a widely-used method for testing $\\mathrm{S} / \\mathrm{Hs}$, known as the beat test. This test involves operating the $\\mathrm{S} / \\mathrm{H}$ at its highest clock frequency and applying a sinusoidal input signal with a frequency slightly differing from the clock frequency. ${ }^{1}$ The system's output is then demodulated to a low frequency corresponding to the difference between the clock signal's frequency and the input signal's frequency. This low-frequency signal is subsequently analyzed using a spectrum analyzer or by digitizing it with a\n\nKey Point: The beat test enables the characterization of a sample-and-hold (or A/D converter) at its maximum clock frequency while only needing to monitor a relatively low-frequency output signal.\nhigh-precision A/D converter clocked at the difference frequency, followed by computer analysis. The setup for a beat test is depicted in Fig. 11.1. Example waveforms for the input signal, the sampling signal, and the sample-and-hold output signal are illustrated in Fig. 11.2. Note that this test permits the characterization of an S/H while it operates at its maximum clock frequency, yet only a relatively low-frequency output signal needs to be monitored.\nimage_name:Fig. 11.1\ndescription:Fig. 11.1 presents a system block diagram for a test setup used to characterize a sample-and-hold (S/H) circuit via a beat test. The primary components of this setup are:\n\n1. **Input Signal (Vin):** The system's input is a sinusoidal signal described by \\( V_{in} = A_{in} \\sin[2\\pi(f_{smpl} + \\Delta f)t] \\). This indicates the input signal has a frequency component of \\( f_{smpl} + \\Delta f \\), where \\( f_{smpl} \\) is the sampling frequency and \\( \\Delta f \\) is the difference frequency.\n\n2. **Sample-and-Hold Circuit (S/H):** The central component is the S/H block, which samples the input signal. It is controlled by a clock signal (Clk) with a sampling frequency \\( f_{smpl} \\). The clock signal \\( \\phi_{smpl} \\) governs the timing of the sampling.\n\n3. **Output Signal:** The S/H circuit's output is an analog signal at the difference frequency \\( \\Delta f \\). This output is then routed to two different analysis components.\n\n4. **Spectrum Analyzer:** One output path is directed to a spectrum analyzer, which examines the frequency components of the output signal, focusing on the beat frequency \\( \\Delta f \\).\n\n5. **A/D Converter and Computer:** The other output path leads to an analog-to-digital converter (A/D) and a computer system. This setup digitizes the output signal for further computational analysis and processing.\n\n**Flow of Information:**\n- The input sinusoidal signal \\( V_{in} \\) enters the S/H block, where it is sampled according to the clock signal \\( \\phi_{smpl} \\).\n- The sampled signal, now at frequency \\( \\Delta f \\), is split and sent to both the spectrum analyzer and the A/D converter for analysis.\n\n**Overall System Function:**\nThe main purpose of this setup is to evaluate the performance of the sample-and-hold circuit by analyzing its output at a specific beat frequency. This allows for precise measurements of the S/H performance at maximum clock frequency by simplifying the monitoring to a lower frequency output.\n\nFig. 11.1 The test setup for characterizing a sample-and-hold using a beat test.\n\n1. If the circuit under test is a track and hold, the output of the track and hold would be resampled by a second track and hold clocked in the opposite phase to the original.\nimage_name:Fig. 11.2\ndescription:Fig. 11.2 displays a time-domain waveform graph illustrating the behavior of a sample-and-hold circuit. It includes two waveforms: the input signal and the sample-and-hold output signal.\n\n1. **Type of Graph and Function:**\n- The graph is a time-domain waveform plot.\n\n2. **Axes Labels and Units:**\n- The axes are not explicitly labeled, but it is inferred that the horizontal axis represents time and the vertical axis represents signal amplitude (voltage).\n- The scale is linear, with no specific units or markers indicated.\n\n3. **Overall Behavior and Trends:**\n- The input signal is a continuous sinusoidal wave, depicted as a smooth curve with regular peaks and troughs.\n- The sample-and-hold output signal is shown as a stepped waveform, holding the sampled values of the input signal at regular intervals, forming a staircase pattern.\n- The output remains constant between sampling points, reflecting the hold phase of the sample-and-hold operation.\n\n4. **Key Features and Technical Details:**\n- The input signal oscillates smoothly, indicating a continuous sinusoidal function.\n- The output signal captures and holds the peak values of the input signal at specific intervals, demonstrating the sample-and-hold effect.\n- Key features include the transition points of the output waveform between held values, aligning with the peaks of the input sinusoid.\n\n5. **Annotations and Specific Data Points:**\n- The graph includes annotations for the 'Input signal' and 'Output signal of sample-and-hold.'\n- No numerical values or specific data points are marked on the graph.\n\nOverall, the graph effectively illustrates how a sample-and-hold circuit samples a continuous input signal and produces a discrete output by holding sampled values over time.\n\nSampling signal\nFig. 11.2 Example waveforms for the test setup of Fig. 11.1.\n\nWhen a computer is used for analysis, the signal is typically curve-fitted to a sinusoidal wave at the beat (i.e., difference) frequency. This ideal closest-fit sinusoid is then subtracted from the measured signal, and the error signal is analyzed for RMS content and spectral components using a fast-Fourier transform.\n\nIt is worth noting that a similar test setup can be employed for analog-to-digital converters, where the $\\mathrm{A} / \\mathrm{D}$ converter's output is digitally loaded into a computer for analysis."
},
{
    "text": "Prior to detailing various $\\mathrm{S} / \\mathrm{H}$ architectures, it is fitting to initially outline a widely-used method for evaluating $\\mathrm{S} / \\mathrm{Hs}$, known as the beat test. This assessment involves operating the $\\mathrm{S} / \\mathrm{H}$ at its peak clock frequency and introducing a sinusoidal input signal with a frequency slightly divergent from the clock frequency. ${ }^{1}$ The system's output is then demodulated to a low frequency corresponding to the disparity between the clock signal's frequency and the input signal's frequency. This low-frequency signal is subsequently analyzed using a spectrum analyzer or by digitizing it via a\n\nKey Point: The beat test permits the characterization of a sample-and-hold (or A/D converter) at its maximum clock frequency while only observing a relatively low-frequency output signal.\nhigh-precision A/D converter timed at the difference frequency, followed by computer analysis. The configuration for a beat test is depicted in Fig. 11.1. Representative waveforms for the input signal, the sampling signal, and the sample-and-hold output signal are illustrated in Fig. 11.2. It should be noted that this test enables the characterization of an S/H while it operates at its highest clock frequency, yet only requires monitoring a relatively low-frequency output signal.\nimage_name:Fig. 11.1\ndescription:The block diagram in Fig. 11.1 depicts a test configuration for assessing a sample-and-hold (S/H) circuit using a beat test. The primary components of this setup are:\n\n1. **Input Signal (Vin):** The system input is a sinusoidal signal described by \\( V_{in} = A_{in} \\sin[2\\pi(f_{smpl} + \\Delta f)t] \\). This signifies that the input signal has a frequency component of \\( f_{smpl} + \\Delta f \\), where \\( f_{smpl} \\) is the sampling frequency and \\( \\Delta f \\) is the difference frequency.\n\n2. **Sample-and-Hold Circuit (S/H):** The central element is the S/H block, which samples the input signal. It is governed by a clock signal (Clk) with a sampling frequency of \\( f_{smpl} \\). The clock signal \\( \\phi_{smpl} \\) dictates the timing of the sampling process.\n\n3. **Output Signal:** The S/H circuit's output is an analog signal at the difference frequency \\( \\Delta f \\). This output is then routed to two distinct analysis components.\n\n4. **Spectrum Analyzer:** One output path is directed to a spectrum analyzer. This device examines the frequency components of the output signal, facilitating the analysis of the beat frequency \\( \\Delta f \\).\n\n5. **A/D Converter and Computer:** The other output path is sent to an analog-to-digital converter (A/D) and a computer system. This setup converts the output signal into digital form for further analysis and processing using computational tools.\n\n**Information Flow:**\n- The input sinusoidal signal \\( V_{in} \\) enters the S/H block, where it is sampled according to the clock signal \\( \\phi_{smpl} \\).\n- The sampled signal, now at frequency \\( \\Delta f \\), is divided and sent to both the spectrum analyzer and the A/D converter for analysis.\n\n**System Function:**\nThe main purpose of this setup is to evaluate the performance of the sample-and-hold circuit by analyzing its output at a specific beat frequency. This allows for precise measurements of the S/H performance while operating at maximum clock frequency, by simplifying the monitoring to a lower frequency output.\n\nFig. 11.1 The configuration for characterizing a sample-and-hold using a beat test.\n\n1. If the tested circuit is a track and hold, the output of the track and hold would be resampled by a second track and hold clocked in the opposite phase to the original.\nimage_name:Fig. 11.2\ndescription:Fig. 11.2 presents a time-domain waveform graph illustrating the behavior of a sample-and-hold circuit. It includes two waveforms: the input signal and the sample-and-hold output signal.\n\n1. **Graph Type and Function:**\n- The graph is a time-domain waveform plot.\n\n2. **Axes Labels and Units:**\n- The axes are not explicitly labeled, but it is inferred that the horizontal axis represents time and the vertical axis represents signal amplitude (voltage).\n- The scale appears linear, with no specific units or markers indicated.\n\n3. **Behavior and Trends:**\n- The input signal is a continuous sinusoidal wave, displayed as a smooth curve with regular peaks and troughs.\n- The sample-and-hold output signal is shown as a stepped waveform. It retains the sampled values of the input signal at regular intervals, forming a staircase-like pattern.\n- The output remains constant between sampling points, reflecting the hold phase of the sample-and-hold operation.\n\n4. **Key Features and Technical Details:**\n- The input signal oscillates smoothly, indicating a continuous sinusoidal function.\n- The output signal captures and holds the peak values of the input signal at specific intervals, demonstrating the sample-and-hold effect.\n- Key features include the transition points of the output waveform between held values, aligning with the peaks of the input sinusoid.\n\n5. **Annotations and Data Points:**\n- The graph includes annotations marking the 'Input signal' and 'Output signal of sample-and-hold.'\n- No numerical values or specific data points are marked on the graph.\n\nOverall, the graph effectively illustrates how a sample-and-hold circuit samples a continuous input signal and generates a discrete output by holding sampled values over time.\n\nSampling signal\nFig. 11.2 Example waveforms for the test setup of Fig. 11.1.\n\nWhen a computer is employed for analysis, the signal is typically curve-fitted to a sinusoidal wave at the beat (i.e., difference) frequency. This ideal closest-fit sinusoid is then subtracted from the measured signal, and the error signal is analyzed for RMS content and spectral components using a fast-Fourier transform.\n\nIt is worth noting that a similar test setup can be applied to analog-to-digital converters, in which case the $\\mathrm{A} / \\mathrm{D}$ converter's output would be digitally transferred to a computer for analysis."
},
{
    "text": "Before delving into various $\\mathrm{S} / \\mathrm{H}$ architectures, it is essential to first outline a widely-used method for evaluating $\\mathrm{S} / \\mathrm{Hs}$, known as the beat test. This test involves operating the $\\mathrm{S} / \\mathrm{H}$ at its highest clock frequency and applying a sinusoidal input signal whose frequency slightly differs from the clock frequency. ${ }^{1}$ The system's output is then demodulated to a low frequency corresponding to the difference between the clock signal frequency and the input signal frequency. This low-frequency signal is subsequently analyzed using a spectrum analyzer or by digitizing it with a\n\nKey Point: The beat test enables the characterization of a sample-and-hold (or A/D converter) at its maximum clock frequency while only needing to monitor a relatively low-frequency output signal.\nhigh-precision A/D converter clocked at the difference frequency, followed by computer analysis. The setup for a beat test is depicted in Fig. 11.1. Example waveforms for the input signal, the sampling signal, and the sample-and-hold output signal are illustrated in Fig. 11.2. Note that this test allows for the characterization of an S/H while it operates at its maximum clock frequency, yet only requires monitoring of a relatively low-frequency output signal.\nimage_name:Fig. 11.1\ndescription:Fig. 11.1 presents a system block diagram for a test setup used to characterize a sample-and-hold (S/H) circuit via a beat test. The main components of this setup are:\n\n1. **Input Signal (Vin):** The system's input is a sinusoidal signal described by \\( V_{in} = A_{in} \\sin[2\\pi(f_{smpl} + \\Delta f)t] \\). This indicates that the input signal has a frequency component of \\( f_{smpl} + \\Delta f \\), where \\( f_{smpl} \\) is the sampling frequency and \\( \\Delta f \\) is the difference frequency.\n\n2. **Sample-and-Hold Circuit (S/H):** The central component is the S/H block, which samples the input signal. It is controlled by a clock signal (Clk) with a sampling frequency of \\( f_{smpl} \\). The clock signal \\( \\phi_{smpl} \\) governs the timing of the sampling process.\n\n3. **Output Signal:** The S/H circuit's output is an analog signal at the difference frequency \\( \\Delta f \\). This output is then routed to two different analysis components.\n\n4. **Spectrum Analyzer:** One output path is directed to a spectrum analyzer, which examines the frequency components of the output signal, allowing for the analysis of the beat frequency \\( \\Delta f \\).\n\n5. **A/D Converter and Computer:** The other output path is sent to an analog-to-digital converter (A/D) and a computer system. This setup digitizes the output signal for further analysis and processing using computational tools.\n\n**Flow of Information:**\n- The input sinusoidal signal \\( V_{in} \\) enters the S/H block, where it is sampled based on the clock signal \\( \\phi_{smpl} \\).\n- The sampled signal, now at frequency \\( \\Delta f \\), is split and sent to both the spectrum analyzer and the A/D converter for analysis.\n\n**Overall System Function:**\nThe primary purpose of this setup is to evaluate the performance of the sample-and-hold circuit by analyzing its output at a specific beat frequency. This facilitates high-accuracy measurements of the S/H performance while operating at maximum clock frequency, by simplifying the monitoring to a lower frequency output.\n\nFig. 11.1 The test setup for characterizing a sample-and-hold using a beat test.\n\n1. If the circuit under test is a track and hold, the output of the track and hold would be resampled by a second track and hold clocked in the opposite phase to the original.\nimage_name:Fig. 11.2\ndescription:Fig. 11.2 displays a time-domain waveform graph illustrating the behavior of a sample-and-hold circuit. It includes two waveforms: the input signal and the sample-and-hold output signal.\n\n1. **Type of Graph and Function:**\n- The graph is a time-domain waveform plot.\n\n2. **Axes Labels and Units:**\n- The axes are not explicitly labeled, but it can be inferred that the horizontal axis represents time and the vertical axis represents signal amplitude (voltage).\n- The scale appears linear, with no specific units or markers indicated.\n\n3. **Overall Behavior and Trends:**\n- The input signal is a continuous sinusoidal wave, depicted as a smooth curve with regular peaks and troughs.\n- The sample-and-hold output signal is shown as a stepped waveform, holding the sampled values of the input signal at regular intervals, forming a staircase-like pattern.\n- The output remains constant between sampling points, reflecting the hold phase of the sample-and-hold operation.\n\n4. **Key Features and Technical Details:**\n- The input signal oscillates smoothly, indicating a continuous sinusoidal function.\n- The output signal captures and holds the peak values of the input signal at specific intervals, demonstrating the sample-and-hold effect.\n- Key features include the transition points of the output waveform between held values, coinciding with the peaks of the input sinusoid.\n\n5. **Annotations and Specific Data Points:**\n- The graph includes annotations labeling the 'Input signal' and 'Output signal of sample-and-hold.'\n- No numerical values or specific data points are marked on the graph.\n\nOverall, the graph effectively illustrates how a sample-and-hold circuit samples a continuous input signal and produces a discrete output by holding sampled values over time.\n\nSampling signal\nFig. 11.2 Example waveforms for the test setup of Fig. 11.1.\n\nIf a computer is used for analysis, the signal would typically be curve-fitted to a sinusoidal wave at the beat (i.e., difference) frequency. This ideal closest-fit sinusoid would then be subtracted from the measured signal, and the error signal would be analyzed for RMS content and spectral components using a fast-Fourier transform.\n\nIt is worth noting that a very similar test setup can be employed for analog-to-digital converters, in which case the output of the $\\mathrm{A} / \\mathrm{D}$ converter would be digitally loaded into a computer for analysis."
},
{
    "text": "Prior to detailing various $\\mathrm{S} / \\mathrm{H}$ architectures, it is pertinent to initially outline a widely-used technique for evaluating $\\mathrm{S} / \\mathrm{Hs}$, known as the beat test. This assessment involves operating the $\\mathrm{S} / \\mathrm{H}$ at its peak clock frequency and introducing a sinusoidal input signal with a frequency slightly divergent from the clock frequency. ${ }^{1}$ The system's output is then demodulated to a low frequency corresponding to the disparity between the clock signal's frequency and the input signal's frequency. This low-frequency signal is subsequently analyzed using a spectrum analyzer or by digitizing it through a\n\nKey Point: The beat test enables the characterization of a sample-and-hold (or A/D converter) at its peak clock frequency while only observing a relatively low-frequency output signal.\nhigh-precision A/D converter timed at the difference frequency, followed by computer-based analysis. The configuration for a beat test is depicted in Fig. 11.1. Sample waveforms for the input signal, the sampling signal, and the sample-and-hold's output signal are presented in Fig. 11.2. Note that this test permits the characterization of a S/H during operation at its peak clock frequency, yet only a relatively low-frequency output signal needs to be monitored.\nimage_name:Fig. 11.1\ndescription:Fig. 11.1's system block diagram depicts a test configuration for assessing a sample-and-hold (S/H) circuit via a beat test. The primary components of this setup are:\n\n1. **Input Signal (Vin):** The system input is a sinusoidal signal defined by \\( V_{in} = A_{in} \\sin[2\\pi(f_{smpl} + \\Delta f)t] \\). This signifies that the input signal has a frequency component of \\( f_{smpl} + \\Delta f \\), where \\( f_{smpl} \\) is the sampling frequency and \\( \\Delta f \\) is the difference frequency.\n\n2. **Sample-and-Hold Circuit (S/H):** The central element is the S/H block, which samples the input signal. It is governed by a clock signal (Clk) with a sampling frequency of \\( f_{smpl} \\). The clock signal \\( \\phi_{smpl} \\) dictates the sampling timing.\n\n3. **Output Signal:** The S/H circuit's output is an analog signal at the difference frequency \\( \\Delta f \\). This output is then routed to two distinct analysis components.\n\n4. **Spectrum Analyzer:** One output signal path is directed to a spectrum analyzer. This device examines the frequency components of the output signal, facilitating the study of the beat frequency \\( \\Delta f \\).\n\n5. **A/D Converter and Computer:** The other output signal path is sent to an analog-to-digital converter (A/D) and a computer system. This setup converts the output signal to digital form for further analysis and processing using computational tools.\n\n**Information Flow:**\n- The input sinusoidal signal \\( V_{in} \\) enters the S/H block, where it is sampled according to the clock signal \\( \\phi_{smpl} \\).\n- The sampled signal, now at frequency \\( \\Delta f \\), is divided and sent to both the spectrum analyzer and the A/D converter for analysis.\n\n**System Function:**\nThe main purpose of this setup is to evaluate the sample-and-hold circuit's performance by analyzing its output at a specific beat frequency. This allows for precise measurements of the S/H performance at maximum clock frequency by simplifying the monitoring to a lower frequency output.\n\nFig. 11.1 The configuration for assessing a sample-and-hold using a beat test.\n\n1. If the tested circuit is a track and hold, the output of the initial track and hold would be resampled by a second track and hold clocked in the opposite phase to the original.\nimage_name:Fig. 11.2\ndescription:Fig. 11.2 presents a time-domain waveform graph illustrating the behavior of a sample-and-hold circuit. It includes two waveforms: the input signal and the sample-and-hold's output signal.\n\n1. **Graph Type and Function:**\n- The graph is a time-domain waveform plot.\n\n2. **Axes Labels and Units:**\n- The axes are not explicitly labeled, but it is inferred that the horizontal axis denotes time and the vertical axis represents signal amplitude (voltage).\n- The scale appears linear, with no specific units or markers indicated.\n\n3. **Behavior and Trends:**\n- The input signal is a continuous sinusoidal wave, depicted as a smooth curve with regular peaks and troughs.\n- The sample-and-hold's output signal is shown as a stepped waveform, holding the sampled input signal values at regular intervals, forming a staircase pattern.\n- The output remains steady between sampling points, reflecting the hold phase of the sample-and-hold operation.\n\n4. **Key Features and Technical Details:**\n- The input signal oscillates smoothly, indicating a continuous sinusoidal function.\n- The output signal captures and retains the peak values of the input signal at specific intervals, demonstrating the sample-and-hold effect.\n- Key features include the transition points of the output waveform between held values, aligning with the peaks of the input sinusoid.\n\n5. **Annotations and Data Points:**\n- The graph includes annotations for the 'Input signal' and 'Output signal of sample-and-hold.'\n- No numerical values or specific data points are marked on the graph.\n\nOverall, the graph effectively illustrates how a sample-and-hold circuit samples a continuous input signal and produces a discrete output by retaining sampled values over time.\n\nSampling signal\nFig. 11.2 Example waveforms for the test setup of Fig. 11.1.\n\nWhen a computer is employed for analysis, the signal is typically curve-fitted to a sinusoidal wave at the beat (i.e., difference) frequency. This ideal closest-fit sinusoid is then subtracted from the measured signal, and the resulting error signal is analyzed for RMS content and spectral components using a fast-Fourier transform.\n\nIt is worth noting that a very similar test setup can be utilized for analog-to-digital converters, wherein the $\\mathrm{A} / \\mathrm{D}$ converter's output would be digitally transferred to a computer for analysis."
},
{
    "text": "Prior to detailing various $\\mathrm{S} / \\mathrm{H}$ architectures, it is pertinent to initially outline a widely-used technique for evaluating $\\mathrm{S} / \\mathrm{Hs}$, known as the beat test. This evaluation involves operating the $\\mathrm{S} / \\mathrm{H}$ at its peak clock frequency and introducing a sinusoidal input signal with a frequency slightly divergent from the clock frequency. ${ }^{1}$ The system's output is then demodulated to a lower frequency, corresponding to the discrepancy between the clock signal's frequency and the input signal's frequency. This low-frequency signal is subsequently analyzed using a spectrum analyzer or by digitizing it via a\n\nKey Point: The beat test permits the characterization of a sample-and-hold (or A/D converter) at its highest clock frequency, while only requiring the monitoring of a relatively low-frequency output signal.\nhigh-precision A/D converter synchronized at the difference frequency, followed by computer-based analysis. The configuration for a beat test is depicted in Fig. 11.1. Representative waveforms for the input signal, the sampling signal, and the sample-and-hold's output signal are illustrated in Fig. 11.2. It is noteworthy that this test facilitates the characterization of a S/H during operation at its peak clock frequency, yet only necessitates the observation of a relatively low-frequency output signal.\nimage_name:Fig. 11.1\ndescription:Fig. 11.1 presents a system block diagram depicting a test setup for assessing a sample-and-hold (S/H) circuit via a beat test. The primary components of this setup are:\n\n1. **Input Signal (Vin):** The system's input is a sinusoidal signal described by \\( V_{in} = A_{in} \\sin[2\\pi(f_{smpl} + \\Delta f)t] \\). This denotes that the input signal possesses a frequency component of \\( f_{smpl} + \\Delta f \\), where \\( f_{smpl} \\) is the sampling frequency and \\( \\Delta f \\) is the difference frequency.\n\n2. **Sample-and-Hold Circuit (S/H):** The central element is the S/H block, which samples the input signal. It is governed by a clock signal (Clk) with a sampling frequency of \\( f_{smpl} \\). The clock signal \\( \\phi_{smpl} \\) dictates the timing of the sampling process.\n\n3. **Output Signal:** The S/H circuit's output is an analog signal at the difference frequency \\( \\Delta f \\). This output is then directed to two distinct analysis components.\n\n4. **Spectrum Analyzer:** One output path is conveyed to a spectrum analyzer. This device examines the frequency components of the output signal, enabling the inspection of the beat frequency \\( \\Delta f \\).\n\n5. **A/D Converter and Computer:** The other output path is routed to an analog-to-digital converter (A/D) and a computer system. This arrangement digitizes the output signal for further analysis and processing using computational tools.\n\n**Flow of Information:**\n- The input sinusoidal signal \\( V_{in} \\) enters the S/H block, where it is sampled according to the clock signal \\( \\phi_{smpl} \\).\n- The sampled signal, now at frequency \\( \\Delta f \\), is divided and sent to both the spectrum analyzer and the A/D converter for analysis.\n\n**Overall System Function:**\nThe main purpose of this setup is to evaluate the performance of the sample-and-hold circuit by analyzing its output at a specific beat frequency. This enables high-precision measurements of the S/H performance while operating at maximum clock frequency, by simplifying the monitoring to a lower frequency output.\n\nFig. 11.1 The test setup for evaluating a sample-and-hold using a beat test.\n\n1. If the tested circuit is a track and hold, the output of the initial track and hold would be resampled by a secondary track and hold clocked in the opposite phase to the original.\nimage_name:Fig. 11.2\ndescription:Fig. 11.2 displays a time-domain waveform graph illustrating the behavior of a sample-and-hold circuit. It includes two waveforms: the input signal and the sample-and-hold's output signal.\n\n1. **Type of Graph and Function:**\n- The graph is a time-domain waveform plot.\n\n2. **Axes Labels and Units:**\n- The axes are not explicitly labeled, but it is inferred that the horizontal axis represents time and the vertical axis represents signal amplitude (voltage).\n- The scale appears linear, with no specific units or markers indicated.\n\n3. **Overall Behavior and Trends:**\n- The input signal is a continuous sinusoidal wave, depicted as a smooth curve with regular peaks and troughs.\n- The sample-and-hold's output signal is shown as a stepped waveform. It retains the sampled values of the input signal at regular intervals, forming a staircase-like pattern.\n- The output remains constant between sampling points, reflecting the hold phase of the sample-and-hold operation.\n\n4. **Key Features and Technical Details:**\n- The input signal oscillates smoothly, indicating a continuous sinusoidal function.\n- The output signal captures and holds the peak values of the input signal at specific intervals, demonstrating the sample-and-hold effect.\n- Key features include the transition points of the output waveform between held values, aligning with the peaks of the input sinusoid.\n\n5. **Annotations and Specific Data Points:**\n- The graph includes annotations marking the 'Input signal' and 'Output signal of sample-and-hold.'\n- No numerical values or specific data points are indicated on the graph.\n\nOverall, the graph effectively illustrates how a sample-and-hold circuit samples a continuous input signal and produces a discrete output by retaining sampled values over time.\n\nSampling signal\nFig. 11.2 Example waveforms for the test setup of Fig. 11.1.\n\nWhen a computer is employed for analysis, the signal is typically curve-fitted to a sinusoidal wave at the beat (i.e., difference) frequency. This ideal closest-fit sinusoid is then subtracted from the measured signal, and the resulting error signal is examined for RMS content and spectral components using a fast-Fourier transform.\n\nIt is worth noting that a similar test setup can be applied to analog-to-digital converters, wherein the output of the $\\mathrm{A} / \\mathrm{D}$ converter is digitally transferred to a computer for analysis."
},
{
    "text": "Before detailing various $\\mathrm{S} / \\mathrm{H}$ architectures, it's pertinent to initially outline a widely-used method for evaluating $\\mathrm{S} / \\mathrm{Hs}$, known as the beat test. This assessment involves operating the $\\mathrm{S} / \\mathrm{H}$ at its peak clock frequency and introducing a sinusoidal input signal with a frequency slightly divergent from the clock frequency. ${ }^{1}$ The system's output is then demodulated to a lower frequency, corresponding to the disparity between the clock signal's frequency and the input signal's frequency. This low-frequency signal is subsequently analyzed using a spectrum analyzer or by digitizing it through a\n\nKey Point: The beat test enables the characterization of a sample-and-hold (or A/D converter) at its maximum clock frequency, while only requiring the monitoring of a relatively low-frequency output signal.\nhigh-precision A/D converter timed at the difference frequency, followed by computer-based analysis. The configuration for a beat test is depicted in Fig. 11.1. Representative waveforms for the input signal, the sampling signal, and the sample-and-hold's output signal are illustrated in Fig. 11.2. It's noteworthy that this test facilitates the characterization of an S/H even when it operates at its highest clock frequency, necessitating only the observation of a relatively low-frequency output signal.\nimage_name:Fig. 11.1\ndescription:The block diagram in Fig. 11.1 presents a test configuration for assessing a sample-and-hold (S/H) circuit via a beat test. The primary components of this setup are:\n\n1. **Input Signal (Vin):** The system's input is a sinusoidal signal described by \\( V_{in} = A_{in} \\sin[2\\pi(f_{smpl} + \\Delta f)t] \\). This denotes that the input signal possesses a frequency component \\( f_{smpl} + \\Delta f \\), where \\( f_{smpl} \\) is the sampling frequency and \\( \\Delta f \\) is the difference frequency.\n\n2. **Sample-and-Hold Circuit (S/H):** The central element is the S/H block, which samples the input signal. It is governed by a clock signal (Clk) with a sampling frequency \\( f_{smpl} \\). The clock signal \\( \\phi_{smpl} \\) dictates the timing of the sampling process.\n\n3. **Output Signal:** The S/H circuit's output is an analog signal at the difference frequency \\( \\Delta f \\). This output is then routed to two distinct analysis components.\n\n4. **Spectrum Analyzer:** One output signal path leads to a spectrum analyzer. This device examines the frequency components of the output signal, enabling the study of the beat frequency \\( \\Delta f \\).\n\n5. **A/D Converter and Computer:** The other output signal path is directed to an analog-to-digital converter (A/D) and a computer system. This setup converts the output signal into digital form for further analysis and processing using computational tools.\n\n**Flow of Information:**\n- The input sinusoidal signal \\( V_{in} \\) enters the S/H block, where it is sampled according to the clock signal \\( \\phi_{smpl} \\).\n- The sampled signal, now at frequency \\( \\Delta f \\), is divided and sent to both the spectrum analyzer and the A/D converter for analysis.\n\n**Overall System Function:**\nThe primary purpose of this setup is to evaluate the performance of the sample-and-hold circuit by analyzing its output at a specific beat frequency. This permits high-precision measurements of the S/H performance while it operates at maximum clock frequency, simplifying the monitoring to a lower frequency output.\n\nFig. 11.1 The configuration for assessing a sample-and-hold using a beat test.\n\n1. If the tested circuit is a track and hold, the output of the initial track and hold would be resampled by a second track and hold, clocked in the opposite phase to the original.\nimage_name:Fig. 11.2\ndescription:Fig. 11.2 provides a time-domain waveform graph illustrating the behavior of a sample-and-hold circuit. It includes two waveforms: the input signal and the sample-and-hold's output signal.\n\n1. **Type of Graph and Function:**\n- The graph is a time-domain waveform plot.\n\n2. **Axes Labels and Units:**\n- The axes are not explicitly labeled, but it is implied that the horizontal axis represents time and the vertical axis represents signal amplitude (voltage).\n- The scale appears linear, with no specific units or markers indicated.\n\n3. **Overall Behavior and Trends:**\n- The input signal is a continuous sinusoidal wave, depicted as a smooth curve with regular peaks and troughs.\n- The sample-and-hold's output signal is shown as a stepped waveform. It retains the sampled values of the input signal at regular intervals, forming a staircase-like pattern.\n- The output remains constant between sampling points, reflecting the hold phase of the sample-and-hold operation.\n\n4. **Key Features and Technical Details:**\n- The input signal oscillates smoothly, indicating a continuous sinusoidal function.\n- The output signal captures and holds the peak values of the input signal at specific intervals, demonstrating the sample-and-hold effect.\n- Key features include the transition points of the output waveform between held values, aligning with the peaks of the input sinusoid.\n\n5. **Annotations and Specific Data Points:**\n- The graph includes annotations marking the 'Input signal' and 'Output signal of sample-and-hold.'\n- No numerical values or specific data points are indicated on the graph.\n\nOverall, the graph effectively illustrates how a sample-and-hold circuit samples a continuous input signal and generates a discrete output by holding sampled values over time.\n\nSampling signal\nFig. 11.2 Representative waveforms for the test setup of Fig. 11.1.\n\nWhen a computer is employed for analysis, the signal is typically curve-fitted to a sinusoidal wave at the beat (i.e., difference) frequency. This ideal closest-fit sinusoid is then subtracted from the measured signal, and the resulting error signal is analyzed for RMS content and spectral components using a fast-Fourier transform.\n\nIt's worth noting that a similar test setup can be applied to analog-to-digital converters, wherein the $\\mathrm{A} / \\mathrm{D}$ converter's output would be digitally transferred to a computer for analysis."
},
{
    "text": "Prior to detailing various $\\mathrm{S} / \\mathrm{H}$ architectures, it is fitting to initially outline a widely-used method for assessing $\\mathrm{S} / \\mathrm{Hs}$, known as the beat test. This assessment involves operating the $\\mathrm{S} / \\mathrm{H}$ at its peak clock frequency and introducing a sinusoidal input signal with a frequency slightly divergent from the clock frequency. ${ }^{1}$ The system's output is then demodulated to a lower frequency, corresponding to the disparity between the clock signal's frequency and the input signal's frequency. This low-frequency signal is subsequently analyzed using a spectrum analyzer or by digitizing it with a\n\nKey Point: The beat test enables the characterization of a sample-and-hold (or A/D converter) at its highest clock frequency while only observing a relatively low-frequency output signal.\nhigh-precision A/D converter timed at the difference frequency, followed by computer-based analysis. The configuration for a beat test is depicted in Fig. 11.1. Representative waveforms for the input signal, the sampling signal, and the sample-and-hold output signal are illustrated in Fig. 11.2. It should be noted that this test permits the characterization of a S/H at its maximum clock frequency, yet only necessitates the monitoring of a relatively low-frequency output signal.\nimage_name:Fig. 11.1\ndescription:The block diagram in Fig. 11.1 presents a test configuration for evaluating a sample-and-hold (S/H) circuit via a beat test. The primary components of this setup are:\n\n1. **Input Signal (Vin):** The system input is a sinusoidal signal defined by \\( V_{in} = A_{in} \\sin[2\\pi(f_{smpl} + \\Delta f)t] \\), indicating a frequency component of \\( f_{smpl} + \\Delta f \\), where \\( f_{smpl} \\) is the sampling frequency and \\( \\Delta f \\) is the difference frequency.\n\n2. **Sample-and-Hold Circuit (S/H):** The central element is the S/H block, which samples the input signal, controlled by a clock signal (Clk) with a sampling frequency \\( f_{smpl} \\). The clock signal \\( \\phi_{smpl} \\) governs the sampling timing.\n\n3. **Output Signal:** The S/H circuit's output is an analog signal at the difference frequency \\( \\Delta f \\), directed to two analysis components.\n\n4. **Spectrum Analyzer:** One output path leads to a spectrum analyzer, which examines the frequency components of the signal, focusing on the beat frequency \\( \\Delta f \\).\n\n5. **A/D Converter and Computer:** The other output path goes to an analog-to-digital converter (A/D) and a computer system for digitization and further computational analysis.\n\n**Information Flow:**\n- The input sinusoidal signal \\( V_{in} \\) enters the S/H block, where it is sampled per the clock signal \\( \\phi_{smpl} \\).\n- The sampled signal, now at frequency \\( \\Delta f \\), is split for analysis by both the spectrum analyzer and the A/D converter.\n\n**System Function:**\nThis setup aims to evaluate the sample-and-hold circuit's performance by analyzing its output at a specific beat frequency, facilitating high-accuracy measurements at maximum clock frequency by simplifying monitoring to a lower frequency output.\n\nFig. 11.1 The configuration for evaluating a sample-and-hold using a beat test.\n\n1. If the tested circuit is a track and hold, the output would be resampled by a second track and hold, clocked in the opposite phase to the original.\nimage_name:Fig. 11.2\ndescription:Fig. 11.2 displays a time-domain waveform graph illustrating the behavior of a sample-and-hold circuit, featuring the input and output signals.\n\n1. **Graph Type and Function:**\n- The graph is a time-domain waveform plot.\n\n2. **Axes and Units:**\n- The horizontal axis represents time, and the vertical axis represents signal amplitude (voltage), with a linear scale and no explicit units.\n\n3. **Behavior and Trends:**\n- The input signal is a continuous sinusoidal wave with regular peaks and troughs.\n- The sample-and-hold output signal is a stepped waveform, holding input signal values at regular intervals, forming a staircase pattern.\n- The output remains steady between sampling points, reflecting the hold phase.\n\n4. **Key Features:**\n- The input signal oscillates smoothly, indicating a continuous sinusoid.\n- The output signal captures and holds peak input values at specific intervals, showcasing the sample-and-hold effect.\n- Key transitions in the output waveform align with the input signal's peaks.\n\n5. **Annotations:**\n- The graph includes labels for the 'Input signal' and 'Output signal of sample-and-hold.'\n- No numerical values or specific data points are marked.\n\nThis graph effectively illustrates how a sample-and-hold circuit samples a continuous input signal and produces a discrete output by retaining sampled values over time.\n\nSampling signal\nFig. 11.2 Example waveforms for the configuration in Fig. 11.1.\n\nWhen a computer is employed for analysis, the signal is typically curve-fitted to a sinusoidal wave at the beat (difference) frequency. This ideal sinusoid is then subtracted from the measured signal, and the resulting error signal is analyzed for RMS content and spectral components using a fast-Fourier transform.\n\nIt is worth noting that a similar test setup can be applied to analog-to-digital converters, where the $\\mathrm{A} / \\mathrm{D}$ converter's output is digitally transferred to a computer for analysis."
},
{
    "text": "The text provided describes the operation and various configurations of sample-and-hold circuits, particularly focusing on those realized using MOS technology. The circuits are used to sample an input voltage and hold it for a certain period. The descriptions include the circuits' responses to clock signals, the effects of charge injection, and methods to minimize errors such as distortion and offset.\n\nOne of the simplest sample-and-hold circuits using CMOS technology is shown in Fig. 11.3. This circuit tracks the input voltage, Vin, when the clock signal, clk, is high. When clk goes low, the voltage is held constant on the capacitor Chld. However, due to the channel charge of the NMOS transistor, Q1, there is a negative going hold step, which causes a glitch at the node V'. This glitch is short-lived if the source impedance at the node Vin is low.\n\nEquations (11.1) to (11.4) are provided to calculate the change in voltage, V', due to the channel charge and gate overlap capacitance. It is noted that V' is linearly related to Vin and Vtn, resulting in gain error and distortion for the overall sample-and-hold circuit.\n\nTo minimize the signal-dependent hold step, a CMOS transmission gate (Fig. 11.4) or a dummy switch (Fig. 11.5) can be used. These methods aim to cancel out the charge injection effects but have limitations in practice due to factors such as clock waveform imperfections and input voltage variations.\n\nAnother source of error is the finite slope of the clock waveform, which introduces sampling-time jitter, as illustrated in Fig. 11.6. This jitter affects the precision of the sampling time and can lead to uncertainty in the sampled voltage.\n\nAn improved sample-and-hold circuit includes an opamp in a feedback loop (Fig. 11.7), which increases the input impedance and reduces dc errors. However, this configuration can suffer from speed degradation due to stability requirements.\n\nFigures 11.8 and 11.9 show further modifications to the sample-and-hold circuit, including additional switches to minimize slewing time and grounding the output of the first opamp during hold mode. These configurations aim to reduce signal feedthrough and speed up the transition back to track mode.\n\nLastly, Fig. 11.10 presents a modification with clock-feedthrough cancellation circuitry, which aims to minimize the hold pedestal and dc offset by matching charge injections into two capacitors, Chld and Chld'. This approach helps to eliminate the effects of voltage changes on the output voltage due to the common-mode rejection of the opamp.\n\nOverall, the text highlights the complexities and trade-offs involved in designing sample-and-hold circuits using MOS technology, with various configurations proposed to minimize errors and improve performance."
},
{
    "text": "The circuit illustrated in Fig. 11.3 represents a basic open-loop track and hold circuit that employs MOS technology. When the clock signal, clk, is at a high level, the circuit tracks the input voltage, Vin. As the clock signal transitions to a low level, the voltage is maintained on the capacitor, C_hld.\n\nIn the simplest form of a sample-and-hold circuit using CMOS technology, depicted in Fig. 11.3, the voltage V' mirrors Vin when the clock signal, $\\phi_{\\text {clk }}$, is high. Ideally, V' would remain constant at the level of Vin at the instant $\\phi_{\\text {clk }}$ dropped, but in reality, a negative hold step occurs due to the channel charge of Q1. When Q1 is turned off, the negative charge flows out from under its gate to its junctions, causing the voltage at these junctions to exhibit negative glitches. Assuming a low source impedance at the Vin node, the glitch at this node is minimal and brief. However, the negative charge affecting the node connected to C_hld (node V') leads to a enduring negative voltage change until Q1 is activated again. If the clock, $\\phi_{c \\mid k}$, turns off rapidly, the channel charge, Q_CH, will distribute equally into both junctions, as the channel becomes pinched off near the junctions while the charge is discharged to them. The charge directed towards the V' junction is thus expressed by:\n\n$$\n\\Delta Q_{C_{\\text {hld }}}=\\frac{Q_{C H}}{2}=\\frac{C_{o x} W L V_{\\text {eff-1 }}}{2}\n$$\n\nwhere V_eff-1 is defined as:\n\n$$\nV_{\\text {eff-1 }}=V_{\\mathrm{GS} 1}-V_{\\mathrm{tn}}=V_{D D}-V_{\\mathrm{tn}}-V_{\\mathrm{in}}\n$$\n\nHere, Vin is the input voltage at the moment Q1 is turned off. It is important to note that this outcome presumes that the clock signal, $\\phi_{\\mathrm{cl}}$, fluctuates between V_DD and the most negative voltage in the circuit.\n\nThe change in voltage V' is determined using the Q=CV relationship, leading to:\n\n$$\n\\Delta \\mathrm{V}^{\\prime}=\\frac{\\Delta \\mathrm{Q}_{\\mathrm{C} \\text {-hld }}}{\\mathrm{C}_{\\text {hld }}}=-\\frac{\\mathrm{C}_{\\mathrm{ox}} \\mathrm{WLV}_{\\text {eff-1 }}}{2 \\mathrm{C}_{\\text {hld }}}\n$$\n\nNotably, $\\Delta \\mathrm{V}^{\\prime}$ has a linear relationship with Vin, leading to a gain error in the sample-and-hold circuit. Moreover, $\\Delta \\mathrm{V}^{\\prime}$ is also linearly related to V_tn, which has a nonlinear relationship with the input signal, Vin, due to body effect variations in the source-substrate voltage. This nonlinear relationship with Vin leads to distortion in the sample-and-hold circuit.\n\nThere is an additional change in V' due to the gate overlap capacitance. Using a derivation similar to that for finding (10.8), we get:\n\n$$\n\\Delta \\mathrm{V}^{\\prime} \\cong-\\frac{\\mathrm{C}_{\\mathrm{ox}} \\mathrm{WL}_{\\mathrm{ov}}\\left(\\mathrm{~V}_{\\mathrm{DD}}-\\mathrm{V}_{\\mathrm{Ss}}\\right)}{\\mathrm{C}_{\\mathrm{hld}}}\n$$\n\nwhere V_Ss is the most negative voltage in the circuit. This component is typically smaller than that due to the channel charge and appears as an offset since it is independent of the signal. Hence, this error component is generally insignificant as signal-independent offsets can usually be eliminated in most systems. However, it may pose noise issues if the clock signal, $\\phi_{\\mathrm{cl}}$, is not adequately noise-free. For instance, if the clock signal is contaminated with power-supply noise from being generated by a simple inverter tied to digital power supplies, the power-supply rejection ratio of this circuit might be inadequate.\n\n#### EXAMPLE 11.1\n\nConsider the sample-and-hold circuit of Fig. 11.3 with C_hld=1 pF, Cox=8.5 fF/(m^2), V_tn=0.45 V, and (W/L)_1=(5 m / 0.4 m). Assuming a power supply voltage of 2 V, determine the hold step for Vin equal to 1 V, and then for Vin equal to 0.5 V. Use these estimates to calculate the dc offset.\n\n#### Solution\n\nAt Vin=1 V, using (11.3), we find $\\Delta \\mathrm{V}^{\\prime}(1 \\mathrm{~V})=-4.7 \\mathrm{mV}$. At Vin=0.5 V, using (11.3) again, we find $\\Delta \\mathrm{V}^{\\prime}(0.5 \\mathrm{~V})=-8.9 \\mathrm{mV}$. The average offset is calculated as:\n\n$$\n\\mathrm{V}_{\\text {offset-avg }}=\\frac{\\Delta \\mathrm{V}^{\\prime}(1 \\mathrm{~V})+\\Delta \\mathrm{V}^{\\prime}(0.5 \\mathrm{~V})}{2}=-6.8 \\mathrm{mV}\n$$\n\nwhich serves as a reasonable estimate of the dc offset injected in this example.\n\nVarious modifications have been proposed to minimize the signal-dependent hold step. One approach is to substitute the n-channel switch with a CMOS transmission gate, as depicted in Fig. 11.4. The rationale is that if the p-channel transistor's size matches the n-channel transistor's, the charge injection from each transistor will cancel out when the transmission gate is deactivated. This holds true when Vin is between the power supplies, assuming fast and perfectly complementary clock waveforms. Regrettably, these conditions are rarely met in practice. Accounting for the finite slopes of the clock waveforms reveals that the transistor turn-off times are signal-dependent, causing the n-channel transistor to deactivate at different times than the p-channel transistor. Even if we disregard the errors from imperfect clock waveforms, when Vin is near V_DD, the charge from the p-channel transistor exceeds that from the n-channel transistor due to its larger effective gate-source voltage, resulting in a positive hold step. The opposite occurs when the input signal is near the negative power supply. These effects seldom cancel each other out in practical scenarios.\n\nAnother proposed modification to minimize clockfeedthrough errors is to incorporate a dummy switch, as shown in Fig. 11.5. The principle is that if the width of Q2 is exactly half that of Q1, and the clock waveforms are fast, the charges will cancel. However, achieving the ideal ratio of widths is challenging in practice, especially when the clock waveforms are not fast enough. When the ideal ratio is not one-half, attaining the optimal ratio for perfect cancellation is difficult. Nevertheless, when the clock waveforms are fast, this technique can usually reduce the hold pedestal to less than about one-fifth of the value it would have without the dummy switch. For this to be effective, the clock of Q2 must change slightly after that of Q1, ensuring that the cancelling charge of Q2 cannot escape through Q1 while it is still active.\n\nAnother source of error in the simple sample-and-hold circuit of Fig. 11.3 arises from clock waveforms with finite slopes. To understand this error source, consider the waveforms for Vin and $\\phi_{\\text {clk }}$ in Fig. 11.6. The ideal sampling time is defined as the negative-going zero-crossing of $\\phi_{\\text {clk }}$. The true sampling time occurs when the sampling-clock voltage reaches the level that is one transistor threshold voltage above the input voltage. In other words, transistor Q1 of Fig. 11.3 turns off when $\\phi_{\\mathrm{clk}}$ is V_tn above V"
},
{
    "text": "Rephrased text:\n\n---\n\nFigure 11.3 depicts a straightforward sample-and-hold circuit implemented using MOS technology. The circuit operates as follows: while the clock signal clk is active (high), the input voltage Vin is tracked. When clk deactivates (goes low), the voltage is preserved on the capacitor C_hld.\n\nThis simple sample-and-hold circuit, as shown in Figure 11.3, is one of the most basic configurations achievable with CMOS technology. When the clock signal $\\phi_{\\text {clk }}$ is high, the voltage $V'$ mirrors Vin. When $\\phi_{\\text {clk }}$ drops to low, $V'$ ideally maintains a constant voltage equivalent to Vin at the moment $\\phi_{\\text {clk }}$ transitioned to low. However, $V'$ experiences a negative voltage step due to the channel charge of transistor $Q_{1}$. As $Q_{1}$ switches off, its channel charge dissipates, flowing beneath its gate towards the junctions. This negative charge induces a temporary negative voltage glitch at the junctions. Assuming a low source impedance at Vin, the glitch at this node is minimal and brief. Nonetheless, the negative charge migrating to the node connected to C_hld (node $V'$) results in a sustained negative voltage shift until $Q_{1}$ is activated again. If the clock $\\phi_{\\text {clk }}$ deactivates rapidly, the channel charge $Q_{\\text {CH}}$ is evenly distributed between the two junctions because the channel gets pinched off near the junctions as the charge drains away. Consequently, the charge flowing to the junction labeled $V'$ is calculated as:\n\n$$\n\\Delta Q_{C_{\\text {hld }}}=\\frac{Q_{C H}}{2}=\\frac{C_{o x} W L V_{\\text {eff-1 }}}{2} \\tag{11.1}\n$$\n\nwhere $V_{\\text {eff-1 }}$ is defined by:\n\n$$\nV_{\\text {eff-1 }}=V_{\\mathrm{GS} 1}-V_{\\mathrm{tn}}=V_{D D}-V_{\\mathrm{tn}}-V_{\\text {in}} \\tag{11.2}\n$$\n\nHere, Vin represents the input voltage at the instant $Q_{1}$ is turned off. It is important to note that this outcome presumes that the clock signal $\\phi_{\\text {clk }}$ fluctuates between $V_{\\mathrm{DD}}$ and the most negative voltage in the circuit.\n\nThe change in voltage $V'$ is determined using the capacitance relationship $Q=CV$, yielding:\n\n$$\n\\Delta V'=\\frac{\\Delta Q_{C \\text {-hld }}}{C_{\\text {hld }}}=-\\frac{C_{\\mathrm{ox}} WL V_{\\text {eff-1 }}}{2 C_{\\text {hld }}}=-\\frac{C_{0 \\mathrm{x}} WL(V_{\\mathrm{DD}}-V_{\\mathrm{tn}}-V_{\\text {in }})}{2 C_{\\text {hld }}} \\tag{11.3}\n$$\n\nIt is observed that $\\Delta V'$ is linearly dependent on Vin, which introduces gain error in the sample-and-hold circuit. More critically, $\\Delta V'$ is also linearly linked to $V_{\\mathrm{tn}}$, which exhibits a nonlinear relationship with the input signal Vin due to body effect variations caused by fluctuations in the source-substrate voltage (assuming the substrate is connected to one of the supply rails). This nonlinear correlation with Vin induces distortion in the overall sample-and-hold circuit.\n\nAn additional adjustment in $V'$ arises from the gate overlap capacitance. By employing a derivation akin to that used to derive equation (10.8), we obtain:\n\n$$\n\\Delta V' \\cong-\\frac{C_{\\mathrm{ox}} WL_{\\mathrm{ov}}(V_{\\mathrm{DD}}-V_{\\mathrm{Ss}})}{C_{\\mathrm{hld}}} \\tag{11.4}\n$$\n\nwhere $V_{\\mathrm{Ss}}$ is the most negative voltage in the circuit. This component is generally smaller than the error caused by the channel charge and manifests as an offset since it is independent of the signal. Hence, this error component is usually insignificant as signal-independent offsets can commonly be corrected in most systems. However, it may pose noise issues if the clock signal $\\phi_{\\text {clk }}$ is not adequately noise-free. For instance, if the clock signal is corrupted by power-supply noise due to a straightforward inverter connected to digital power supplies, the power-supply rejection ratio of this circuit could be inadequate.\n\n#### EXAMPLE 11.1\n\nEvaluate the sample-and-hold circuit in Figure 11.3 with $C_{\\mathrm{hld}}=1 \\mathrm{pF}, C_{\\mathrm{ox}}=8.5 \\mathrm{fF} /(\\mu \\mathrm{m})^{2}, V_{\\mathrm{tn}}=0.45 \\mathrm{~V}$, and $(W/L)_{1}=(5 \\mu \\mathrm{~m} / 0.4 \\mu \\mathrm{~m})$. Assume a power supply voltage of 2 V. Calculate the hold step for $V_{\\mathrm{in}}$ equal to 1 V and then for $V_{\\text {in }}$ equal to 0.5 V. Utilize these estimates to approximate the dc offset.\n\n#### Solution\n\nAt $V_{\\text {in }}=1 \\mathrm{~V}$, using equation (11.3), we calculate $\\Delta V'(1 \\mathrm{~V})=-4.7 \\mathrm{mV}$. At $V_{\\mathrm{in}}=0.5 \\mathrm{~V}$, once more employing equation (11.3), we find $\\Delta V'(0.5 \\mathrm{~V})=-8.9 \\mathrm{mV}$. The average offset is computed as:\n\n$$\nV_{\\text {offset-avg }}=\\frac{\\Delta V'(1 \\mathrm{~V})+\\Delta V'(0.5 \\mathrm{~V})}{2}=-6.8 \\mathrm{mV} \\tag{11.5}\n$$\n\nThis represents a reasonable approximation of the dc offset introduced in this example.\n\nMultiple modifications have been suggested to mitigate the signal-dependent hold step. One approach involves substituting the n-channel switch with a CMOS transmission gate, as illustrated in Figure 11.4. The rationale is that if the p-channel transistor is identical in size to the n-channel transistor, the charge injection from each transistor will counterbalance when the transmission gate is deactivated. This cancellation is somewhat effective when Vin is centrally located between the power supplies, assuming rapid and perfectly complementary clock waveforms. Regrettably, these conditions are rarely met in practice. Accounting for the finite slopes of the clock waveforms reveals that the deactivation times of the transistors are signal-dependent, leading to the n-channel transistor turning off at different times than the p-channel transistor. Even if we disregard the inaccuracies due to imperfect clock waveforms, when Vin is closer to $V_{\\mathrm{DD}}$, the charge from the p-channel transistor exceeds that from the n-channel transistor due to its greater effective gate-source voltage, resulting in a positive hold step. The opposite occurs when the input signal is near the negative power supply. In practice, these two effects seldom.\n\nFigure 11.5 showcases another modification, frequently proposed to reduce clock feedthrough errors, which involves incorporating a dummy switch. The concept is that if the width of $Q_{2}$ is precisely half that of $Q_{1}$ and the clock waveforms are swift, the charges will negate each other. However, it is rarely feasible to achieve sufficiently rapid clock waveforms for the ideal width ratio to be exactly one-half. If the ideal ratio is not one-half, it is challenging to achieve the optimal ratio needed for complete cancellation. Nonetheless, when the clock waveforms are fast, this method can typically minimize the hold pedestal to less than about one-fifth of the value it would possess in its absence. For this to occur, it is essential that the clock of $Q_{2}$ alters slightly after that of $Q_{1}$. This clock configuration ensures that the charge from $Q_{2}$ cannot escape through $Q_{1}$ while it remains activated.\n\nAnother source of error in the simple sample-and-hold circuit of Figure 11.3 stems from the clock waveforms' finite slopes. To comprehend this error source, consider the waveforms for Vin and $\\phi_{\\text {clk }}$ in Figure 11.6. The ideal sampling time is defined as the negative-going zero-crossing of $\\phi_{\\text {clk }}$. The actual sampling time occurs when the sampling-clock voltage surpasses the value at which it is one transistor threshold voltage above the input voltage. In other words, transistor $Q_{1}$ in Figure 11.3 switches off when $\\phi_{\\text {clk }}$ is $V_{\\mathrm{tn}}$ above $V_{\\mathrm{in}}$, as depicted in Figure 11.6. Thus, when Vin is high, the true sampling time precedes the ideal sampling time, whereas when Vin is low (0 V), the true sampling time lags.\n\n#### EXAMPLE 11.2\n\nExamine the S/H circuit of Figure 11.3, where $V_{\\mathrm{in}}$ is a 20-MHz band-limited signal with a 2-Vpp amplitude. Assume that $\\phi_{\\mathrm{clk}}$ is a 100-MHz square wave with a peak amplitude of 2.5 V and linear rise and fall times of 1.5 ns. Determine the maximum sampling time uncertainty. Assume $V_{\\mathrm{tn}}$ is 0.8 V.\n\n#### Solution\n\nInitially, we recognize that the slope of $\\phi_{\\mathrm{clk}}$ is $(5 \\mathrm{~V}) /(1.5 \\mathrm{~ns})=3.33 \\mathrm{~V} / \\mathrm{ns}$, and the true sampling time is when the clock waveform exceeds the input signal by 0.8 V.\n\nFor $V_{\\text {in }}=1 \\mathrm{~V}$, the sampling transistor will switch off when $\\phi_{\\mathrm{clk}}$ reaches 1.8 V, which is $(0.7 \\mathrm{~V}) /(3.33 \\mathrm{~V} / \\mathrm{ns})=0.21 \\mathrm{~ns}$ after the clock initiates its descent.\n\nWhen $V_{\\text {in }}=-1 \\mathrm{~V}$, the sampling time occurs when $\\phi_{\\mathrm{clk}}$ is -0.2 V, which is 0.81 ns after the clock commences its ascent.\n\nHence, the sampling-time uncertainty is $0.81-0.21=0.6 \\mathrm{~ns}$. Assuming the ideal sampling time is 0.75 ns after the clock starts its transition, the sampling jitter ranges from -0.54 ns to +0.06 ns relative to the ideal sampling time.\n\nA more sophisticated sample-and-hold circuit incorporates an opamp within a feedback loop, as shown in Figure 11.7. When the clock $\\phi_{\\text {clk }}$ is high, the circuit behaves akin to an opamp in a unity-gain feedback configuration. When $\\phi_{\\text {clk }}$ goes low, the input voltage at that instant is stored on C_hld, similar to a basic sample-and-hold circuit. By incorporating an opamp in the feedback loop, the input impedance of the sample-and-hold circuit is substantially increased. Another benefit of this setup is that even if the unity-gain buffer at the output possesses an offset voltage, the dc error attributable to this buffer will be divided by the gain of the input opamp (although the input-offset of the input opamp will persist). Consequently, very simple source followers can be employed for the output buffer.\n\nThe drawback of the configuration in Figure 11.7 is that the operational speed can be significantly compromised due to the need to ensure loop stability when closed. Another factor contributing to speed degradation is that during hold mode, the opamp operates in an open-loop configuration, causing its output to almost certainly saturate at one of the power-supply voltages. When the sample-and-hold circuit reverts to track mode, it takes time for the opamp output voltage to slew back to its correct closed-loop value. This slewing time can be significantly reduced by incorporating two additional transistors, as demonstrated in Figure 11.8. During hold mode, switch $Q_{2}$ maintains the output of the first opamp close to the voltage it will need to be at when the T/H transitions back to track mode. It should be noted that this track-and-hold configuration still exhibits errors due to charge injection from the switch $Q_{1}$, akin to the simple S/H circuit of Figure 11.3. The errors stemming from finite clock rise and fall times are also comparable.\n\nFigure 11.9 presents a similar but enhanced configuration. In this arrangement, the holding capacitor is situated in the feedback path of a second opamp, rather than being connected to ground. This configuration boasts several desirable attributes. Most notably, assuming the second opamp possesses a high gain, the voltages on both sides of switch $Q_{1}$ are nearly independent of the signal. Thus, when $Q_{1}$ is turned off, charge injection still occurs on the left side of C_hld, inducing a positive hold step at the output of opamp 2. However, this hold step manifests as a dc offset and remains signal-independent. In other words, the charge injection due to $Q_{1}$ generates some dc offset but no distortion. Moreover, the sampling time remains unaffected by the finite slopes of the sampling-clock waveform due to this configuration.\n\nAnother advantage stems from the incorporation of $Q_{2}$. This switch grounds the output of the first opamp during hold mode. (If the supply voltage is unipolar, the source of $Q_{2}$ should be connected to a mid-rail dc voltage instead, as should the positive terminal of Opamp 2.) This grounding action keeps the output of the first opamp near the voltage it must assume when the S/H circuit reverts to track mode. This approach significantly accelerates the S/H circuit's return to track mode. The switch also substantially minimizes signal feedthrough during hold mode by grounding the signal path.\n\nA significant limitation of this configuration is the degradation in speed owing to the need to ensure stability during track mode. This constraint is exacerbated by the presence of two opamps in the loop, along with the on resistance of the sampling switch $Q_{1}$, during the closed-loop phase.\n\nFigure 11.10 presents an intriguing modification of Figure 11.9, incorporating additional circuitry designed to minimize the hold pedestal and, consequently, the dc offset. The fundamental concept is to balance the charge injection into C_hld with an equivalent charge injection into C_hld'. Given that these capacitors are matched in size, their voltage changes will correspond, and the common-mode rejection of the opamp will neutralize the impact of these voltage changes on the S/H circuit's output voltage. A major limitation of this method is a second-order effect caused by impedance mismatch at the left of $Q_{1}$ and the bottom of $Q_{2}$. Errors due to this mismatch can be mitigated by incorporating small capacitors (0.5 pF to 1 pF) between each node and ground. These extra capacitors help maintain constant voltages at these nodes while the clocks are turning off, assuming the clock waveforms are fast. It should be noted that the configuration of [Nayebi, 1989] was a fully differential design and represents a very reasonable choice for numerous S/H applications.\n\n---"
},
{
    "text": "Rephrased text:\n```\nimage_name: Fig. 11.3 A CMOS open-loop track and hold circuit utilizing MOS technology.\ndescription:\n[\nname: M1, type: NMOS, ports: {S: V, D: \"Vin\", G: clk}\nname: C_hld, type: Capacitor, value: C_hld, ports: {Np: \"V\", Nn: GND}\nname: 1, type: buffer, value: 1, ports: {InP: \"V\", Out: Vout'}\n]\nextrainfo: This is a CMOS open-loop track and hold circuit. The input voltage Vin is tracked when the clock signal clk is high. When clk goes low, the voltage is maintained on the capacitor C_hld.\n\nFig. 11.3 A CMOS open-loop track and hold circuit realized using MOS technology.\n\nOne of the simplest sample-and-hold circuits that can be implemented using CMOS technology is shown in Fig. 11.3. When $\\phi_{\\text{clk}}$ is high, $V'$ follows $V_{\\text{in}}$. When $\\phi_{\\text{clk}}$ goes low, $V'$ ideally remains constant, having a value equal to $V_{\\text{in}}$ at the instance $\\phi_{\\text{clk}}$ went low. Unfortunately, $V'$ will have a negative going hold step at this time caused by the channel charge of $Q_{1}$. When $Q_{1}$ turns off, its channel charge must flow out from under its gate into its junctions. Since this charge is negative, it will cause the junction voltages to have negative glitches. If one assumes the source impedance at the node $V_{\\text{in}}$ is very low, then the glitch at this node will be small and have a very short duration. However, the negative charge that goes to the node with $C_{\\text{hld}}$ connected to it (i.e., node $V'$) will cause a negative voltage change that is long lasting (until the next time $Q_{1}$ turns on again). If clock $\\phi_{\\text{clk}}$ turns off fast, then the channel charge, $Q_{\\text{CH}}$, will flow equally into both junctions [Shieh, 1987] since the channel becomes pinched off at both ends (i.e., next to the junctions) while the charge is flowing out to the two junctions. The charge flowing to the junction labeled $V'$ is therefore given by\n\n$$\n\\begin{equation*}\n\\Delta Q_{C_{\\text{hld}}} = \\frac{Q_{C H}}{2} = \\frac{C_{o x} W L V_{\\text{eff-1}}}{2} \\tag{11.1}\n\\end{equation*}\n$$\n\nwhere $V_{\\text{eff-1}}$ is given by\n\n$$\n\\begin{equation*}\nV_{\\text{eff-1}} = V_{\\text{GS} 1} - V_{\\text{tn}} = V_{\\text{DD}} - V_{\\text{tn}} - V_{\\text{in}} \\tag{11.2}\n\\end{equation*}\n$$\n\nHere, $V_{\\text{in}}$ is the input voltage at the instance $Q_{1}$ turns off. It should be noted here that this result assumes that the clock signal, $\\phi_{\\text{clk}}$, goes between $V_{\\text{DD}}$ and the most negative voltage in the circuit.\n\nThe change in the voltage $V'$ is found by using the relationship $Q = CV$, resulting in\n\n$$\n\\begin{equation*}\n\\Delta V' = \\frac{\\Delta Q_{C \\text{-hld}}}{C_{\\text{hld}}} = -\\frac{C_{\\text{ox}} W L V_{\\text{eff-1}}}{2 C_{\\text{hld}}} = -\\frac{C_{0 \\text{x}} W L (V_{\\text{DD}} - V_{\\text{tn}} - V_{\\text{in}})}{2 C_{\\text{hld}}} \\tag{11.3}\n\\end{equation*}\n$$\n\nNotice that $\\Delta V'$ is linearly related to $V_{\\text{in}}$, which results in a gain error for the overall sample-and-hold circuit. However, more importantly, $\\Delta V'$ is also linearly related to $V_{\\text{tn}}$, which is nonlinearly related to the input signal, $V_{\\text{in}}$, due to variations in the source-substrate voltage triggering a body effect (assuming the substrate is tied to one of the voltage rails). This nonlinear relationship with $V_{\\text{in}}$ results in distortion for the overall sample-and-hold circuit.\n\nKey Point: Charge injection causes a hold step that is nonlinearly related to the input signal, resulting in signal distortion.\n\nThere is also an additional change in $V'$ due to the gate overlap capacitance. Using a derivation similar to that used to find (10.8), we have\n\n$$\n\\begin{equation*}\n\\Delta V' \\cong -\\frac{C_{\\text{ox}} W L_{\\text{ov}} (V_{\\text{DD}} - V_{\\text{Ss}})}{C_{\\text{hld}}} \\tag{11.4}\n\\end{equation*}\n$$\n\nwhere $V_{\\text{Ss}}$ is the most negative voltage in the circuit. This component is usually smaller than that due to the channel charge, and appears simply as an offset since it is signal independent. Therefore, this error component is not typically important since signal-independent offsets can often be removed in most systems. However, it may cause noise problems if care is not taken to ensure that the clock signal, $\\phi_{\\text{clk}}$, is relatively noise free. For example, if the clock signal has power-supply noise on it due to being realized with a simple inverter tied to digital power supplies, the power-supply rejection ratio of this circuit might be poor.\n\n#### EXAMPLE 11.1\n\nConsider the sample-and-hold of Fig. 11.3 with $C_{\\text{hld}} = 1 \\text{pF}, C_{\\text{ox}} = 8.5 \\text{fF} / (\\mu \\text{m})^2, V_{\\text{tn}} = 0.45 \\text{V}$, and $(W / L)_1 = (5 \\mu \\text{m} / 0.4 \\mu \\text{m})$. Assume the power supply voltage is 2 V. Find the hold step for $V_{\\text{in}}$ equal to 1 V, and then repeat for $V_{\\text{in}}$ equal to 0.5 V. Use these estimates for errors to estimate the dc offset.\n\n#### Solution\n\nAt $V_{\\text{in}} = 1 \\text{V}$, using (11.3), we find $\\Delta V'(1 \\text{V}) = -4.7 \\text{mV}$. At $V_{\\text{in}} = 0.5 \\text{V}$, again using (11.3), we find $\\Delta V'(0.5 \\text{V}) = -8.9 \\text{mV}$. The average offset is given by\n\n$$\n\\begin{equation*}\nV_{\\text{offset-avg}} = \\frac{\\Delta V'(1 \\text{V}) + \\Delta V'(0.5 \\text{V})}{2} = -6.8 \\text{mV} \\tag{11.5}\n\\end{equation*}\n$$\n\nwhich is a reasonable estimate of the amount of dc offset injected in this example.\n\nThere have been a number of changes proposed to minimize the signal-dependent hold step. One approach is to replace the n-channel switch by a CMOS transmission gate, as shown in Fig. 11.4. The idea behind this approach is that if the size of the p-channel transistor is taken the same as the n-channel transistor, then the charge injection due to each transistor will cancel when the transmission gate turns off. This result is somewhat true when $V_{\\text{in}}$ is in the middle region between the power supplies, assuming the clock waveforms are fast and exactly complementary. Unfortunately, these conditions are seldom possible to achieve in practice. When the finite slopes of the clock waveforms are taken into account, it is seen (as is explained shortly) that the turn-off times of the transistors are signal dependent and this signal dependence causes the n-channel transistor to turn off at different times than the p-channel transistor. Even if we ignore the errors caused by imperfect clock waveforms, when $V_{\\text{in}}$ is closer to $V_{\\text{DD}}$, the charge from the p-channel transistor is greater than that from the n-channel transistor because of its larger effective gate-source voltage resulting in a positive hold step. The opposite happens when the input signal is closer to the negative power supply. Seldom will these two effects have the same magnitude in practice.\n\nimage_name: Fig. 11.4\ndescription:\n[\nname: Q1, type: NMOS, ports: {S: V, D: \"Vin\", G: clk}\nname: Q2, type: PMOS, ports: {S: V, D: \"Vin\", G: clk_bar}\nname: C_hld, type: Capacitor, value: C_hld, ports: {Np: \"V\", Nn: GND}\nname: 1, type: buffer, value: 1, ports: {InP: \"V\", Out: Vout}\n]\nextrainfo: The circuit is an open-loop track and hold circuit using a CMOS transmission gate, consisting of NMOS and PMOS transistors controlled by a clock signal (clk). The output is buffered by an op-amp.\n\nFig. 11.4 An open-loop track and hold realized using a CMOS transmission gate.\n\nAnother modification, often proposed to minimize clockfeedthrough errors, is to add a dummy switch as shown in Fig. 11.5 [McCreary, 1975]. The theory behind this technique is that if the width of $Q_{2}$ is taken exactly one-half that of $Q_{1}$, and if the clock waveforms are fast, then the charges will cancel. In practice, it is seldom possible to have the clock waveforms change fast enough so that the ideal ratio of widths is exactly onehalf. When the ideal ratio is not one-half, it is difficult to make the ratio equal to the optimum required for perfect cancellation. However, when the clock waveforms are fast, this technique usually can minimize the hold pedestal to less than about one-fifth the value it would have without it. For this to be the case, however, it is necessary that the clock of $Q_{2}$ changes slightly after that of $Q_{1}$. This clock arrangement guarantees that the cancelling charge of $Q_{2}$ cannot escape through $Q_{1}$ while it is still on.\n\nKey Point: The effective sampling time is related to the input signal due to the finite riselfall time of the clock, another nonideality.\n\nAnother source of error for the simple sample-and-hold of Fig. 11.3 is caused by clock waveforms having finite slopes. To understand this error source consider the waveforms for $V_{\\text{in}}$ and $\\phi_{\\text{clk}}$ shown in Fig. 11.6. Assume the ideal sampling time is defined to be the negative-going zerocrossing of $\\phi_{\\text{clk}}$. The true sampling time is that when the sampling-clock voltage passes through the value when it is one transistor threshold voltage drop above the input voltage. In other words, transistor $Q_{1}$ of Fig. 11.3 turns off when $\\phi_{\\text{clk}}$ is $V_{\\text{tn}}$ above $V_{\\text{in}}$, as shown in Fig. 11.6. Thus, when $V_{\\text{in}}$ is high, the true sampling time is earlier than the ideal sampling time, whereas when $V_{\\text{in}}$ is low 0 V, the true sampling time is late.\n\nimage_name: Fig. 11.5\ndescription:\n[\nname: Q1, type: NMOS, ports: {S: V, D: Vin, G: clk}\nname: Q2, type: NMOS, ports: {S: V'', D: \"V\", G: clk_bar}\nname: C_hld, type: Capacitor, value: C_hld, ports: {Np: \"V\", Nn: GND}\nname: 1, type: buffer, value: 1, ports: {InP: \"V\",Out: Vout}\n]\nextrainfo: The circuit is an open-loop track and hold circuit using an n-channel switch Q1 and a dummy switch Q2 for clock-feedthrough cancellation. The capacitor C_hld holds the sampled voltage which is then buffered by an OpAmp.\n\nFig. 11.5 An open-loop track and hold realized using an n-channel switch along with a dummy switch for clock-feedthrough cancellation. The size of $Q_{2}$ is one-half that of $Q_{1}$.\n\nimage_name: Fig. 11.6\ndescription: The graph in Fig. 11.6 illustrates the clock waveforms for $V_{\\text{in}}$ and $\\phi_{\\text{clk}}$, demonstrating the effect of finite slope in the sampling clock on sampling-time jitter. This is a time-domain waveform graph.\n\n**Axes Labels and Units:**\n- The horizontal axis represents time, although specific units are not labeled on the graph.\n- The vertical axis represents voltage for both the input signal $V_{\\text{in}}$ and the clock signal $\\phi_{\\text{clk}}$.\n\n**Overall Behavior and Trends:**\n- The input signal $V_{\\text{in}}$ is shown as a smooth sinusoidal waveform.\n- The clock signal $\\phi_{\\text{clk}}$ is depicted as a square wave with finite rise and fall times, resulting in a non-instantaneous transition between high and low states.\n- The graph highlights the deviation between ideal and actual sampling times due to the finite slope of the clock signal.\n\n**Key Features and Technical Details:**\n- The ideal sampling times ($t_{s1\\text{-ideal}}$ and $t_{s2\\text{-ideal}}$) are marked where the clock transitions would ideally occur.\n- The actual sampling times ($t_{s1\\text{-actual}}$ and $t_{s2\\text{-actual}}$) are shown as deviating from the ideal times due to the finite slope, indicating the presence of sampling jitter.\n- The difference between ideal and actual sampling times is labeled as \"Sampling jitter.\"\n\nFig. 11.6 The clock waveforms for $V_{\\text{in}}$ and $\\phi_{\\text{clk}}$ used to illustrate how a finite slope for the sampling clock introduces sampling-time jitter.\n\n#### EXAMPLE 11.2\n\nConsider the S/H circuit of Fig. 11.3, where $V_{\\text{in}}$ is a 20-MHz band-limited signal with a 2-Vpp amplitude. Assume that $\\phi_{\\text{clk}}$ is a 100-MHz square wave having a peak amplitude of 2.5 V with linear rise and fall times of 1.5 ns. What is the maximum uncertainty of the sampling time? Assume $V_{\\text{tn}}$ is 0.8 V.\n\n#### Solution\n\nFirst, we note that the slope of $\\phi_{\\text{clk}}$ is (5 V) / (1.5 ns) = 3.33 V/ns, and the true sampling time is when the clock waveform is 0.8 V greater than the input signal.\n\nFor $V_{\\text{in}}$ equal to 1 V, the sampling transistor will turn off when $\\phi_{\\text{clk}}$ is 1.8 V, which is (0.7 V) / (3.33 V/ns) = 0.21 ns after the clock first starts to move down.\n\nWhen $V_{\\text{in}}$ is -1 V, the sampling time occurs when $\\phi_{\\text{clk}}$ is -0.2 V, which is 0.81 ns after the clock first starts to move upward.\n\nTherefore, the sampling-time uncertainty is 0.81 - 0.21 = 0.6 ns. Also, assuming the ideal sampling time is 0.75 ns after the clock first starts to move, the sampling jitter is from -0.54 ns to +0.06 ns from the ideal sampling time.\n\nA more elaborate sample-and-hold circuit is to include an opamp in a feedback loop, as shown in Fig. 11.7. When the clock, $\\phi_{\\text{clk}}$, is high, the complete circuit responds similarly to an opamp in a unity-gain feedback configuration. When $\\phi_{\\text{clk}}$ goes low, the input voltage at that time is stored on $C_{\\text{hld}}$, similarly to a simple sample-and-hold. By including an opamp in the feedback loop, the input impedance of the sample-and-hold is greatly increased. Another advantage of this configuration is that even if the unity-gain buffer at the output has an offset voltage, the dc error due to this buffer will be divided by the gain of the input opamp (although the input-offset of the input opamp will remain). Thus, very simple source followers can be used for the output buffer.\n\nimage_name: Fig. 11.7\ndescription:\n[\nname: A1, type: OpAmp, value: A1, ports: {InP: Vin, InN: Vout, OutP: Out(A1)}\nname: Q1, type: NMOS, ports: {S: Out(A1), D: In(1), G: clk}\nname: C_hld, type: Capacitor, value: C_hld, ports: {Np: In(1), Nn: GND}\nname: 1, type: OpAmp, value: 1, ports: {InP: In(1),OutP: Vout}\n]\nextrainfo: The circuit is a sample-and-hold configuration using an op-amp in a feedback loop to increase input impedance. The NMOS transistor is used as a switch controlled by a clock signal (Clk). The circuit includes a holding capacitor (Chld) to store the sampled voltage.\n\nFig. 11.7 Including an opamp in a feedback loop of a sample-and-hold to increase"
},
{
    "text": "Fig. 11.3 illustrates a straightforward CMOS track and hold circuit implemented using MOS technology. This circuit functions by tracking the input voltage, Vin, when the clock signal, clk, is high. Upon the clock signal dropping low, the voltage is preserved on the capacitor, C_hld.\n\nIn Fig. 11.3, we observe the most basic form of a sample and hold circuit achievable with CMOS technology. While the clock signal, $\\phi_{\\text{clk}}$, is high, the voltage $V'$ mirrors Vin. Ideally, $V'$ should remain constant after $\\phi_{\\text{clk}}$ falls, maintaining the value of Vin at the moment of the clock signal's. Regrettably, a negative hold step is introduced in $V'$ due to the channel charge of Q1. As Q1 is deactivated, its channel charge must dissipate into its junctions. Because this charge is negative, it induces negative glitches in the junction voltages. Assuming a low source impedance at the Vin node, the glitch at this node is minor and brief. Conversely, the negative charge migrating to the node connected to C_hld (node $V'$) generates a enduring negative voltage shift, persisting until Q1 is reactivated. If the clock $\\phi_{c \\mid k}$ deactivates swiftly, the channel charge, $Q_{\\mathrm{CH}}$, is distributed evenly between the two junctions, as the channel is sealed off at both ends near the junctions while the charge dissipates. The charge flowing to the $V'$ junction is thus calculated by the equation:\n\n$$\n\\Delta Q_{C_{\\text {hld }}}=\\frac{Q_{C H}}{2}=\\frac{C_{o x} W L V_{\\text {eff-1 }}}{2} \\tag{11.1}\n$$\n\nHere, $V_{\\text {eff-1 }}$ is determined by:\n\n$$\nV_{\\text {eff-1 }}=V_{\\mathrm{GS} 1}-V_{\\mathrm{tn}}=V_{D D}-V_{\\mathrm{tn}}-V_{\\mathrm{in}} \\tag{11.2}\n$$\n\n$V_{\\mathrm{in}}$ represents the input voltage at the instant Q1 is turned off. It is crucial to note that this outcome presumes the clock signal, $\\phi_{\\mathrm{cl}}$, fluctuates between $V_{\\mathrm{DD}}$ and the most negative voltage within the circuit.\n\nThe alteration in $V'$ voltage is ascertained using the $Q=CV$ relationship, resulting in:\n\n$$\n\\Delta \\mathrm{V}^{\\prime}=\\frac{\\Delta \\mathrm{Q}_{\\mathrm{C} \\text {-hld }}}{\\mathrm{C}_{\\text {hld }}}=-\\frac{\\mathrm{C}_{\\mathrm{ox}} \\mathrm{WLV}_{\\text {eff-1 }}}{2 \\mathrm{C}_{\\text {hld }}}=-\\frac{\\mathrm{C}_{0 \\mathrm{x}} \\mathrm{WL}\\left(\\mathrm{~V}_{\\mathrm{DD}}-\\mathrm{V}_{\\mathrm{tn}}-\\mathrm{V}_{\\text {in }}\\right)}{2 \\mathrm{C}_{\\text {hld }}} \\tag{11.3}\n$$\n\nNotably, $\\Delta \\mathrm{V}^{\\prime}$ bears a linear connection to $V_{\\mathrm{in}}$, leading to a gain error in the overall sample and hold circuit. However, more significantly, $\\Delta \\mathrm{V}^{\\prime}$ also exhibits a linear relationship with $V_{\\mathrm{tn}}$, which has a nonlinear correlation with the input signal, $V_{\\mathrm{in}}$, due to variations in the source-substrate voltage, prompting a body effect (assuming the substrate is linked to one of the voltage rails). This nonlinear relationship with $V_{\\text {in }}$ results in distortion for the entire sample and hold circuit.\n\nAn additional adjustment in $V'$ arises from the gate overlap capacitance. Utilizing a derivation akin to that employed to derive (10.8), we obtain:\n\n$$\n\\Delta \\mathrm{V}^{\\prime} \\cong-\\frac{\\mathrm{C}_{\\mathrm{ox}} \\mathrm{WL}_{\\mathrm{ov}}\\left(\\mathrm{~V}_{\\mathrm{DD}}-\\mathrm{V}_{\\mathrm{Ss}}\\right)}{\\mathrm{C}_{\\mathrm{hld}}} \\tag{11.4}\n$$\n\nHere, $V_{\\mathrm{Ss}}$ denotes the most negative voltage in the circuit. This component is typically smaller than that caused by the channel charge and manifests as a simple offset due to its independence from the signal. Hence, this error component is usually negligible since signal-independent offsets can commonly be eradicated in most systems. However, it may induce noise issues if precautions are not taken to ensure the clock signal, $\\phi_{\\mathrm{cl}}$, remains relatively free of noise. For instance, if the clock signal is contaminated by power-supply noise due to being generated by a straightforward inverter linked to digital power supplies, the power-supply rejection ratio of this circuit might be suboptimal."
},
{
    "text": "The text provided discusses various configurations of a sample-and-hold (S/H) circuit realized using CMOS technology, detailing the operation principles, potential errors, and proposed improvements. It begins with a simple open-loop S/H circuit using an NMOS switch, where the input voltage is tracked and held by a capacitor. The circuit is affected by charge injection from the switch, leading to a hold step and signal distortion. To mitigate this, a CMOS transmission gate or a dummy switch can be used, though these methods have practical limitations.\n\nThe impact of finite clock rise and fall times on sampling-time jitter is also explored, demonstrating that the actual sampling time deviates from the ideal due to the clock's slope. This introduces uncertainty in the sampling process.\n\nAn alternative approach involves using an operational amplifier (op-amp) in a feedback loop to increase input impedance and reduce errors. However, this can lead to stability issues and slower operation. An additional switch can be introduced to minimize slewing time when transitioning between track and hold modes.\n\nAn improved S/H configuration includes a holding capacitor in the feedback path of a second op-amp, which helps in reducing distortion and dc offset. This configuration also uses a switch to ground the output of the first op-amp during hold mode, speeding up the return to track mode and minimizing signal feedthrough.\n\nLastly, a modification with additional circuitry is presented to further minimize the hold pedestal and dc offset by matching charge injections into two capacitors, leveraging the common-mode rejection of the op-amps. This approach, while effective, has limitations due to impedance mismatches, which can be partially mitigated by adding small capacitors to key nodes.\n\nThroughout the text, various figures are referenced to illustrate the circuit configurations and waveforms, emphasizing the effects of charge injection, clock slopes, and circuit modifications on the performance of the S/H circuits."
},
{
    "text": "The original text provided a detailed description of various sample-and-hold (S/H) circuits implemented using MOS technology, highlighting their configurations, operations, and the challenges they face, such as charge injection and clock feedthrough errors. The text also included illustrative figures and numerical examples to explain the effects of these errors and proposed solutions to mitigate them.\n\nTo rephrase the provided text:\n\n---\n\nFigure 11.3 presents a straightforward sample-and-hold circuit implemented with CMOS technology. This circuit tracks the input voltage, Vin, when the clock signal, clk, is high. Upon the clock signal dropping low, the voltage is maintained by the capacitor, C_hld. Unfortunately, due to the channel charge of transistor Q1, a negative voltage step occurs when the clock signal transitions. Assuming a low source impedance at Vin, the glitch is minimized and. However, the voltage at the node connected to C_hld (V') experiences a more prolonged negative voltage change until Q1 is activated again. If the clock signal falls rapidly, the channel charge, Q_CH, is equally distributed to both junctions, leading to a specific charge calculation for the capacitor C_hld.\n\nThe voltage change at V' can be determined using the relationship Q=CV, resulting in a voltage change that is linearly dependent on Vin, causing gain error, and is also linearly related to Vtn, leading to distortion due to the body effect variations.\n\nGate overlap capacitance contributes additional changes to V', although this effect is generally smaller and appears as an offset since it is independent of the signal. However, noise issues may arise if the clock signal is not clean, potentially leading to poor power-supply rejection.\n\nFigure 11.4 introduces a modification using a CMOS transmission gate, aiming to cancel out charge injection effects. However, this approach has limitations due to the signal dependence of the turn-off times of the n-channel and p-channel transistors and is seldom perfectly achievable.\n\nFigure 11.5 demonstrates another technique involving a dummy switch to minimize clock feedthrough errors. By carefully matching the widths of the transistors and slightly delaying the clock signal of the dummy switch, the hold pedestal can be significantly reduced.\n\nFigure 11.6 illustrates the effect of finite clock waveform slopes on sampling-time jitter. The ideal sampling time is defined by the clock signal's zero-crossing, whereas the actual sampling time is affected by the voltage threshold of the transistor, leading to sampling jitter.\n\nFigure 11.7 showcases an S/H circuit with an op-amp in a feedback loop, enhancing input impedance. While this improves performance, stability requirements can limit its speed.\n\nFigure 11.8 introduces additional switches to minimize slewing time when transitioning from hold to track mode, addressing speed degradation concerns.\n\nFigure 11.9 presents an improved S/H configuration with the holding capacitor in the feedback path of a second op-amp, which offers signal-independent voltage changes and minimizes distortion and sampling-time jitter.\n\nFigure 11.10 further modifies the S/H circuit with additional circuitry to minimize the hold pedestal and dc offset by matching charge injections into two capacitors and using common-mode rejection of the op-amp.\n\nThese configurations and their analyses provide insights into the complexities and potential solutions in designing high-performance sample-and-hold circuits using MOS technology.\n\n---"
},
{
    "text": "An illustration of a basic sample-and-hold circuit using MOS technology is depicted in Fig. 11.3. The circuit, which operates in an open-loop configuration, employs an NMOS transistor (M1) and a capacitor (C_hld). During the high phase of the clock signal clk, the circuit tracks the input voltage Vin. When the clock signal drops to low, the voltage is preserved on the capacitor C_hld.\n\nThis particular sample-and-hold design is one of the simplest that can be constructed using CMOS technology. It functions by tracking the input voltage Vin when the clock signal clk is high, and maintaining a constant voltage equal to the Vin at the moment clk transitions to low. However, the design is not without its flaws. A negative step in voltage occurs at this transition due to the channel charge of Q1. This charge, being negative, leads to a sustained negative voltage change at the node connected to C_hld (node V').\n\nThe negative charge that flows to the node with C_hld connected to it causes a voltage change that is prolonged, lasting until Q1 turns on again. If the clock signal clk switches off rapidly, the channel charge Q_CH will distribute equally to both junctions, resulting in a pinched-off channel at both ends. The charge flowing to the junction labeled V' is thereby halved.\n\nThe voltage change V' can be calculated using the relationship Q=CV, which yields a linear relationship between V' and Vin. This linearity results in a gain error for the sample-and-hold circuit. Moreover, V' is also linearly related to Vtn, which introduces a nonlinear relationship with the input signal Vin, leading to distortion in the overall circuit performance.\n\nAn additional voltage change in V' arises from the gate overlap capacitance. This component, while generally smaller than the channel charge-induced change, manifests as an offset since it is independent of the signal. This error component is often negligible as signal-independent offsets can typically be removed in most systems. However, it may pose noise issues if the clock signal is not adequately noise-free.\n\nTo minimize the signal-dependent hold step, modifications such as replacing the n-channel switch with a CMOS transmission gate have been proposed. This approach aims to cancel out the charge injection from each transistor when the transmission gate switches off. However, achieving ideal conditions for this cancellation is challenging in practice.\n\nAnother proposed modification involves adding a dummy switch to minimize clock feedthrough errors. The concept is based on matching the charge injection into C_hld with an equivalent charge injection into another capacitor C_hld'. By carefully selecting the sizes of the transistors and ensuring fast clock waveforms, the effects of these voltage changes can be mitig through the common-mode rejection of the opamp.\n\nThese modifications and configurations aim to improve the performance of sample-and-hold circuits by addressing issues such as gain error, distortion, and sampling-time jitter. The use of opamps and feedback loops can provide advantages such as increased input impedance and reduced dc error, but stability requirements may limit the speed of operation.\n\nFigures 11.4, 11.5, 11.6, 11.7, 11.8, 11.9, and 11.10 depict various circuit configurations and modifications aimed at minimizing errors and improving performance. These include the use of transmission gates, dummy switches, additional opamps, and clock-feedthrough cancellation circuitry.\n\nIn summary, the design and optimization of sample-and-hold circuits using MOS technology involve careful consideration of various factors such as charge injection, clock feedthrough, and stability. Through the implementation of specific circuit configurations and modifications, it is possible to mitigate errors and enhance the overall performance of these circuits."
},
{
    "text": "An open-loop track and hold circuit is implemented using MOS technology. When the clock signal, clk, is high, the circuit tracks the input voltage, Vin. Upon clk transitioning to low, the voltage is preserved on the capacitor Chld. This simple sample-and-hold circuit can be realized in CMOS technology. When the clock signal clk is high, V' tracks Vin. When clk is low, V' ideally maintains a constant value equal to Vin at the instant clk went low. However, V' experiences a negative-going hold step caused by the channel charge of Q1. As Q1 turns off, its channel charge must dissipate from under its gate to its junctions. Since this charge is negative, it leads to negative glitches in the junction voltages. Assuming the source impedance at Vin is low, the glitch at this node is minor and brief. Nonetheless, the negative charge migrating to the node connected to Chld (node V') induces a lasting negative voltage change. If the clock clk switches off rapidly, the channel charge, QCH, disperses equally into both junctions, as the channel becomes pinched off near the junctions while the charge dissipates. Consequently, the charge flowing to the junction labeled V' is given by:\n\nQC_hld = (1/2) * QC_H = (1/2) * Cox * W * L * Veff-1\n\nwhere Veff-1 is:\n\nVeff-1 = VGS1 - Vtn = VDD - Vtn - Vin\n\nHere, Vin is the input voltage at the instant Q1 turns off. It is crucial to note that this outcome assumes the clock signal, clk, fluctuates between VDD and the most negative voltage in the circuit.\n\nThe change in V' is determined using the relationship Q = CV, resulting in:\n\nV' = QC_hld / Chld = - (Cox * W * L * Veff-1) / (2 * Chld) = - (Cox * W * L * (VDD - Vtn - Vin)) / (2 * Chld)\n\nNotably, V' is linearly related to Vin, causing gain error in the sample-and-hold circuit. More significantly, V' is also linearly related to Vtn, which has a nonlinear relationship with Vin due to variations in the source-substrate voltage causing a body effect (assuming the substrate is connected to one of the voltage rails). This nonlinear relationship with Vin leads to distortion in the overall sample-and-hold circuit.\n\nAn additional change in V' arises from the gate overlap capacitance. Using a derivation similar to that used to find (10.8), we have:\n\nV'  - (Cox * W * L_ov * (VDD - VSs)) / Chld\n\nwhere VSs is the most negative voltage in the circuit. This component is usually smaller than that due to the channel charge and appears as an offset since it is signal independent. Hence, this error component is typically insignificant as signal-independent offsets can often be eliminated in most systems. However, it may cause noise issues if the clock signal, clk, is not relatively noise-free.\n\n#### EXAMPLE 11.1\n\nConsider the sample-and-hold circuit of Fig. 11.3 with Chld = 1 pF, Cox = 8.5 fF/(m)^2, Vtn = 0.45 V, and (W/L)_1 = (5 m / 0.4 m). Assume the power supply voltage is 2 V. Calculate the hold step for Vin equal to 1 V and then for Vin equal to 0.5 V. Use these estimates for errors to estimate the dc offset.\n\n#### Solution\n\nAt Vin = 1 V, using (11.3), we find V'(1 V) = -4.7 mV. At Vin = 0.5 V, again using (11.3), we find V'(0.5 V) = -8.9 mV. The average offset is given by:\n\nVoffset-avg = (V'(1 V) + V'(0.5 V)) / 2 = -6.8 mV\n\nwhich is a reasonable estimate of the dc offset injected in this example.\n\nSeveral modifications have been proposed to minimize the signal-dependent hold step. One approach is to replace the n-channel switch with a CMOS transmission gate, as shown in Fig. 11.4. The concept is that if the p-channel transistor size matches the n-channel transistor, the charge injection from each transistor will cancel when the transmission gate turns off. This is somewhat true when Vin is in the middle region between power supplies, assuming fast and complementary clock waveforms. Unfortunately, these conditions are rarely achievable in practice. Considering the finite slopes of the clock waveforms, it is observed that the turn-off times of the transistors are signal-dependent, causing the n-channel transistor to turn off at different times than the p-channel transistor. Even ignoring errors from imperfect clock waveforms, when Vin is closer to VDD, the charge from the p-channel transistor exceeds that from the n-channel transistor due to its larger effective gate-source voltage, resulting in a positive hold step. The opposite occurs when the input signal is closer to the negative power supply. These effects seldom have the same magnitude in practice.\n\nAnother modification, often proposed to minimize clockfeedthrough errors, is to add a dummy switch as shown in Fig. 11.5. The theory is that if the width of Q2 is exactly half that of Q1, and the clock waveforms are fast, the charges will cancel. In practice, it is rarely possible to have the clock waveforms change fast enough for the ideal width ratio to be exactly one-half. When the ideal ratio is not one-half, it is challenging to achieve the optimal ratio required for perfect cancellation. However, when the clock waveforms are fast, this technique usually minimizes the hold pedestal to less than about one-fifth of the value it would have without it. For this to occur, the clock of Q2 must change slightly after that of Q1. This clock arrangement ensures that the cancelling charge of Q2 cannot escape through Q1 while it is still on.\n\nAnother source of error for the simple sample-and-hold of Fig. 11.3 arises from clock waveforms having finite slopes. To understand this error source, consider the waveforms for Vin and clk shown in Fig. 11.6. Assume the ideal sampling time is defined as the negative-going zero-crossing of clk. The true sampling time is when the sampling-clock voltage passes through the value when it is one transistor threshold voltage drop above the input voltage. In other words, transistor Q1 of Fig. 11.3 turns off when clk is Vtn above Vin, as shown in Fig. 11.6. Thus, when Vin is high, the true sampling time is earlier than the ideal sampling time, whereas when Vin is low (0 V), the true sampling time is late.\n\n#### EXAMPLE 11.2\n\nConsider the S/H circuit of Fig. 11.3, where Vin is a 20-MHz band-limited signal with a 2-Vpp amplitude. Assume that clk is a 100-MHz square wave having a peak amplitude of 2.5 V with linear rise and fall times of 1.5 ns. What is the maximum uncertainty of the sampling time? Assume Vtn is 0.8 V.\n\n#### Solution\n\nFirst, we note that the slope of clk is (5 V) / (1.5 ns) = 3.33 V/ns, and the true sampling time is when the clock waveform is 0.8 V greater than the input signal.\n\nFor Vin equal to 1 V, the sampling transistor will turn off when clk is 1.8 V, which is (0.7 V) / (3.33 V/ns) = 0.21 ns after the clock first starts to move down.\n\nWhen Vin is -1 V, the sampling time occurs when clk is -0.2 V, which is 0.81 ns after the clock first starts to move upward.\n\nTherefore, the sampling-time uncertainty is 0.81 - 0.21 = 0.6 ns. Also, assuming the ideal sampling time is 0.75 ns after the clock first starts to move, the sampling jitter is from -0.54 ns to +0.06 ns from the ideal sampling time.\n\nA more sophisticated sample-and-hold circuit includes an opamp in a feedback loop, as shown in Fig. 11.7. When the clock, clk, is high, the complete circuit behaves similarly to an opamp in a unity-gain feedback configuration. When clk goes low, the input voltage at that time is stored on Chld, similarly to a simple sample-and-hold. By incorporating an opamp in the feedback loop, the input impedance of the sample-and-hold is significantly increased. Another advantage of this configuration is that even if the unity-gain buffer at the output has an offset voltage, the dc error due to this buffer will be divided by the gain of the input opamp (although the input-offset of the input opamp will remain). Thus, very simple source followers can be used for the output buffer.\n\nA disadvantage of the configuration shown is that the speed of operation can be seriously degraded due to the necessity of ensuring that the loop is stable when it is closed. Another source of speed degradation is that when in hold mode, the opamp is open-loop, resulting in its output almost certainly saturating at one of the power-supply voltages. When the sample-and-hold next goes back into track mode, it will take some time for the opamp output voltage to slew back to its correct closed-loop value. This slewing time can be greatly minimized by adding two additional transistors as shown in Fig. 11.8. During hold mode, switch Q2 keeps the output of the first opamp close to the voltage it will need to be at when the T/H goes into track mode. It should also be noted that this track-and-hold configuration still has errors due to charge injection from the switch, Q1, similar to the simple S/H of Fig. 11.3. The errors due to finite clock rise and fall times are also similar.\n\nA similar, but improved, configuration is shown in Fig. 11.9. In this configuration, the holding capacitor is not connected to ground but is placed in the feedback path of a second opamp. This configuration has several desirable features. Perhaps the most important of these is due to the fact that, assuming the second opamp has a large gain, the voltages on both sides of switch Q1 are very nearly signal independent. Thus, when Q1 turns off, there will still be charge injection to the left side of Chld, which will cause the output voltage of opamp 2 to have a positive hold step, but this hold step will be just a dc offset and will be signal independent. In other words, the charge injection due to Q1 will cause some dc offset but no distortion. In addition, the sampling time will not change because of the finite slopes of the sampling-clock waveform.\n\nAnother advantage is due to the inclusion of Q2. This switch grounds the output of the first opamp during hold mode. (If the supply voltage is unipolar, the source of Q2 should instead be connected to a mid-rail dc voltage, as should the positive terminal of Opamp 2.) This grounding keeps the output of the first opamp close to the voltage it must change to when the S/H goes back into track mode. This approach greatly speeds up the time it takes the S/H to return to track mode. The switch also greatly minimizes signal feedthrough when the S/H is in hold mode by grounding the signal path.\n\nA major limitation of this configuration is that the speed will be degraded due to the necessity to ensure stability in the track mode. This limitation is worsened since there are now two opamps in the loop along with the on resistance of the sampling switch, Q1, during the closed-loop phase.\n\nFigure 11.10 shows an interesting modification of Fig. 11.9 by including some additional circuitry intended to minimize the hold pedestal and thereby minimize the dc offset. The basic idea is to match the charge injection into Chld with a similar charge injection into Chld'. Since these capacitors are chosen to have the same size, their voltage changes will match, and the common-mode rejection of the opamp will eliminate the effects of these voltage changes on the output voltage of the S/H. The major limitation of this approach is a second-order effect caused by a mismatch in impedance levels at the left of Q1 and the bottom of Q2. Errors due to this mismatch can be minimized by including small capacitors (0.5 pF to 1 pF) between each node and ground. These extra capacitors help keep these nodes at constant voltages while the clocks are turning off, assuming the clock waveforms are fast. It should be mentioned that the configuration of [Nayebi, 1989] was a fully differential design and is a very reasonable choice for many S/H applications."
},
{
    "text": "The text provided describes various configurations of sample-and-hold circuits, detailing their components, functionalities, and the errors associated with each design. The circuits utilize MOS transistors, capacitors, and operational amplifiers to track and hold input voltages, with a focus on minimizing distortion and offset errors.\n\nIn the initial configuration (Fig. 11.3), an NMOS transistor is used to track the input voltage when the clock signal is high and hold the voltage on a capacitor when the clock signal is low. However, this design introduces a negative hold step due to the channel charge of the NMOS transistor when it turns off, leading to signal distortion. This effect is quantified by equations (11.1) through (11.4), which describe the change in voltage and the associated errors due to charge injection and gate overlap capacitance.\n\nThe text then introduces a CMOS transmission gate (Fig. 11.4) as a modification to cancel out the charge injection effects. Despite this, signal-dependent hold steps and sampling-time jitter still occur due to the finite rise and fall times of the clock signal, as illustrated in Fig. 11.6.\n\nFurther modifications include the addition of a dummy switch (Fig. 11.5) to minimize clock feedthrough errors and the incorporation of an op-amp in a feedback loop (Fig. 11.7) to increase input impedance. The latter, however, may introduce stability concerns and speed limitations.\n\nAn improved configuration (Fig. 11.9) places the holding capacitor in the feedback path of a second op-amp, resulting in a dc offset that is signal-independent and minimizing distortion. An additional switch is introduced (Fig. 11.8) to reduce slewing time when transitioning back to track mode.\n\nThe final modification (Fig. 11.10) adds clock-feedthrough cancellation circuitry to further minimize the hold pedestal and dc offset. This is achieved by matching charge injections into two capacitors, leveraging the common-mode rejection of the op-amp to eliminate the effects on the output voltage.\n\nThroughout the text, equations and examples are provided to quantify the effects of the various circuit configurations on the hold step and sampling time, highlighting the trade-offs between speed, stability, and accuracy in sample-and-hold circuits."
},
{
    "text": "---[Rephrased Text]---\nThe circuit depicted in Fig. 11.10 is a sample-and-hold (S/H) circuit that incorporates clock-feedthrough cancellation features. It utilizes two NMOS transistors, Q1 and Q2, for the sampling and retention of the input signal Vin. An operational amplifier, A1, is employed to ensure the stability of the output voltage. Resistors and capacitors within the circuit are responsible for regulating timing and overall stability.\n\nFig. 11.11 represents an inverting track and hold circuit. Fig. 11.12 illustrates a noninverting sample-and-hold circuit that also includes clock-feedthrough cancellation. This circuit uses NMOS transistors Q1 and Q2 for the sampling and holding processes, which are governed by the clock signal clk. Capacitors C1 and C2 contribute to stability and timing control, while the operational amplifier A1 stabilizes the output voltage.\n\nThis section discusses various CMOS S/H circuits. The selection of the most appropriate sample-and-hold circuit depends heavily on the specific application needs and the available technology. Therefore, choosing the optimal circuit is complex and an ongoing area of research. It is challenging to definitively state which configurations are superior or inferior.\n\nIt is important to note that many of these circuits could also be implemented using BiCMOS technology, where a speed advantage can be achieved by increasing the unity-gain frequency of any opamps used. For even higher speeds, a BiCMOS circuit can leverage a bipolar diode bridge, as described in Section 11.4.\n\nThe S/H circuit shown in Fig. 11.11, as described by Ishikawa in 1988, is designed for high-speed operation, assuming the availability of a high-speed opamp capable of driving resistive loads. However, in CMOS technologies, such opamps are challenging to find. Moreover, the required output buffer could limit speed and signal swing. In bipolar and BiCMOS technologies, this configuration could be a very viable alternative. During track mode, Q1 is on and Q2 is off, resulting in the sample-and-hold acting as an inverting low-pass circuit with a -3dB frequency given by -3dB = 1/(RC). When Q1 turns off, the output voltage remains constant. Since the junctions of Q1 are always at voltages very close to ground, the clock feedthrough of this sample-and-hold is signal-independent. Additionally, finite clock rise and fall times do not make the sampling time a function of the signal. The role of Q2 is to minimize signal feedthrough during hold mode and to maintain the common node of the resistive network close to the voltage required when the S/H returns to track mode. In the implementation described by Ishikawa in 1988, an additional small bypass capacitor was included in parallel to the input resistor. It was reported and supported by analysis that this capacitor improved the speed of the S/H.\n\nAnother alternative is shown in Fig. 11.12, as described by Sone in 1993. This track-and-hold circuit configures the opamp as a unity-gain follower during track mode, with the positive input terminal of the opamp connected to Vin. When the T/H enters hold mode, the input signal is stored across C1, since Q1 is turned off. At the same time, transistor Q2 is also turned off. Ideally, the charge feedthrough from Q1, although signal-dependent, will be matched by the charge feedthrough from Q2, since both are at the same voltage and have the same clock waveforms. For this to be true, the opamp must have a low-impedance output. Furthermore, the signal dependence of the clock signals can be minimized by having clock signals that change above and below the input signal by fixed amounts. This can be partially realized using a high-output impedance OTA by having a load capacitor connected to ground, but without having a resistor included in series with the load capacitor (as would be required if lead compensation was desired). This is not too difficult to achieve using diode clamps in a bipolar or BiCMOS technology. In a CMOS technology, it is more difficult. Nonetheless, the topology of Fig. 11.12 is attractive for high-speed CMOS applications that are not too demanding.\n\nAnother S/H architecture is shown in Fig. 11.13, as described by Lim in 1991. Shown in Fig. 11.14(a) is the circuit configuration when the S/H is in sample mode. During this mode, the opamp is being reset, and both capacitors are connected between the input voltage and the virtual input of the opamp. Thus, the total capacitance that needs to be charged or discharged during this mode is C1 + C2. During hold mode, the configuration is as shown in Fig. 11.14(b). During this mode, the effective hold capacitor is the Miller capacitor given by Equation (11.6), which is typically much larger than the capacitance that needs to be charged during the sampling mode. This allows smaller capacitances and therefore smaller switches to be used than would otherwise be the case. Since the voltage changes at the output of the amplifier are very small, it is easy to design the amplifier for very high speed. The sampling switch, Q1, does inject signal-dependent charge as in other open-loop architectures, but again this is minimized by the large size of the Miller hold capacitance, especially if Q2 is turned off slightly before Q1.\n\nAt lower frequencies, there are several sample-and-hold architectures based on switched-capacitor technology that are often used. These S/H circuits tend to be quite accurate but not necessarily fast. A simple example is shown in Fig. 11.15. Note how similar this S/H is to the S/H of Fig. 11.13. During 1, capacitor CH is connected between the input signal source and the inverting input of the opamp. At the same time, the inverting input and the output of the opamp are connected together. This causes the voltages at both of these nodes to be equal to the input-offset voltage of the opamp, Voff. Thus, CH is charged up to Vin - Voff. Next, during 2, the opamp is taken out of reset mode, and the capacitor CH is connected between the opamp output and its inverting input. This will cause the output voltage to be equal to Vin, irrespective of the input-offset voltage of the opamp. Note that this circuit is an example of a sample-and-hold that is not thought of as a track-and-hold circuit. Specifically, during the sample phase, the opamp output voltage will be very close to 0 V (or whatever reference potential is connected to the positive opamp terminal in Fig. 11.15) rather than tracking the input voltage. This places a requirement on the opamp to have a very large slew rate, or the speed is seriously degraded. Also, obviously, the opamp output is invalid during 1, the sample phase.\n\nAn interesting variation somewhat similar to the S/Hs of Figs. 11.13 and 11.15 adds two unity-gain buffers and two more switches to help improve accuracy. The S/H is shown in Fig. 11.16, as described by Real in 1991. During sampling, all switches are on except Q2. This connects C1 and C2 together and charges them to the input voltage. During this time, the input impedance is quite large due to the inclusion of buffer B1. At the same time, the opamp is being reset and the positive terminal of the opamp is charged to 0 V. Next, Q4 and Q5 are turned off, and shortly thereafter Q1 and Q3 are turned off. Finally, Q2 is turned on. This configures the circuit as shown in Fig. 11.17. Note the similarity between this configuration and that of Fig. 11.14(b). The unity-gain feedback holds the output during this phase, and also the output impedance of the S/H is very low. Because Q4 and Q5 turn off slightly before Q1 and Q3, their clock feedthrough is not only signal-independent but largely cancels due to the common-mode rejection of the input stage of the amplifier, as described by Martin in 1987. The charge injection of Q1 and Q2 does not affect the output voltage. The charge injection of Q3 is signal-dependent and does affect the output voltage, but its effect is minimized by the loop gain similar to the S/H of Fig. 11.13.\n\nAn interesting variation on the S/Hs of Figs. 11.10 and 11.15 is the S/H shown in Fig. 11.18 from Gatti in 1992. This T/H has an output that is always valid and incorporates a number of features. During sample mode, the input-offset voltage of the first opamp is stored across Cof. At the same time, Cs is sampling the input voltage, and the second opamp is holding the previously-sampled input voltage. During the next phase, the inputoffset voltage of the first opamp is eliminated, and Cs is connected to the output while the feedback loop is enabled. This arrangement causes the output voltage to be equal to the just-sampled input voltage. The clock feedthrough of switch S2 is cancelled by the clock feedthrough of switch S3. The clock feedthrough of switch S5 is cancelled by the clock feedthrough of switch S6 and the added buffer network. The other switches ideally do not cause appreciable errors due to clock feedthrough. The details concerning the operation of this T/H and the required clocking waveforms are left for the interested reader to consult Gatti in 1992.\n\nYet another example of a switched-capacitor S/H is shown in Fig. 11.19, as described by Sooch in 1991. This circuit combines a sample-and-hold with a low-pass filter and was used to convert a signal from the sampled-data domain to the continuous-time domain at the output of a high-quality audio digital-to-analog converter based on oversampling techniques. The low-pass filtering was used to help convert from a single-bit high-frequency signal to a decimated lower-frequency multi-bit signal. During 1, C1 is connected between the input voltage and ground. Next, during 2, it is connected between the output and the inverting input of the opamp. At this time, its charge is shared with the charge being stored across C2, which came from previous samples. For low-frequency signals, the output voltage will equal the input voltage in the steady state. Higher frequency changes in the input signal will be lowpass filtered. For C2 greater than C1 by at least a few times, it can be shown using switched-capacitor analysis techniques, as described by Martin in 1980, that the -3dB frequency of the low-pass filter is approximately given by Equation (11.7), where fclk is the clock frequency. While this example does not eliminate the effects of opamp finite-input voltage offsets, unlike the previous two examples, it does have the advantage that its output is always valid.\n\nThe switched-capacitor sample-hold circuits just shown (except for that of Fig. 11.18) do have dc offsets due to clock feedthrough from the switches connected to the inverting inputs of the opamps. However, these offsets are largely signal-independent assuming the opamp has a reasonable gain. Also, it is possible to minimize these offsets by including a clock-feedthrough cancellation network connected to the positive input of the opamp, similar to what is described in Martin in 1987. Alternatively, fully differential sample-and-holds can be used, which also helps minimize the effects of clock feedthrough."
},
{
    "text": "```\nImage Descriptions: Any images linked in the [Context Provided] have been converted into textual descriptions. You also need to rephrase it to maintain the original meaning and length.\n---[Task]---\nPlease rephrase the provided text in [Context Provided] Section. Ensure the rephrased version maintains the original meaning and length. Only output the rephrased text.\n---[Context Provided]---\nThe provided text:\n```\nimage_name:Fig. 11.10\ndescription:\n[\nname: Q1, type: NMOS, ports: {S: X, D: InN(A1), G: clk}\nname: Q2, type: NMOS, ports: {S: GND, D: X, G: clk_bar}\nname: R1, type: Resistor, value: R, ports: {N1: Vin, N2: X}\nname: R2, type: Resistor, value: R, ports: {N1: X, N2: Vout}\nname: C, type: Capacitor, value: C, ports: {Np: InN(A1), Nn: Vout}\nname: A1, type: OpAmp, value: A1, ports: {InP: GND, InN: InN(A1), OutP: Vout}\n]\nextrainfo: circuit is a sample-and-hold (S/H) circuit with clock-feedthrough cancellation circuitry. It uses two NMOS transistors (Q1 and Q2) to manage the sampling and holding of the input signal Vin. The operational amplifier (A1) stabilizes the output voltage. Resistors and capacitors are used to control the timing and stability of the circuit.\n\nFig. 11.11 An inverting track and hold.\nimage_name:Fig. 11.12 A simple noninverting sample-and-hold with clock-feedthrough cancellation.\ndescription:\n[\nname: Q1, type: NMOS, ports: {S: Vin, D: InP(A1), G: clk}\nname: Q2, type: NMOS, ports: {S: Vout, D: InN(A1), G: clk}\nname: C1, type: Capacitor, value: C1, ports: {Np: InP(A1), Nn: GND}\nname: C2, type: Capacitor, value: C2, ports: {Np: InN(A1), Nn: Vout}\nname: A1, type: OpAmp, value: A1, ports: {InP: InP(A1), InN: InN(A1), OutP: Vout}\n]\nextrainfo:The circuit is a noninverting sample-and-hold circuit with clock-feedthrough cancellation. NMOS transistors Q1 and Q2 are used for sampling and holding, controlled by the clock signal clk. Capacitors C1 and C2 are used for stability and timing control. The operational amplifier A1 stabilizes the output voltage.\n\nFig. 11.12 A simple noninverting sample-and-hold with clock-feedthrough cancellation.\n\nIn this section, a number of CMOS S/H circuits are described. The optimum choice for a sample-andhold circuit is highly dependent on the application's requirements and the technology available. Therefore, choosing the best circuit is nontrivial and a matter of ongoing research. For these reasons, it is difficult to definitively state which configurations are superior or inferior.\n\nBefore proceeding, it should be noted that many of these circuits could also be realized in a BiCMOS technology, where a speed advantage would be obtained by increasing the unity-gain frequency of any opamps used. For even higher speeds, a BiCMOS circuit can make use of a bipolar diode bridge, as described in Section 11.4.\n\nThe S/H circuit shown in Fig. 11.11 [Ishikawa, 1988] is intended to operate at high speeds, assuming a high-speed opamp capable of driving resistive loads is available. Unfortunately, in CMOS technologies, such opamps are difficult to obtain. Furthermore, the required output buffer would not only limit speed, but could also limit the signal swing. In bipolar and BiCMOS technologies, this configuration could be a very viable alternative. When in track mode, $Q_{1}$ is on and $Q_{2}$ is off, resulting in the sample-and-hold acting as an inverting low-pass circuit having a $-3-\\mathrm{dB}$ frequency given by $\\omega_{-3 \\mathrm{~dB}}=1 /(\\mathrm{RC})$. When $Q_{1}$ turns off, the output voltage will remain constant from then on. Since the junctions of $Q_{1}$ are always at voltages very close to ground, the clock feedthrough of this sample-and-hold is signal independent. Also, finite clock rise and fall times do not make the sampling time a function of the signal, either. The function of $Q_{2}$ is to minimize signal feedthrough when in hold mode and to keep the common node of the resistive network close to the voltage required when the S/H goes back into track mode. In the implementation described in [Ishikawa, 1988], an additional small bypass capacitor was included in parallel to the input resistor. It was reported, and supported by analysis, that this capacitor improved the speed of the $\\mathrm{S} / \\mathrm{H}$.\n\nAnother alternative is shown in Fig. 11.12 [Sone, 1993]. This track-and-hold places the opamp into a unitygain follower during track mode. Also, the positive input terminal of the opamp is connected to $\\mathrm{V}_{\\text {in }}$ at this time. When the $T / H$ goes into hold mode, the input signal is stored across $C_{1}$, since $Q_{1}$ is turned off. At the same time, transistor $Q_{2}$ is also turned off. Ideally, the charge feedthrough from $Q_{1}$, although signal dependent, will be matched by the charge feedthrough from $Q_{2}$, since both are at the same voltage and have the same clock waveforms. For this to be true, the opamp must have a low-impedance output. ${ }^{2}$ Furthermore, the signal dependence of the clock signals can be minimized by having clock signals that change above and below the input signal by fixed\n2. This can be partially realized using a high-output impedance OTA by having a load capacitor connected to ground, but without having a resistor included in series with the load capacitor (as would be required if lead compensation was desired).\namounts. As will be seen in the next section, this is not too difficult to realize using diode clamps in a bipolar or BiCMOS technology. In a CMOS technology, it is more difficult. Regardless, the topology of Fig. 11.12 is attractive for high-speed CMOS applications that are not too demanding.\n\nYet another S/H architecture is shown in Fig. 11.13 [Lim, 1991]. Shown in Fig. 11.14(a) is the circuit configuration when the S/H is in sample mode. During this mode, the opamp is being reset, and both capacitors are connected between the input voltage and the virtual input of the opamp. Thus the total capacitance that needs to be charged or discharged during this mode is $\\mathrm{C}_{1}+\\mathrm{C}_{2}$. During hold mode, the configuration is as shown in Fig. 11.14(b). During this mode, the effective hold capacitor is the Miller capacitor given by\n\n$$\n\\begin{equation*}\nC_{\\text {hld-eff }}=(1+A)\\left(\\frac{C_{1} C_{2}}{C_{1}+C_{2}}\\right) \\tag{11.6}\n\\end{equation*}\n$$\n\nwhich is typically much larger than the capacitance that needs to be charged during the sampling mode. This allows smaller capacitances and therefore smaller switches to be used than would otherwise be the case. Since the voltage changes at the output of the amplifier are very small, it is easy to design the amplifier for very high speed. The sampling switch, $Q_{1}$, does inject signal-dependent charge as in other open-loop architectures, but again this is minimized by the large size of the Miller hold capacitance, especially if $Q_{2}$ is turned off slightly before $\\mathrm{Q}_{1}$.\n\nAt lower frequencies, there are a number of sample-and-hold architectures based on switched-capacitor technology that are often used. These $\\mathrm{S} / \\mathrm{Hs}$ tend to be quite accurate but not necessarily fast. A simple example is shown in Fig. 11.15. Note how similar this $\\mathrm{S} / \\mathrm{H}$ is to the $\\mathrm{S} /$ H of Fig. 11.13. During $\\phi_{1}$, capacitor $C_{H}$ is connected between the input signal source and the inverting input of the opamp. At the same time, the inverting input and the output of the opamp are connected together. This causes the voltages at both of these nodes to be equal to the input-offset voltage of the opamp, $\\mathrm{V}_{\\text {off. }}$ Thus, $\\mathrm{C}_{\\mathrm{H}}$ is charged up to $\\mathrm{V}_{\\text {in }}-\\mathrm{V}_{\\text {off }}$. Next, during $\\phi_{2}$, the opamp is taken out of reset mode, and the capacitor $\\mathrm{C}_{\\mathrm{H}}$ is connected between the opamp output and its inverting input. This will cause the output voltage to be equal to $\\mathrm{V}_{\\text {in}}$, irrespective of the input-offset voltage of the opamp. Note that this circuit is an example of a sample-and-hold that is not thought of as a track-and-hold circuit. Specifically, during the sample phase, the opamp output voltage will be very close to 0 V (or whatever reference potential is connected to the positive opamp terminal in Fig. 11.15) rather than tracking the input voltage. This places a requirement on the opamp to have a very large slew rate, or the speed is seriously degraded. Also, obviously, the opamp output is invalid during $\\phi_{1}$, the sample phase.\nimage_name:(a)\ndescription:\n[\nname: C1, type: Capacitor, value: C1, ports: {Np: Vin, Nn: InN(A1)}\nname: C2, type: Capacitor, value: C2, ports: {Np: Vout, Nn: Out(A1)}\nname: A1, type: OpAmp, value: A1, ports: {InP: GND, InN: InN(A1), OutP: Out(A1)}\n]\nextrainfo:This is a sample-and-hold circuit in sample mode. The op-amp output is invalid during the sample phase, and the input voltage is sampled across capacitor C1. The output voltage is held by capacitor C2.\nimage_name:(b)\ndescription:\n[\nname: C1, type: Capacitor, value: C1, ports: {Np: InN(A1), Nn: Vout}\nname: C2, type: Capacitor, value: C2, ports: {Np: Vout, Nn: Out(A1)}\nname: A1, type: OpAmp, value: A1, ports: {InP: GND, InN: InN(A1), OutP: Out(A1)}\n]\nextrainfo:The circuit represents a sample-and-hold configuration in hold mode with two capacitors and an operational amplifier. C1 is connected between the input and output, while C2 is connected between the output and ground. The op-amp is configured with its non-inverting input grounded.\n\nFig. 11.14 The circuit configurations of the $S / H$ of Fig. 11.13 during ( a) sa mple mode and (b) hold mode.\nimage_name:Fig. 11.16\ndescription:\n[\nname: 1, type: NMOS, ports: {S: Vin, D: X, G: 1}\nname: 2, type: NMOS, ports: \n"
},
{
    "text": "The provided text:\n\n```\nimage_name:Fig. 11.10\ndescription:\n[\nname: Q1, type: NMOS, ports: {S: X, D: InN(A1), G: clk}\nname: Q2, type: NMOS, ports: {S: GND, D: X, G: clk_bar}\nname: R1, type: Resistor, value: R, ports: {N1: Vin, N2: X}\nname: R2, type: Resistor, value: R, ports: {N1: X, N2: Vout}\nname: C, type: Capacitor, value: C, ports: {Np: InN(A1), Nn: Vout}\nname: A1, type: OpAmp, value: A1, ports: {InP: GND, InN: InN(A1), OutP: Vout}\n]\nextrainfo:This circuit is a sample-and-hold (S/H) circuit with clock-feedthrough cancellation circuitry. It utilizes two NMOS transistors (Q1 and Q2) for sampling and holding the input signal Vin. The operational amplifier (A1) stabilizes the output voltage. Resistors and capacitors are employed to control the timing and stability of the circuit.\n\nFig. 11.11 An inverting track and hold.\nimage_name:Fig. 11.12 A simple noninverting sample-and-hold with clock-feedthrough cancellation.\ndescription:\n[\nname: Q1, type: NMOS, ports: {S: Vin, D: InP(A1), G: clk}\nname: Q2, type: NMOS, ports: {S: Vout, D: InN(A1), G: clk}\nname: C1, type: Capacitor, value: C1, ports: {Np: InP(A1), Nn: GND}\nname: C2, type: Capacitor, value: C2, ports: {Np: InN(A1), Nn: Vout}\nname: A1, type: OpAmp, value: A1, ports: {InP: InP(A1), InN: InN(A1), OutP: Vout}\n]\nextrainfo:This circuit is a noninverting sample-and-hold circuit with clock-feedthrough cancellation. NMOS transistors Q1 and Q2 are used for sampling and holding, controlled by the clock signal clk. Capacitors C1 and C2 are used for stability and timing control. The operational amplifier A1 stabilizes the output voltage.\n\nFig. 11.12 A simple noninverting sample-and-hold with clock-feedthrough cancellation.\n\nIn this section, various CMOS S/H circuits are described. The optimal choice for a sample-and-hold circuit is highly dependent on the application's requirements and the technology available. Therefore, selecting the best circuit is nontrivial and an ongoing area of research. For these reasons, it is challenging to definitively state which configurations are superior or inferior.\n\nBefore proceeding, it should be noted that many of these circuits could also be implemented in a BiCMOS technology, where a speed advantage would be achieved by increasing the unity-gain frequency of any opamps used. For even higher speeds, a BiCMOS circuit can leverage a bipolar diode bridge, as described in Section 11.4.\n\nThe S/H circuit shown in Fig. 11.11 [Ishikawa, 1988] is designed to operate at high speeds, assuming a high-speed opamp capable of driving resistive loads is available. Unfortunately, in CMOS technologies, such opamps are difficult to obtain. Moreover, the required output buffer would not only limit speed, but could also limit the signal swing. In bipolar and BiCMOS technologies, this configuration could be a very viable alternative. When in track mode, $Q_{1}$ is on and $Q_{2}$ is off, resulting in the sample-and-hold acting as an inverting low-pass circuit having a $-3-\\mathrm{dB}$ frequency given by $\\omega_{-3 \\mathrm{~dB}}=1 /(\\mathrm{RC})$. When $Q_{1}$ turns off, the output voltage will remain constant from then on. Since the junctions of $Q_{1}$ are always at voltages very close to ground, the clock feedthrough of this sample-and-hold is signal independent. Also, finite clock rise and fall times do not make the sampling time a function of the signal, either. The function of $Q_{2}$ is to minimize signal feedthrough when in hold mode and to keep the common node of the resistive network close to the voltage required when the S/H goes back into track mode. In the implementation described in [Ishikawa, 1988], an additional small bypass capacitor was included in parallel to the input resistor. It was reported, and supported by analysis, that this capacitor improved the speed of the $\\mathrm{S} / \\mathrm{H}$.\n\nAnother alternative is shown in Fig. 11.12 [Sone, 1993]. This track-and-hold circuit configures the opamp into a unitygain follower during track mode. Additionally, the positive input terminal of the opamp is connected to $\\mathrm{V}_{\\text {in }}$ during this time. When the $T / H$ enters hold mode, the input signal is stored across $C_{1}$, since $Q_{1}$ is turned off. At the same time, transistor $Q_{2}$ is also turned off. Ideally, the charge feedthrough from $Q_{1}$, although signal dependent, will be matched by the charge feedthrough from $Q_{2}$, since both are at the same voltage and have the same clock waveforms. For this to be true, the opamp must have a low-impedance output. ${ }^{2}$ Furthermore, the signal dependence of the clock signals can be minimized by having clock signals that change above and below the input signal by fixed\n2. This can be partially realized using a high-output impedance OTA by having a load capacitor connected to ground, but without having a resistor included in series with the load capacitor (as would be required if lead compensation was desired).\namounts. As will be seen in the next section, this is not too difficult to realize using diode clamps in a bipolar or BiCMOS technology. In a CMOS technology, it is more difficult. Regardless, the topology of Fig. 11.12 is attractive for high-speed CMOS applications that are not too demanding.\n\nYet another S/H architecture is shown in Fig. 11.13 [Lim, 1991]. Shown in Fig. 11.14(a) is the circuit configuration when the S/H is in sample mode. During this mode, the opamp is being reset, and both capacitors are connected between the input voltage and the virtual input of the opamp. Thus the total capacitance that needs to be charged or discharged during this mode is $\\mathrm{C}_{1}+\\mathrm{C}_{2}$. During hold mode, the configuration is as shown in Fig. 11.14(b). During this mode, the effective hold capacitor is the Miller capacitor given by\n\n$$\n\\begin{equation*}\nC_{\\text {hld-eff }}=(1+A)\\left(\\frac{C_{1} C_{2}}{C_{1}+C_{2}}\\right) \\tag{11.6}\n\\end{equation*}\n$$\n\nwhich is typically much larger than the capacitance that needs to be charged during the sampling mode. This allows smaller capacitances and therefore smaller switches to be used than would otherwise be the case. Since the voltage changes at the output of the amplifier are very small, it is easy to design the amplifier for very high speed. The sampling switch, $Q_{1}$, does inject signal-dependent charge as in other open-loop architectures, but again this is minimized by the large size of the Miller hold capacitance, especially if $Q_{2}$ is turned off slightly before $\\mathrm{Q}_{1}$.\n\nAt lower frequencies, there are several sample-and-hold architectures based on switched-capacitor technology that are often used. These $\\mathrm{S} / \\mathrm{Hs}$ tend to be quite accurate but not necessarily fast. A simple example is shown in Fig. 11.15. Note how similar this $\\mathrm{S} / \\mathrm{H}$ is to the $\\mathrm{S} /$ H of Fig. 11.13. During $\\phi_{1}$, capacitor $C_{H}$ is connected between the input signal source and the inverting input of the opamp. At the same time, the inverting input and the output of the opamp are connected together. This causes the voltages at both of these nodes to be equal to the input-offset voltage of the opamp, $\\mathrm{V}_{\\text {off. }}$ Thus, $\\mathrm{C}_{\\mathrm{H}}$ is charged up to $\\mathrm{V}_{\\text {in }}-\\mathrm{V}_{\\text {off }}$. Next, during $\\phi_{2}$, the opamp is taken out of reset mode, and the capacitor $\\mathrm{C}_{\\mathrm{H}}$ is connected between the opamp output and its inverting input. This will cause the output voltage to be equal to $\\mathrm{V}_{\\text {in}}$, irrespective of the input-offset voltage of the opamp. Note that this circuit is an example of a sample-and-hold that is not thought of as a track-and-hold circuit. Specifically, during the sample phase, the opamp output voltage will be very close to 0 V (or whatever reference potential is connected to the positive opamp terminal in Fig. 11.15) rather than tracking the input voltage. This places a requirement on the opamp to have a very large slew rate, or the speed is seriously degraded. Also, obviously, the opamp output is invalid during $\\phi_{1}$, the sample phase.\nimage_name:(a)\ndescription:\n[\nname: C1, type: Capacitor, value: C1, ports: {Np: Vin, Nn: InN(A1)}\nname: C2, type: Capacitor, value: C2, ports: {Np: Vout, Nn: Out(A1)}\nname: A1, type: OpAmp, value: A1, ports: {InP: GND, InN: InN(A1), OutP: Out(A1)}\n]\nextrainfo:This is a sample-and-hold circuit in sample mode. The op-amp output is invalid during the sample phase, and the input voltage is sampled across capacitor C1. The output voltage is held by capacitor C2.\nimage_name:(b)\ndescription:\n[\nname: C1, type: Capacitor, value: C1, ports: {Np: InN(A1), Nn: Vout}\nname: C2, type: Capacitor, value: C2, ports: {Np: Vout, Nn: Out(A1)}\nname: A1, type: OpAmp, value: A1, ports: {InP: GND, InN: InN(A1), OutP: Out(A1)}\n]\nextrainfo:The circuit represents a sample-and-hold configuration in hold mode with two capacitors and an operational amplifier. C1 is connected between the input and output, while C2 is connected between the output and ground. The op-amp is configured with its non-inverting input grounded.\n\nFig. 11.14 The circuit configurations of the $S / H$ of Fig. 11.13 during ( a) sa mple mode and (b) hold mode.\nimage_name:Fig. 11.16\ndescription:\n[\nname: 1, type: NMOS, ports: {S: Vin, D: X, G: 1}\nname: 2, type: NMOS, ports: {S: X, D: Vout, G: 2}\nname: C_H, type: Capacitor, value: C_H, ports: {Np: X, Nn: InN(A1)}\nname: 1, type: NMOS, ports: {S: InN(A1), D: Vout, G: 1}\nname: A1, type: OpAmp, value: A1, ports: {InP: GND, InN: InN(A1), OutP: Vout}\n]\nextrainfo:The circuit represents a sample-and-hold configuration in hold mode with two capacitors and an operational amplifier. The op-amp is configured with its non-inverting input grounded. During sampling, all switches are on except 2.\n\nFig. 11.15 A simple switched-capacitor S/H.\nimage_name:Fig. 11.15\ndescription:The circuit represents a sample-and-hold configuration in hold mode with two capacitors and an operational amplifier. The op-amp is configured with its non-inverting input grounded. During sampling, all switches are on except 2.\n\nFig. 11.16 A recycling $S / H$.\n\nAn interesting variation somewhat similar to the S/Hs of Figs. 11.13 and 11.15 adds two unity-gain buffers and two more switches to help improve accuracy. The $\\mathrm{S} / \\mathrm{H}$ is shown in Fig. 11.16 [Real, 1991]. During sampling, all switches are on except $Q_{2}$. This connects $C_{1}$ and $C_{2}$ together and charges them to the input voltage. During this time, the input impedance is quite large due to the inclusion of buffer $\\mathrm{B}_{1}$. At the same time, the opamp is being reset and the positive terminal of the opamp is charged to 0 V . Next, $Q_{4}$ and $Q_{5}$ are turned off, and shortly thereafter $Q_{1}$ and $Q_{3}$ are turned off. Finally, $Q_{2}$ is turned on. This configures the circuit as shown in Fig. 11.17. Note the similarity between this configuration and that of Fig. 11.14(b). The unity-gain feedback holds the output during this phase, and also the output impedance of the $\\mathrm{S} / \\mathrm{H}$ is very low. Because $\\mathrm{Q}_{4}$ and $\\mathrm{Q}_{5}$ turn off slightly before $Q_{1}$ and $Q_{3}$, their clock feedthrough is not only signal independent but largely cancels due to the common-mode rejection of the input stage of the amplifier [Martin, 1987]. The charge injection of $Q_{1}$ and $Q_{2}$ does not affect the output voltage. The charge injection of $Q_{3}$ is signal dependent and does affect the output voltage, but its effect is minimized by the loop gain similar to the S/H of Fig. 11.13.\n\nAn interesting variation on the $\\mathrm{S} / \\mathrm{Hs}$ of Figs. 11.10 and 11.15 is the $\\mathrm{S} / \\mathrm{H}$ shown in Fig. 11.18 from [Gatti, 1992]. This T/H has an output that is always valid and incorporates a number of features. During sample mode, the input-offset voltage of the first opamp is stored across $\\mathrm{C}_{\\mathrm{OF}}$. At the same time, $\\mathrm{C}_{\\mathrm{S}}$ is sampling the input voltage, and the second opamp is holding the previously-sampled input voltage. During the next phase, the inputoffset voltage of the first opamp is eliminated, and $\\mathrm{C}_{\\mathrm{s}}$ is connected to the output while the feedback loop is enabled. This arrangement causes the output voltage to be equal to the just-sampled input voltage. The clock feedthrough of switch $S_{2}$ is cancelled by the clock feedthrough of switch $S_{3}$. The clock feedthrough of switch $S_{5}$ is cancelled by the clock feedthrough of switch $\\mathrm{S}_{6}$ and the added buffer network. The other switches ideally do not cause appreciable errors due to clock feedthrough. The details concerning the operation of this T/H and the required clocking waveforms are left for the interested reader to consult [Gatti, 1992].\nimage_name:Fig. 11.17\ndescription:The circuit is a sample-and-hold with a low-pass filter, used for converting a sampled-data signal to a continuous-time signal in a DAC application. It includes buffers and an operational amplifier for signal processing.\n\nFig. 11.17 The S/H of Fig. 11.16 when in hold mode.\n\nYet another example of a switched-capacitor S/H is shown in Fig. 11.19 [Sooch, 1991]. This circuit combines a sample-and-hold with a low-pass filter and was used to convert a signal from the sampled-data domain to the continuous-time domain at the output of a high-quality audio digital-to-analog converter based on oversampling techniques. The low-pass filtering was used to help convert from a single-bit high-frequency signal to a decimated lower"
},
{
    "text": "Rephrased Text:\n\n```\nImage Name: Fig. 11.10\nDescription:\n[\nName: Q1, Type: NMOS, Ports: {S: X, D: InN(A1), G: clk}\nName: Q2, Type: NMOS, Ports: {S: GND, D: X, G: clk_bar}\nName: R1, Type: Resistor, Value: R, Ports: {N1: Vin, N2: X}\nName: R2, Type: Resistor, Value: R, Ports: {N1: X, N2: Vout}\nName: C, Type: Capacitor, Value: C, Ports: {Np: InN(A1), Nn: Vout}\nName: A1, Type: OpAmp, Value: A1, Ports: {InP: GND, InN: InN(A1), OutP: Vout}\n]\nAdditional Information: This circuit is a sample-and-hold (S/H) circuit that incorporates clock-feedthrough cancellation. Two NMOS transistors (Q1 and Q2) are employed for the sampling and retention of the input signal Vin. The operational amplifier (A1) ensures the stability of the output voltage. Resistors and capacitors are utilized to manage the timing and stability of the circuit.\n\nImage Name: Fig. 11.11 An inverting track and hold.\nImage Name: Fig. 11.12 A simple noninverting sample-and-hold with clock-feedthrough cancellation.\nDescription:\n[\nName: Q1, Type: NMOS, Ports: {S: Vin, D: InP(A1), G: clk}\nName: Q2, Type: NMOS, Ports: {S: Vout, D: InN(A1), G: clk}\nName: C1, Type: Capacitor, Value: C1, Ports: {Np: InP(A1), Nn: GND}\nName: C2, Type: Capacitor, Value: C2, Ports: {Np: InN(A1), Nn: Vout}\nName: A1, Type: OpAmp, Value: A1, Ports: {InP: InP(A1), InN: InN(A1), OutP: Vout}\n]\nAdditional Information: This is a noninverting sample-and-hold circuit that includes clock-feedthrough cancellation. NMOS transistors Q1 and Q2 are responsible for the sampling and holding, controlled by the clock signal clk. Capacitors C1 and C2 contribute to stability and timing control. The operational amplifier A1 stabilizes the output voltage.\n\nImage Name: Fig. 11.12 A simple noninverting sample-and-hold with clock-feedthrough cancellation.\n\nThis section describes various CMOS S/H circuits. The optimal choice for a sample-and-hold circuit depends significantly on the application requirements and available technology. Therefore, selecting the best circuit is complex and an ongoing area of research. For these reasons, it is challenging to definitively determine which configurations are superior or inferior.\n\nIt is important to note that many of these circuits could also be implemented in BiCMOS technology, where a speed advantage could be gained by increasing the unity-gain frequency of any opamps used. For even higher speeds, a BiCMOS circuit can leverage a bipolar diode bridge, as described in Section 11.4.\n\nThe S/H circuit depicted in Fig. 11.11 [Ishikawa, 1988] is designed for high-speed operation, assuming a high-speed opamp capable of driving resistive loads is available. However, in CMOS technologies, such opamps are difficult to obtain. Additionally, the required output buffer would not only limit speed but could also restrict the signal swing. In bipolar and BiCMOS technologies, this configuration could be a very viable alternative. During track mode, Q1 is on and Q2 is off, resulting in the sample-and-hold acting as an inverting low-pass circuit with a -3dB frequency given by -3dB = 1/(RC). When Q1 turns off, the output voltage remains constant thereafter. Since the junctions of Q1 are always at voltages very close to ground, the clock feedthrough of this sample-and-hold is signal independent. Additionally, finite clock rise and fall times do not make the sampling time a function of the signal. The function of Q2 is to minimize signal feedthrough during hold mode and to keep the common node of the resistive network close to the voltage required when the S/H returns to track mode. In the implementation described in [Ishikawa, 1988], an additional small bypass capacitor was included in parallel to the input resistor. It was reported, and supported by analysis, that this capacitor improved the speed of the S/H.\n\nAnother alternative is shown in Fig. 11.12 [Sone, 1993]. This track-and-hold circuit configures the opamp as a unity-gain follower during track mode. Additionally, the positive input terminal of the opamp is connected to Vin at this time. When the T/H enters hold mode, the input signal is stored across C1, since Q1 is turned off. At the same time, transistor Q2 is also turned off. Ideally, the charge feedthrough from Q1, although signal dependent, will be matched by the charge feedthrough from Q2, since both are at the same voltage and have the same clock waveforms. For this to be true, the opamp must have a low-impedance output. Furthermore, the signal dependence of the clock signals can be minimized by having clock signals that change above and below the input signal by fixed amounts. This can be partially realized using a high-output impedance OTA by having a load capacitor connected to ground, but without having a resistor included in series with the load capacitor (as would be required if lead compensation was desired). In a CMOS technology, it is more difficult. Regardless, the topology of Fig. 11.12 is appealing for high-speed CMOS applications that are not too demanding.\n\nAnother S/H architecture is shown in Fig. 11.13 [Lim, 1991]. Shown in Fig. 11.14(a) is the circuit configuration when the S/H is in sample mode. During this mode, the opamp is being reset, and both capacitors are connected between the input voltage and the virtual input of the opamp. Thus, the total capacitance that needs to be charged or discharged during this mode is C1 + C2. During hold mode, the configuration is as shown in Fig. 11.14(b). During this mode, the effective hold capacitor is the Miller capacitor given by:\n\nC_hld-eff = (1+A)(C1*C2 / (C1 + C2))  (11.6)\n\nwhich is typically much larger than the capacitance that needs to be charged during the sampling mode. This allows smaller capacitances and therefore smaller switches to be used than would otherwise be the case. Since the voltage changes at the output of the amplifier are very small, it is easy to design the amplifier for very high speed. The sampling switch, Q1, does inject signal-dependent charge as in other open-loop architectures, but again this is minimized by the large size of the Miller hold capacitance, especially if Q2 is turned off slightly before Q1.\n\nAt lower frequencies, there are several sample-and-hold architectures based on switched-capacitor technology that are often used. These S/Hs tend to be quite accurate but not necessarily fast. A simple example is shown in Fig. 11.15. Note how similar this S/H is to the S/H of Fig. 11.13. During 1, capacitor CH is connected between the input signal source and the inverting input of the opamp. At the same time, the inverting input and the output of the opamp are connected together. This causes the voltages at both of these nodes to be equal to the input-offset voltage of the opamp, Voff. Thus, CH is charged up to Vin - Voff. Next, during 2, the opamp is taken out of reset mode, and the capacitor CH is connected between the opamp output and its inverting input. This will cause the output voltage to be equal to Vin, irrespective of the input-offset voltage of the opamp. Note that this circuit is an example of a sample-and-hold that is not thought of as a track-and-hold circuit. Specifically, during the sample phase, the opamp output voltage will be very close to 0 V (or whatever reference potential is connected to the positive opamp terminal in Fig. 11.15) rather than tracking the input voltage. This places a requirement on the opamp to have a very large slew rate, or the speed is seriously degraded. Also, obviously, the opamp output is invalid during 1, the sample phase.\nImage Name: (a)\nDescription:\n[\nName: C1, Type: Capacitor, Value: C1, Ports: {Np: Vin, Nn: InN(A1)}\nName: C2, Type: Capacitor, Value: C2, Ports: {Np: Vout, Nn: Out(A1)}\nName: A1, Type: OpAmp, Value: A1, Ports: {InP: GND, InN: InN(A1), OutP: Out(A1)}\n]\nAdditional Information: This is a sample-and-hold circuit in sample mode. The op-amp output is invalid during the sample phase, and the input voltage is sampled across capacitor C1. The output voltage is held by capacitor C2.\nImage Name: (b)\nDescription:\n[\nName: C1, Type: Capacitor, Value: C1, Ports: {Np: InN(A1), Nn: Vout}\nName: C2, Type: Capacitor, Value: C2, Ports: {Np: Vout, Nn: Out(A1)}\nName: A1, Type: OpAmp, Value: A1, Ports: {InP: GND, InN: InN(A1), OutP: Out(A1)}\n]\nAdditional Information: The circuit represents a sample-and-hold configuration in hold mode with two capacitors and an operational amplifier. C1 is connected between the input and output, while C2 is connected between the output and ground. The op-amp is configured with its non-inverting input grounded.\n\nImage Name: Fig. 11.14 The circuit configurations of the S/H of Fig. 11.13 during (a) sample mode and (b) hold mode.\nImage Name: Fig. 11.16\nDescription:\n[\nName: 1, Type: NMOS, Ports: {S: Vin, D: X, G: 1}\nName: 2, Type: NMOS, Ports: {S: X, D: Vout, G: 2}\nName: C_H, Type: Capacitor, Value: C_H, Ports: {Np: X, Nn: InN(A1)}\nName: 1, Type: NMOS, Ports: {S: InN(A1), D: Vout, G: 1}\nName: A1, Type: OpAmp, Value: A1, Ports: {InP: GND, InN: InN(A1), OutP: Vout}\n]\nAdditional Information: The circuit represents a sample-and-hold configuration in hold mode with two capacitors and an operational amplifier. The op-amp is configured with its non-inverting input grounded. During sampling, all switches are on except 2.\n\nImage Name: Fig. 11.15 A simple switched-capacitor S/H.\nImage Name: Fig. 11.15\nDescription: The circuit represents a sample-and-hold configuration in hold mode with two capacitors and an operational amplifier. The op-amp is configured with its non-inverting input grounded. During sampling, all switches are on except 2.\n\nImage Name: Fig. 11.16 A recycling S/H.\n\nAn interesting variation somewhat similar to the S/Hs of Figs. 11.13 and 11.15 adds two unity-gain buffers and two more switches to help improve accuracy. The S/H is shown in Fig. 11.16 [Real, 1991]. During sampling, all switches are on except Q2. This connects C1 and C2 together and charges them to the input voltage. During this time, the input impedance is quite large due to the inclusion of buffer B1. At the same time, the opamp is being reset and the positive terminal of the opamp is charged to 0 V. Next, Q4 and Q5 are turned off, and shortly thereafter Q1 and Q3 are turned off. Finally, Q2 is turned on. This configures the circuit as shown in Fig. 11.17. Note the similarity between this configuration and that of Fig. 11.14(b). The unity-gain feedback holds the output during this phase, and also the output impedance of the S/H is very low. Because Q4 and Q5 turn off slightly before Q1 and Q3, their clock feedthrough is not only signal independent but largely cancels due to the common-mode rejection of the input stage of the amplifier [Martin, 1987]. The charge injection of Q1 and Q2 does not affect the output voltage. The charge injection of Q3 is signal dependent and does affect the output voltage, but its effect is minimized by the loop gain similar to the S/H of Fig. 11.13.\n\nAn interesting variation on the S/Hs of Figs. 11.10 and 11.15 is the S/H shown in Fig. 11.18 from [Gatti, 1992]. This T/H has an output that is always valid and incorporates a number of features. During sample mode, the input-offset voltage of the first opamp is stored across C_OF. At the same time, C_S is sampling the input voltage, and the second opamp is holding the previously-sampled input voltage. During the next phase, the input-offset voltage of the first opamp is eliminated, and C_S is connected to the output while the feedback loop is enabled. This arrangement causes the output voltage to be equal to the just-sampled input voltage. The clock feedthrough of switch S2 is cancelled by the clock feedthrough of switch S3. The clock feedthrough of switch S5 is cancelled by the clock feedthrough of switch S6 and the added buffer network. The other switches ideally do not cause appreciable errors due to clock feedthrough. The details concerning the operation of this T/H and the required clocking waveforms are left for the interested reader to consult [Gatti, 1992].\nImage Name: Fig. 11.17\nDescription: The circuit is a sample-and-hold with a low-pass filter, used for converting a sampled-data signal to a continuous-time signal in a DAC application. It includes buffers and an operational amplifier for signal processing.\n\nImage Name: Fig. 11.17 The S/H of Fig. 11.16 when in hold mode.\n\nYet another example of a switched-capacitor S/H is shown in Fig. 11.19 [Sooch, 1991]. This circuit combines a sample-and-hold with a low-pass filter and was used to convert a signal from the sampled-data domain to the continuous-time domain at the output of a high-quality audio digital-to-analog converter based on oversampling techniques. The low-pass filtering was used to help convert from a single-bit high-frequency signal to a decimated lower-frequency multi-bit signal. During 1, C1 is connected between the input voltage and ground. Next, during 2, it is connected between the output and the inverting input of the opamp. At this time, its charge is shared with the charge being stored across C2, which came from previous samples. For low-frequency signals, the output voltage will equal the input voltage in the steady state. Higher frequency changes in the input signal will be low-pass filtered. For C2 greater than C1 by at least a few times, it can be shown using switched-capacitor analysis techniques [Martin, 1980] that the -3dB frequency of the low-pass filter is approximately given by:\n\nf_{-3dB}  (1/(2)) * (C1/C2) * f_{clk}  (11.7)\n\nwhere f_{clk} is the clock frequency. While this example does not eliminate the effects of opamp finite-input voltage offsets, unlike the previous two examples, it does have the advantage that its output is always valid.\n\nThe switched-capacitor sample-hold circuits just shown (except for that of Fig. 11.18) do have dc offsets due to clock feedthrough from the switches connected to the inverting inputs of the opamps. However, these offsets are largely signal independent assuming the opamp has a reasonable gain. Also, it is possible to minimize these offsets by including a clock-feedthrough cancellation network connected to the positive input of the opamp, similar to what is described in [Martin, 1987]. Alternatively, fully differential sample-and-holds can be used, which also helps minimize the effects of clock feedthrough.\n```"
},
{
    "text": "The textual descriptions corresponding to the images in the provided context are as follows:\n\nFor Fig. 11.10:\n- An NMOS transistor named Q1 with source S connected to X, drain D connected to InN(A1), and gate G connected to clk.\n- An NMOS transistor named Q2 with source S connected to GND, drain D connected to X, and gate G connected to clk_bar.\n- A resistor named R1 with a value of R, having ports N1 connected to Vin and N2 connected to X.\n- A resistor named R2 with a value of R, having ports N1 connected to X and N2 connected to Vout.\n- A capacitor named C with a value of C, having ports Np connected to InN(A1) and Nn connected to Vout.\n- An operational amplifier named A1 with ports InP connected to GND, InN connected to InN(A1), and OutP connected to Vout.\n\nFor Fig. 11.11:\n- An NMOS transistor named Q1 with source S connected to Vin, drain D connected to InP(A1), and gate G connected to clk.\n- An NMOS transistor named Q2 with source S connected to Vout, drain D connected to InN(A1), and gate G connected to clk.\n- A capacitor named C1 with a value of C1, having ports Np connected to InP(A1) and Nn connected to GND.\n- A capacitor named C2 with a value of C2, having ports Np connected to InN(A1) and Nn connected to Vout.\n- An operational amplifier named A1 with ports InP connected to InP(A1), InN connected to InN(A1), and OutP connected to Vout.\n\nFor Fig. 11.13 (sample mode):\n- A capacitor named C1 with a value of C1, having ports Np connected to Vin and Nn connected to InN(A1).\n- A capacitor named C2 with a value of C2, having ports Np connected to Vout and Nn connected to Out(A1).\n- An operational amplifier named A1 with ports InP connected to GND, InN connected to InN(A1), and OutP connected to Out(A1).\n\nFor Fig. 11.13 (hold mode):\n- A capacitor named C1 with a value of C1, having ports Np connected to InN(A1) and Nn connected to Vout.\n- A capacitor named C2 with a value of C2, having ports Np connected to Vout and Nn connected to Out(A1).\n- An operational amplifier named A1 with ports InP connected to GND, InN connected to InN(A1), and OutP connected to Out(A1).\n\nFor Fig. 11.16:\n- An NMOS transistor named 1 with source S connected to Vin, drain D connected to X, and gate G connected to 1.\n- An NMOS transistor named 2 with source S connected to X, drain D connected to Vout, and gate G connected to 2.\n- A capacitor named C_H with a value of C_H, having ports Np connected to X and Nn connected to InN(A1).\n- An NMOS transistor named 1 with source S connected to InN(A1), drain D connected to Vout, and gate G connected to 1.\n- An operational amplifier named A1 with ports InP connected to GND, InN connected to InN(A1), and OutP connected to Vout.\n\nFor Fig. 11.15:\n- The same as the description for Fig. 11.16.\n\nFor Fig. 11.17:\n- The same as the description for Fig. 11.13 (hold mode).\n\nFor Fig. 11.18:\n- An NMOS transistor named 1 with source S connected to Vin, drain D connected to X, and gate G connected to 1.\n- An NMOS transistor named 2 with source S connected to X, drain D connected to Vout, and gate G connected to 2.\n- A capacitor named C_H with a value of C_H, having ports Np connected to X and Nn connected to InN(A1).\n- An NMOS transistor named 1 with source S connected to InN(A1), drain D connected to Vout, and gate G connected to 1.\n- An operational amplifier named A1 with ports InP connected to GND, InN connected to InN(A1), and OutP connected to Vout.\n\nFor Fig. 11.19:\n- The same as the description for Fig. 11.18."
},
{
    "text": "Image Descriptions: All images referenced within the [Context Provided] section have been converted into textual representations. Additionally, these descriptions have been rephrased to preserve the original intent and length.\n---[Task]---\nPlease rephrase the content provided in the [Context Provided] Section while ensuring that the meaning remains intact and the length is maintained. Present only the revised text."
},
{
    "text": "Fig. 11.10 depicts a sample-and-hold (S/H) circuit equipped with clock-feedthrough cancellation. It incorporates two NMOS transistors, Q1 and Q2, which handle the sampling and retention of the input signal Vin. An operational amplifier, A1, ensures the output voltage stability, while resistors and capacitors manage the circuit's timing and stability.\n\nIn Fig. 11.11, an inverting track and hold circuit is presented, while Fig. 11.12 showcases a noninverting sample-and-hold circuit with clock-feedthrough cancellation. NMOS transistors Q1 and Q2, governed by the clock signal clk, manage the sampling and holding processes. Capacitors C1 and C2 are employed for stability and timing control, with A1 stabilizing the output voltage.\n\nThis section delves into various CMOS S/H circuit designs, noting that the optimal S/H circuit selection hinges on specific application needs and available technology, making it a complex and ongoing research topic. It is challenging to definitively categorize these configurations as superior or inferior.\n\nIt's important to recognize that many of these circuits could also be implemented in BiCMOS technology, potentially enhancing speed by increasing the unity-gain frequency of opamps. For even greater speed, a BiCMOS circuit can leverage a bipolar diode bridge, as discussed in Section 11.4.\n\nThe S/H circuit in Fig. 11.11 is designed for high-speed operation, contingent upon the availability of a high-speed opamp capable of driving resistive loads. However, such opamps are elusive in CMOS technologies. Additionally, the necessary output buffer could constrain speed and signal swing. In bipolar and BiCMOS technologies, this configuration could be a promising alternative. During track mode, Q1 is active and Q2 is inactive, resulting in an inverting low-pass circuit with a -3dB frequency of -3dB = 1/(RC). When Q1 turns off, the output voltage remains constant. Since Q1's junctions are always at voltages close to ground, the clock feedthrough of this sample-and-hold is signal-independent. Moreover, finite clock rise and fall times don't make the sampling time dependent on the signal. Q2's role is to minimize signal feedthrough during hold mode and maintain the resistive network's common node voltage when transitioning back to track mode. In the implementation described in [Ishikawa, 1988], an additional small bypass capacitor was included in parallel to the input resistor, reportedly improving the S/H speed.\n\nFig. 11.12 presents another alternative, featuring a track-and-hold circuit that configures the opamp as a unity-gain follower during track mode, with the positive input terminal connected to Vin. In hold mode, the input signal is stored across C1 as Q1 is turned off, and Q2 is also inactive. Ideally, the signal-dependent charge feedthrough from Q1 is matched by Q2's feedthrough, as both are at the same voltage and have identical clock waveforms. This requires a low-impedance opamp output. Additionally, signal dependence of clock signals can be minimized by ensuring they change above and below the input signal by fixed amounts. While this can be partially achieved using a high-output impedance OTA with a load capacitor connected to ground, it's more challenging in CMOS technology. Nevertheless, the topology in Fig. 11.12 is appealing for high-speed CMOS applications that are not excessively demanding.\n\nFig. 11.13 and 11.14 illustrate another S/H architecture, utilizing an operational amplifier and two capacitors in sample and hold modes, respectively. During sample mode, the opamp is reset, and both capacitors are connected between the input voltage and the opamp's virtual input. In hold mode, the effective hold capacitor is the Miller capacitor, which is typically much larger than the capacitance charged during sampling mode. This allows for smaller capacitors and switches. Since the amplifier's output voltage changes are minimal, it can be designed for very high speed. The sampling switch, Q1, injects signal-dependent charge, but this is mitigated by the large Miller hold capacitance, especially if Q2 is turned off slightly before Q1.\n\nAt lower frequencies, switched-capacitor technology-based S/H circuits are often employed, offering precision but not necessarily speed. A simple example is depicted in Fig. 11.15. This S/H is similar to the one in Fig. 11.13, with capacitor CH connected between the input signal source and the opamp's inverting input during 1. During 2, the opamp is taken out of reset mode, and CH is connected between the opamp output and its inverting input, ensuring the output voltage equals Vin. Note that this circuit, unlike traditional track-and-hold circuits, doesn't track the input voltage during the sample phase. This necessitates a very large slew rate opamp to prevent speed degradation. Additionally, the opamp output is invalid during the sample phase.\n\nFig. 11.16 presents a recycling S/H circuit, incorporating two unity-gain buffers and additional switches to enhance accuracy. During sampling, all switches are on except Q2, connecting C1 and C2 and charging them to the input voltage. The opamp is reset, and the positive terminal is charged to 0 V. Subsequently, Q4 and Q5 are turned off, followed by Q1 and Q3. Finally, Q2 is turned on, configuring the circuit as shown in Fig. 11.17. This configuration is similar to Fig. 11.14(b), with unity-gain feedback maintaining the output and ensuring a very low output impedance. The clock feedthrough of Q4 and Q5 is signal-independent and largely cancelled due to the amplifier's input stage common-mode rejection. The charge injection of Q1 and Q2 doesn't affect the output voltage, while Q3's injection is signal-dependent but minimized by the loop gain.\n\nAn interesting variation on the S/H circuits in Figs. 11.10 and 11.15 is presented in Fig. 11.18 from [Gatti, 1992]. This T/H features an always-valid output and several unique characteristics. During sample mode, the first opamp's input-offset voltage is stored across COF, while CS samples the input voltage, and the second opamp retains the previously-sampled input voltage. In the next phase, the first opamp's input-offset voltage is eliminated, and CS is connected to the output with the feedback loop enabled, causing the output voltage to equal the just-sampled input voltage. The clock feedthrough of switches S2 and S3 is cancelled, as is S5's feedthrough by S6 and the added buffer network. The remaining switches ideally don't cause significant errors due to clock feedthrough.\n\nFig. 11.19 displays a switched-capacitor S/H circuit combined with a low-pass filter, used to convert a sampled-data signal to a continuous-time signal at the output of a high-quality audio digital-to-analog converter based on oversampling techniques. The low-pass filtering aids in converting a single-bit high-frequency signal to a decimated lower-frequency multi-bit signal. During 1, C1 is connected between the input voltage and ground. During 2, it is connected between the output and the opamp's inverting input, sharing its charge with C2's stored charge from previous samples. For low-frequency signals, the output voltage equals the input voltage in steady state, while higher frequency changes are low-pass filtered. For C2 greater than C1 by at least a few times, the -3dB frequency of the low-pass filter is approximately given by f-3dB  1/(2) * (C1/C2) * fclk, where fclk is the clock frequency. This example doesn't eliminate opamp finite-input voltage offsets but offers the advantage of an always-valid output.\n\nThe switched-capacitor sample-hold circuits discussed (except for Fig. 11.18) exhibit dc offsets due to clock feedthrough from switches connected to the inverting inputs of opamps. However, these offsets are largely signal-independent assuming a reasonable opamp gain. Additionally, they can be minimized by incorporating a clock-feedthrough cancellation network connected to the positive input of the opamp, as described in [Martin, 1987]. Alternatively, fully differential sample-and-holds can be utilized, further mitigating the effects of clock feedthrough."
}
]